/**
 * @name CeL data for era calendar.
 * @fileoverview 本档案包含了东亚传统历法/中国传统历法 (traditional civil
 *               calendar)，农历、夏历、阴历的各纪年期间历数资料。
 * 
 * @summary <code>

TODO:

任意线图阶层，不只(纪年名称索引值)所示。


https://cs.wikipedia.org/wiki/Seznam_p%C5%99edstavitel%C5%AF_%C4%8Desk%C3%A9ho_st%C3%A1tu

https://en.wikipedia.org/wiki/Lists_of_rulers_of_Greece

https://en.wikipedia.org/wiki/Ancient_history
https://en.wikipedia.org/wiki/Lists_of_ancient_kings
https://en.wikipedia.org/wiki/Middle_chronology
https://en.wikipedia.org/wiki/Chronology_of_the_ancient_Near_East
https://zh.wikipedia.org/wiki/%E5%80%AD%E9%A9%AC%E4%BA%9A%E7%8E%8B%E6%9C%9D
https://zh.wikipedia.org/wiki/%E7%8E%B0%E4%BB%BB%E4%B8%BB%E6%9D%83%E5%9B%BD%E5%AE%B6%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

https://en.wikipedia.org/wiki/List_of_kings_of_Axum


中国君主列表 (地方政权)
https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9C%8B%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8_%28%E5%9C%B0%E6%96%B9%E6%94%BF%E6%AC%8A%29


http://www.lib.nankai.edu.cn/gj/showwords.asp?airid=251
先秦古籍所据历法较为混乱。一般说，《春秋》、《孟子》多用周历，《楚辞》、《吕氏春秋》用夏历，《诗经》要看具体诗篇而定。若不了解这种情况，而以现行夏历的时间概念去阅读古籍，有时就难以理解某些记载，或者会怀疑古人搞错了时间。如《春秋‧成公八年》记载著「二月无冰」这一现象，因为该书用周历，二月即夏历的十二月，是最冷的月份，无冰在当时是罕见的，因而才载入史册。


唐以后帝王避讳名表
http://140.111.1.40/fulu/fu8/newpage1.htm


拓本文字データベース
http://coe21.zinbun.kyoto-u.ac.jp/djvuchar
墓志数据库-浙大墓志库
http://csid.zju.edu.cn/tomb/stone


bug:
同庆乙酉年



// ----------------------------------//

闽越
https://zh.wikipedia.org/wiki/%E6%B1%89%E6%9C%9D%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8


大天兴（兴源国）（928年-929年）
https://zh.wikipedia.org/wiki/%E5%A4%A7%E5%A4%A9%E8%88%88
年号尊圣。
大理国
https://zh.wikipedia.org/wiki/%E9%9B%B2%E5%8D%97%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
https://zh.wikipedia.org/wiki/%E5%A4%A7%E7%90%86%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

私年号
https://ja.wikipedia.org/wiki/%E7%A7%81%E5%B9%B4%E5%8F%B7

関东の三岛暦では天正10年に闰12月がありますが、京暦では天正11年に闰1月 があり、年初が1か月ずれています[7]。これも京暦に拠りました (1990年ＮＨＫ「歴史诞生」で话题になりました)。
木场明志	本能寺の変と天正10年の暦	雑志『文明のクロスロード』第45号(1993)pp.29-37

九州年号


韩国君主列表
https://ko.wikipedia.org/wiki/%ED%95%9C%EA%B5%AD%EC%9D%98_%EA%B5%B0%EC%A3%BC_%EB%AA%A9%EB%A1%9D

http://www.math.snu.ac.kr/~kye/others/lunar.html
음양력 변환 阴阳历转换
http://astro.kasi.re.kr/Life/ConvertSolarLunarForm.aspx?MenuID=115
http://astro.kasi.re.kr/Life/Knowledge/solar2lunar/convert_daily_l2s.php


宋、金时期存在的君主制国家与藩镇等


+藏历

+蒙古历

+印度年表
+寮国年表


+Ab urbe condita (AUC)


+敦煌历



+兰芳
	Lanfang : [
			{
				a : {
					T : '兰芳'
				},
				R : '兰芳大统制共和国（1777年—1884年），别称兰芳共和国，1777年当年定为「兰芳元年」。兰芳一百零八年(西元1884年) 灭亡。',
				href : 'https://zh.wikipedia.org/wiki/%E8%98%AD%E8%8A%B3%E5%85%B1%E5%92%8C%E5%9C%8B'
			}, Year_numbering(-1776) ]



俄国历法 （Pycckий kaπeHдapb） 俄国古代采用「Byzantine calendar」。最初记载历法的《编年史》将公元前5508年定为「Byzantine calendar」的元年，新年从3月1日开始。
公元1492年以后改为从9月1日开始。1699年12月15日彼得一世下令采用儒略历（旧历），将「Byzantine calendar」7208年12月31日之次日改为1700年1月1日。儒略历每年平均为365.25日，比回归年长11分14秒。这一微小误差导致每128年节气日期提前1天。1582年，教皇格列高利十三世实行历法改革，将当年春分由旧历3月11日，将日期后移10天。并规定新历除能用400整除的世纪年（如1600年，2000年）置闺外，其他世纪年（如1700年、1800年、1900年）不置闺。从而使新历每400年较旧历少3天。历法改革造成了旧历和新历在日期上的差距。18世纪旧历日期比新历日期早11天，19世纪早12天，20世纪早13天。1918年1月26日，苏俄政府宣布停止使用旧历，采用新历（即公历）。





 </code>
 * @since 2013/2/13 12:45:44
 */

'use strict';

// console.info('Starting to load era data.');

// node 中, 此处 this === undefined

/** {Object}为了不污染 global，在 loading 时传递的暂时工作空间 temporary working space */
CeL.era.pass_on = {
	countries : Object.create(null),
	last_day : '2101/1/29'
};

// era.精=:历史上这个时期历法与公元的对照本来就无法追溯得精准至日，甚至历法本身就不够精准。
// era.准=:历史上这个时期历法与公元的对照应该非常精准，但是本数据库的资料准确程度不足。
// era.疑=:历史上这个时期历法与公元的对照应该非常精准，本数据库的资料尺度标示也很精准，但是本数据库的资料实际上存在疑问、可能不准确。

/**
 * data from <a href="http://sinocal.sinica.edu.tw/" accessdate="2013/3/17
 * 19:23">中央研究院 两千年中西历转换</a>
 */
// gettext_config:{"id":"china"}
(CeL.era.pass_on.countries["中国"] = [
		// Chinese: 中国传统历法。

		// 共和元年(841 BCE)是中国历史上有确切纪年的开始。
		'西周/共伯和/共和|-841~||精=年|朝代=周',
		'=/宣王|-827~||君主名=姬静;姬靖|精=年|卒=前782年|在位=前828年~前782年|注=姬姓，名静，一作靖。|注=张培瑜《逨鼎的月相纪日和西周年代》2003年《文物》6期：《史纪》周宣王纪年应移后一年。宣王元年应是公元前826年。宣王46年应是公元前781年。惟2012年 叶正渤《逨鼎铭文历法解疑》：<q>逨鼎诸器属于厉王时期器物。厉王在位37年，厉王纪年包括共和行政14年在内。共和行政既没有改元，也没有单独纪年。</q>',
		'/幽王|-781~||君主名=姬宫涅;姬宫湦|精=年|据=史记|君主名=姬宫涅;姬宫湦|生=前795年? (前795年？)|卒=前771年|在位=前781年~前771年',
		'东周/携王|-770~-750||精=年|朝代=周|君主=携惠王|君主名=姬余臣|据=《清华大学藏战国竹简（贰）·系年·第二章》：周幽王取（娶）妻于西申，生坪（平）王，王或（又）取（娶）孚（褒）人之女，是孚（褒）姒，生白（伯）盘。孚（褒）姒辟（嬖）于王，王与白（伯）盘迖（逐）坪（平）王，坪（平）王走西申。幽王起师，回（围）坪（平）王于西申，申人弗畀，曾（缯）人乃降西戎，以攻幽王，幽王及白（伯）盘乃灭，周乃亡。邦君、者（诸）正乃立幽王之弟余臣于虢（携?），是携惠王。立廿（二十）又一年，晋文侯仇乃杀惠（携?）王于虢（携?）。周亡王九年，邦君者（诸）侯焉始不朝于周，晋文侯乃逆坪（平）王于少鄂，立之于京师。三年，乃东徙，止于成周，晋人焉始启于京师，奠（郑）武公亦政（正）东方之者（诸）侯。武公即世，庄公即立（位）。|卒=前750年|在位=前771年~前750年',
		'/平王|-770~||精=年|据=史记|君主名=姬宜臼|卒=前720年|在位=前770年~前720年',
		'/桓王|-719~||精=年|君主名=姬林|卒=前697年|在位=前719年~前697年',
		'/庄王|-696~||君主名=姬佗;姬仲|精=年|卒=前682年',
		'/僖王|-681~||精=年|君主名=姬胡齐|君主=厘王|卒=前677年|在位=前681年~前677年',
		'/惠王|-676~||精=年|君主名=姬阆|卒=前653年或前652年|在位=前673年~前653年或前652年',
		'/襄王|-651~||精=年|君主名=姬郑|卒=前619年',
		'/顷王|-618~||精=年|君主名=姬壬臣|卒=前613年',
		'/匡王|-612~||精=年|君主名=姬班|卒=前607年',
		'/定王|-606~||精=年|君主名=姬瑜|卒=前586年',
		'/简王|-585~||精=年|君主名=姬夷|卒=前572年',
		'/灵王|-571~||君主名=姬泄心|精=年|卒=前545年|在位=前571年~前545年',
		'/景王|-544~||精=年|君主名=姬贵|卒=前520年|在位=前544年~前520年',
		'/敬王|-519~||精=年|君主名=姬匄|生=前6世纪?|卒=前477年|在位=前519年~前477年',
		'/元王|-475~||精=年|君主名=姬仁|卒=前469年',
		'/贞定王|-468~||精=年|君主名=姬介|卒=前441年',
		'/考王|-440~||精=年|君主名=姬嵬|卒=前426年',
		'/威烈王|-425~||精=年|君主名=姬午|卒=前402年',
		'/安王|-401~||精=年|君主名=姬骄|卒=前376年',
		'/烈王|-375~||精=年|君主名=姬喜|卒=前369年',
		'/显王|-368~||精=年|君主名=姬扁|卒=前321年',
		'/慎靓王|-320~||精=年|君主名=姬定|卒=前315年',
		'/赧王|-314~-256||精=年|君主=周隐王|君主名=姬延|卒=前256年|注=《竹书纪年》作周隐王|注=王五十九年，驾崩。是年，秦迁九鼎，占王畿，灭东周。',

		// ----------------------------------//
		// 中国周朝春秋十二诸侯国 / 战国七雄
		// https://zh.wikipedia.org/wiki/%E5%91%A8%E6%9C%9D%E8%AB%B8%E4%BE%AF%E5%9C%8B%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
		// https://zh.wikipedia.org/wiki/%E6%88%B0%E5%9C%8B%E6%AD%B7%E5%8F%B2%E5%B9%B4%E8%A1%A8

		'宋国/僖公|-858~||精=年|君主名=子举|君主=厘公|诸侯国=宋|时期=周诸侯国|卒=前831年',
		'/惠公|-830~||精=年|君主名=子覵|卒=前800年',
		'/戴公|-799~||精=年|卒=前766年|在位=前799年~前766年',
		'/武公|-765~||精=年|卒=前748年',
		'/宣公|-747~||精=年|卒=前729年',
		'/穆公|-728~||精=年|卒=前720年',
		'/殇公|-719~||精=年|卒=前710年',
		'/溤|-710~||精=年',
		'/愍公|-691~||精=年',
		'/桓公|-681~||精=年',
		'/襄公|-650~||精=年|卒=前637年|在位=前650年~前637年',
		'/成公|-636~||精=年|君主名=兹甫;兹父|卒=前620年',
		'/昭公|-619~||精=年',
		'/文公|-610~||精=年|卒=前589年|在位=前610年~前589年',
		'/共公|-588~||精=年|卒=前576年',
		'/平公|-575~||精=年|卒=前532年',
		'/元公|-531~||精=年|卒=前517年|在位=前531年~前517年',
		'/景公|-516~-476||精=年|卒=前469年|在位=前516年~前469年',

		// https://zh.wikipedia.org/wiki/%E6%99%8B%E5%9B%BD%E5%90%9B%E4%B8%BB
		'晋国/靖侯|-858~||精=年|时期=周诸侯国',
		'/厘侯|-840~||精=年|卒=前823年',
		'/献侯|-822~||精=年',
		'/穆侯|-811~||精=年|君主=穆侯弗生|卒=前785年|在位=前812年~前785年',
		'/殇叔|-784~||精=年|卒=前781年|在位=前785年~前781年',
		'/文侯|-780~||精=年|生=前805年|卒=前746年|在位=前781年~前746年',
		'/昭侯|-745~||精=年|在位=前745年~前740年',
		'/孝侯|-739~||精=年|在位=前739年~前724年',
		'/鄂侯|-723~||精=年',
		'/哀侯|-717~||精=年|在位=前718年~前709年',
		'/小子|-709~||精=年',
		'/缗|-706~-679||精=年',
		// 晋昭侯把曲沃封给晋文侯的弟弟桓叔。晋国分裂为翼和曲沃。
		'/桓叔|-744~||精=年|在位=前745年－前731年|君主=曲沃桓叔',
		'/庄伯|-730~||精=年|在位=前731年－前716年|君主=曲沃庄伯',
		'/武公|-715~||精=年|在位=前716年－前677年|君主=曲沃武公',
		'/献公|-676~||精=年|在位=前676年~前651年',
		'/惠公|-650~||精=年|君主名=姬夷吾|卒=前637年|在位=前650年~前637年',
		'/文公|-636~||精=年|生=前672年|卒=前628年|在位=前636年夏历二月~前628年夏历9月9日(儒略历10月27日)',
		'/襄公|-627~||精=年|在位=前627年~前621年',
		'/灵公|-620~||精=年',
		'/成公|-606~||精=年|在位=前606年~前600年',
		'/景公|-599~||精=年',
		'/厉公|-580~||精=年|在位=前580年~前573年',
		'/悼公|-572~||精=年',
		'/平公|-557~||精=年|在位=前557年~前532年',
		'/昭公|-531~||精=年|在位=前531年~前526年',
		'/顷公|-525~||精=年|在位=前525年~前512年',
		'/定公|-511~||精=年',
		'/出公|-474~||精=年|卒=前452年|在位=前474年~前452年',
		'/敬公|-451~||精=年|卒=前434年|在位=前451年~前434年',
		'/幽公|-433~||精=年',
		'/烈公|-415~||精=年',
		'/桓公|-388~-369||精=年',

		'齐国/胡公|-862~||精=年|诸侯国=姜齐|时期=周诸侯国|君主名=姜静;吕静|卒=前860年|在位=前862年~前860年',
		'/献公|-859~||精=年|君主名=姜山;吕山|卒=前851年|在位=前859年~前851年',
		'/武公|-850~||精=年|卒=前825年|在位=前850年~前825年',
		'/厉公|-824~||精=年|卒=前816年|在位=前824年~前816年',
		'/文公|-815~||精=年|卒=前804年|在位=前815年~前804年',
		'/成公|-803~||精=年|卒=前795年',
		'/庄公姜购|-794~||精=年|君主名=姜购|君主=齐庄公|卒=前731年|在位=前794年~前731年',
		'/厘公|-730~||精=年|卒=前698年|在位=前730年~前698年',
		'/襄公|-697~||精=年|卒=前686年|在位=前697年~前686年',
		'/桓公姜小白|-685~||精=年|君主名=姜小白|君主=齐桓公|卒=前643年10月7日|在位=前685年~前643年',
		'/孝公|-642~||精=年|卒=前633年|在位=前642年~前633年',
		'/昭公|-632~||精=年|在位=前632年~前613年',
		'/懿公|-612~||精=年|卒=前609年|在位=前612年~前609年',
		'/惠公|-608~||精=年|卒=前599年|在位=前608年~前599年',
		'/顷公|-598~||精=年|卒=前582年|在位=前598年~前582年',
		'/灵公|-581~||精=年|卒=前554年|在位=前581年~前554年',
		'/庄公姜光|-553~||精=年|君主名=姜光|君主=齐庄公|卒=前548年|在位=前553年~前548年',
		'/景公|-547~||精=年|在位=前547年~前490年',
		'/晏孺子|-489~||精=年|在位=前489年',
		'/悼公|-488~||精=年|在位=前488年~前485年',
		'/简公|-484~||精=年|在位=前484年~前481年',
		'/平公|-480~||精=年|卒=前456年|在位=前480年~前456年',
		'/宣公|-455~||精=年|卒=前405年|在位=前455年~前405年',
		'/康公|-404~-379||精=年|卒=前379年|在位=前404年~前386年',

		'田齐/田悼|-410~||精=年|时期=周诸侯国',
		'/田和|-404~||精=年',
		'/太公|-386~||精=年|君主名=田和|卒=前384年|在位=前404年~前384年，前386年改年称元年',
		'/田剡|-383~||精=年',
		'/桓公|-374~||精=年',
		'/威王|-356~||精=年',
		'/宣王|-319~||精=年',
		'/愍王|-300~||精=年',
		'/襄王|-283~||精=年',
		'/田建|-264~-221||精=年',

		'蔡国/武侯|-863~||精=年|时期=周诸侯国',
		'/夷侯|-837~||精=年',
		'/厘侯|-809~||精=年',
		'/共侯|-761~||精=年',
		'/戴侯|-759~||精=年',
		'/宣侯|-749~||精=年',
		'/桓侯|-714~||精=年',
		'/哀侯|-694~||精=年',
		'/穆侯|-674~||精=年',
		'/庄侯|-645~||精=年',
		'/文侯|-611~||精=年',
		'/景侯|-591~||精=年|在位=前541年~前510年',
		'/灵侯|-542~||精=年',
		'/平侯|-530~||精=年',
		'/悼侯|-521~||精=年',
		'/昭侯|-518~||精=年',
		'/成侯|-490~-476||精=年',

		'陈国/幽公|-854~||精=年|时期=周诸侯国',
		'/厘公|-831~||精=年',
		'/武公|-795~||精=年',
		'/夷公|-780~||精=年',
		'/平公|-777~||精=年',
		'/文公|-754~||精=年',
		'/桓公|-744~||精=年',
		'/厉公|-706~||精=年',
		'/庄公|-699~||精=年',
		'/宣公|-692~||精=年',
		'/穆公|-647~||精=年',
		'/共公|-631~||精=年',
		'/灵公|-613~||精=年',
		'/成公|-598~||精=年',
		'/哀公|-568~||精=年',
		'/惠公|-533~||精=年',
		'/怀公|-505~||精=年',
		'/愍公|-501~-479||精=年',

		/**
		 * 孔子《春秋》曲循经传历日
		 * 
		 * @see https://zh.wikipedia.org/wiki/%E9%B2%81%E5%9B%BD
		 *      http://blog.sina.com.cn/s/blog_bdbfa6720102wm31.html
		 * @seealso 杜预《春秋长历》，原书已佚，今本是清四库馆臣从《永乐大典》中辑出的，附于杜预《春秋释例》之后。按此书主要以《干度历》推算朔闰，凡与经传不符者则附以作者考证
		 */
		'鲁春秋|-722/1/16~-479/12/19|-722/=591 3qsc49u 4i9 3gb048a 3a8s445 3mn046i 5d1 49u 4pl85as 3rf052k 505 3pt847e 5e1 3st84i0 4t983q1 3os 505 4fvg576 5s9 3sws4a9 3ep83u2 3ot 3me 4m7058y 55bg5uq 40984ic 3rd850a 46l 3poc47d 5ac 57d85uw 5as 48a 3mwc505 46i 4of05ag 57h84a0 4plo3px 3my 4mgc591 3sd84gy 5e9 4a9 3px 3my 4g4s579 47e 4sh84sp85es 3t584ac 446 42y 4o185d1 3z4s4h4 5es 48k 44a 3mng3mng4zu 5sa 4h0 5es 3t7052s 4wq 4bzg4f3g56y 554c5sh 4i9 3ep83u2 3p1 380s42e 58z 3qrw5uq 5ea 3eq448a 3p1 380s42y 4o1859e 5us 40b05as 3rd850q 4z9 3pss47e 5ah 3sws4a0 4ppo3q1 3fu 505 3pss47m 4soc5ea 4aa 3q1 325o3n1 37wc3o5 4gi 4sp84sr05ec 4ac 44a 3mp842z 3mi45s9 4h0 4t585ew 59w 4g9o3fe 4yz 3prg5s9 3z8c4i9 3u1 3hx 31p83mi 571 3ql83qrw5uq 4ia 3eq448a 3p1 381842y 4o1859h 49w 5as 3rd848c 3mwc4z9 46i 4ofg5e1 4a0 4pl85ax 32583n0 505 47e 4ros5e9 3sx84aa 3q1 325o3ot 37wc3o5 4gi 4sp85es 4ac 3qz03nt850a 4yz 42t 4h0 4sr04sr05ew 52s 50a 4bzg4z1 3prw47d 4i0 4t983u1 33xo3p1 3mi 4mgc591 47m 408c4ia 3eq448a 439 3knw42y 59h 3sd849w 5as 3rd8|参照用',
		'鲁国/伯禽|-1042~||精=年|疑|时期=周诸侯国|诸侯国=东鲁|君主=禽父|卒=前998年|在位=约前1043年~前998年|注=周公旦长子|注=江少华 从《畯簋》历日探讨西周年代: 周公摄政七年而反正成王，在这七年期间，伯禽只是代父治鲁，并没有真正受封，直到成王亲政元年，“此命伯禽俾侯于鲁之岁 也”（《汉书·律历志》），《史记集解》记载：“成王元年封，四十六年，康王十六年卒”。所以伯禽作为鲁侯的实际时间应该是7+46=53年。',
		'/考公|-996~||精=年|疑|君主名=姬酋;姬就;姬遒|卒=前994年|在位=前997年~前994年',
		'/炀公|-992~||精=年|疑|君主名=姬熙;姬怡|卒=前988年|在位=前993年~前988年|注=江少华 从《畯簋》历日探讨西周年代: 关于炀公年数，《鲁世家》记为“六年”，这应该是本文脱落所误。历代史志大体遵从炀公60年一说，如《帝王世纪》、《皇极经世》、《通鉴外纪》、《通志》、《通考》等等。',
		'/幽公|-986~||精=年|君主名=姬宰|卒=前974年|在位=前987年~前974年',
		'/魏公|-973/7~||精=年|君主名=姬沸|君主=魏微公|卒=前924年|在位=前973年~前924年|注=史记/卷033: 幽公十四年。幽公弟沸杀幽公而自立，是为魏公。当年改元??',
		'/厉公|-923~||精=年|卒=前887年|在位=前923年~前887年',
		'/献公|-886~||精=年|君主名=姬具|卒=前855年|在位=前886年~前855年 (史记: 在位32年)/汉书: 在位50年',
		'/真公|-854~||精=年|疑|据=史记鲁世家|君主名=姬濞;姬挚;姬鼻|君主=慎公|卒=前825年|在位=前854年-前825年（史记鲁世家）/前855年-前826年（史记十二诸侯表）|注=《汉书》作「慎公」',
		'/武公|-824~||精=年|疑|据=史记鲁世家|君主名=姬敖|卒=前816年|在位=前824年（史记鲁世家: 在位）/前825年（史记十二诸侯表）~前816年夏季; 9年（史记鲁世家）, 10年（史记十二诸侯表）, 2年（汉书）',
		'/懿公|-815~||精=年|卒=前807年|君主名=姬戏|在位=前815年~前807年',
		'/伯御|-806~||精=年|君主=鲁公伯御|注=前796年，周宣王伐鲁，杀伯御。鲁孝公沿用伯御纪年。',
		'/孝公|-795~|12/=:CE|精=年|君主名=姬称|卒=前769年|在位=前795年~前769年|注=前796年，周宣王率领诸侯军队讨伐鲁国，杀死伯御后拥立为鲁国君主。史记鲁周公世家记27年。史记十二诸侯年表：(前806年)鲁孝公称元年；则在位27年，纪年38年。实沿用伯御纪年。',
		'/惠公|-768~-723||精=年|君主名=姬弗湟;姬弗皇;姬弗生|卒=前723年|在位=前768年~前723年',
		'/隐公|鲁春秋-722~|:鲁春秋|准=2日|君主名=姬息;姬息姑|卒=前712年|在位=前722年正月~前712年鲁历11月15日',
		'/桓公|鲁春秋-711~|:鲁春秋|准=2日|君主名=姬允|生=约前731年10月7日|卒=10月前694年|在位=前711年鲁历11月15日~前694年4月10日',
		'/庄公|鲁春秋-693~|:鲁春秋|准=2日|君主名=姬同|君主=严公|生=前706年10月7日|卒=10月前662年|在位=前693年正月~前662年鲁历8月5日|注=《汉书》避汉讳作鲁严公',
		'/湣公|鲁春秋-661~|:鲁春秋|准=2日|君主名=姬启|君主=闵公;愍公|在位=前661年~前660年|注=《春秋》作「闵公」',
		'/厘公|鲁春秋-659~|:鲁春秋|准=2日|君主名=姬申|君主=僖公;鲁僖公|在位=前659年~前627年|注=《史记》作「厘公」。《春秋》作「僖公」。',
		'/文公|鲁春秋-626~|:鲁春秋|准=2日|君主名=姬兴|在位=前626年~前609年',
		'/宣公|鲁春秋-608~|:鲁春秋|准=2日|君主名=姬馁;姬倭|在位=前608年~前591年',
		'/成公|鲁春秋-590~|:鲁春秋|准=2日|君主名=姬黑肱;姬黑股|在位=前590年~前573年',
		'/襄公|鲁春秋-572~-542/11/26|:鲁春秋|准=2日|君主名=姬午|生=前575年|卒=前542年|在位=前572年~前542年',
		'/子野|鲁春秋-542/5/31~|:鲁春秋|准=2日|君主名=姬野|注=《春秋·襄公三十一年》：夏六月辛巳，公薨于楚宫。..秋九月癸巳，子野卒。|注=前542年六月二十八日，鲁襄公去世，鲁国人拥立太子子野即位，住在季氏那里。九月十一日，子野由于哀痛过度而死。',
		'/昭公|鲁春秋-541~|:鲁春秋|准=2日|君主名=姬稠;姬袑|卒=前510年|在位=前541年~前510年',
		'/定公|鲁春秋-509~|:鲁春秋|准=2日|君主名=姬宋|在位=前509年~前495年',
		'/哀公|鲁春秋-494~-479/12/19|:鲁春秋|准=2日|君主名=姬将;姬蒋|卒=前468年|在位=前494年~前468年',
		'/哀公|-478~-467|17/=:CE|精=年|卒=前468年|在位=前494年~前468年|注=鲁哀公27年，鲁哀公通过邾国逃到越国。《左传·哀公二十七年》：公患三桓之侈也，欲以诸侯去之。|注=此后《史记》与杨宽《战国史料编年辑证》有出入。',
		// 之后的 杨宽《战国史料编年辑证》与 史记 不同
		// http://blog.sina.com.cn/s/blog_bdbfa6720102w5zz.html

		// 资料出处: 《史记·蔡世家》
		// https://zh.wikipedia.org/wiki/%E6%9B%B9%E5%9C%8B
		'曹国/叔振铎|-1041~||精=年',
		'/太伯|-1015~||精=年',
		'/仲君|-991~||精=年',
		'/宫伯|-924~||精=年',
		'/孝伯|-884~||精=年',
		'/夷伯|-864~||精=年|时期=周诸侯国',
		'/幽伯|-834~||精=年',
		'/戴伯|-825~||精=年',
		'/惠公|-795~||精=年',
		'/穆公|-759~||精=年',
		'/桓公|-756~||精=年',
		'/庄公|-701~||精=年',
		'/厘公|-670~||精=年',
		'/昭公|-661~||精=年',
		'/共公|-652~||精=年',
		'/文公|-617~||精=年',
		'/宣公|-594~||精=年',
		'/成公|-577~||精=年',
		'/武公|-554~||精=年',
		'/平公|-527~||精=年',
		'/悼公|-523~||精=年',
		'/襄公|-514~||精=年',
		'/隐公|-509~||精=年',
		'/靖公|-505~||精=年',
		'/伯阳|-501~-487||精=年',

		'吴国/寿梦|-585~||精=年|时期=周诸侯国',
		'/诸樊|-560~||精=年',
		'/余祭|-547~||精=年',
		'/余眛|-530~||精=年',
		'/僚|-526~||精=年',
		'/阖闾|-514~||精=年',
		'/夫差|-495~-473||精=年|注=吴越争霸史事系年考辨（俞志慧）《学灯》第二十六期:句践二十四年（前473）夏历九月丁卯这一天，越灭吴，过了二十天后的夏历九月丁未，范蠡在越军回国途中，辞别句践。',

		// 《清华大学藏战国竹简（贰）·系年》
		// https://zh.wikipedia.org/wiki/%E6%A5%9A%E5%9B%BD
		// http://blog.sina.com.cn/s/blog_b7e66ce701016a9y.html
		'楚国/熊勇|-847~||精=年|时期=周诸侯国',
		'/熊严|-837~||精=年',
		'/熊霜|-827~||精=年',
		'/熊徇|-821~||精=年',
		'/熊咢|-799~||精=年|姓=芈',
		'/若敖|-790~||精=年|君主名=熊仪',
		'/宵敖|-763~||精=年',
		'/蚡冒|-757~||精=年',
		'/武王|-740~||精=年|卒=前690年|在位=前740年~前690年三月',
		'/文王|-689~||精=年|卒=前675年|在位=前689年~前675年',
		'/堵敖|-676~||精=年|君主名=熊囏;庄敖',
		'/成王|-671~||精=年|生=前?年|卒=前626年|在位=前671年~前626年',
		'/穆王|-625~||精=年|卒=前614年|在位=前625年~前614年',
		'/庄王|-613~||精=年|卒=前591年|在位=前613年~前591年',
		'/共王|-590~||精=年|生=前600年|卒=前560年|在位=前590年~前560年',
		'/康王|-559~||精=年|在位=前559年~前545年',
		'/郏敖|-544~||精=年|在位=前544年~前541年|君主=孺子王',
		'/灵王|-540~-529||精=年|在位=前540年~前529年五月',
		'/訾敖|-529~||精=年|在位=前529年春~前529年五月|君主=楚王比|注=芈姓，熊氏，名比，字子干，也被称为公子比、右尹子干。未改元',
		'/平王|-528~||精=年|在位=前528年~前516年|君主=景平王',
		'/昭王|-515~||精=年|卒=前489年|在位=前515年~前489年',
		'/惠王|-488~||精=年|卒=前432年|在位=前489年~前432年|君主=献惠王',
		'/简王|-431~||精=年|卒=前408年|在位=前431年~前408年|君主=简大王',
		'/声王|-407~||精=年|卒=前402年|在位=前407年~前402年|君主=声桓王',
		'/悼王|-401~||精=年|卒=前381年|在位=前401年~前381年|君主=悼哲王',
		'/肃王|-380~||精=年|卒=前370年|在位=前381年~前370年',
		'/宣王|-369~||精=年|卒=前340年',
		'/威王|-339~||精=年|卒=前329年|在位=前339年~前329年',
		'/怀王|-328~||精=年|卒=前299年|在位=前328年~前299年',
		'/顷王|-298~||精=年|君主=楚顷襄王',
		'/考烈王|-262~||精=年|卒=前238年',
		'/幽王|-237~||精=年',
		'/哀王|-228~||精=年|注=未改元',
		'/负刍|-227~-223||精=年|君主名=负刍|君主=楚王负刍',
		'/昌平君|-223~-223||精=年|君主名=熊启',

		'燕国/惠侯|-864~||精=年|时期=周诸侯国|卒=前827年',
		'/厘侯|-826~||精=年',
		'/顷侯|-790~||精=年',
		'/哀侯|-766~||精=年',
		'/郑侯|-764~||精=年',
		'/穆侯|-728~||精=年',
		'/宣侯|-710~||精=年',
		'/桓侯|-697~||精=年|卒=前691年|在位=前697年~前691年',
		'/庄公|-690~||精=年',
		'/襄公|-657~||精=年',
		'/前桓公|-617~||精=年',
		'/宣公|-601~||精=年',
		'/昭公|-586~||精=年',
		'/武公|-573~||精=年|卒=前555年',
		'/前文公|-554~||精=年',
		'/懿公|-548~||精=年',
		'/惠公|-544~||精=年',
		'/悼公|-535~||精=年',
		'/共公|-528~||精=年',
		'/平公|-523~||精=年',
		'/前简公|-504~||精=年|卒=前493年|在位=前504年~前493年',
		'/孝公|-497~||精=年|卒=前455年|在位=前492年~前455年',
		'/成公|-454~||精=年',
		'/闵公|-438~||精=年|卒=前415年|在位=前438年~前415年',
		'/后简公|-414~||精=年',
		'/后桓公|-372~||精=年|君主=燕献公',
		'/后文公|-361~||精=年',
		'/易王|-332~||精=年',
		'/燕王哙|-320~||精=年',
		'/昭襄王|-313~||精=年|卒=前279年|在位=前313年~前279年',
		'/惠王|-278~||精=年|卒=前271年|在位=前278年~前271年',
		'/武成王|-271~||精=年|卒=前258年',
		'/孝王|-257~||精=年|卒=前255年|在位=前257年~前255年',
		'/燕王喜|-254~-222||精=年',

		'卫国/顷侯|-866~||精=年|时期=周诸侯国',
		'/僖侯|-854~-813||精=年|君主=厘侯',
		'/共伯|-813~||精=年|注=在位两年，未改元',
		'/武公|-812~||精=年|生=前852年|卒=前758年|在位=前812年~前758年',
		'/庄公姬扬|-757~||精=年|君主名=姬扬|君主=卫庄公',
		'/桓公|-734~-719||精=年',
		'/州吁|-719~||精=年|注=在位一年。未改元',
		'/宣公|-718~||精=年|在位=前718年~前700年',
		'/惠公|-699~||精=年|注=前699年 - 前697年（史记）',
		'/黔牟|-696~||精=年|注=前696年 - 前687年（史记）',
		'/惠公|-688~||精=年|注=前686年 - 前669年（史记）未改元|注=复位',
		'/懿公|-668~-660||精=年|卒=前660年|在位=前668年~前660年',
		'/戴公|-660~||精=年|注=当年改元',
		'/文公|-659~||精=年|卒=前635年|在位=前659年~前635年',
		'/成公|-634~||精=年',
		'/穆公|-599~||精=年',
		'/定公|-588~||精=年|卒=前577年|在位=前588年~前577年',
		'/献公|-576~||精=年|君主名=姬衎|卒=前544年|在位=前576年~前559年',
		'/殇公|-558~||精=年|卒=前546年|在位=前558年~前547年',
		'/献公|-546~||精=年|在位=前546年~前544年（复位）|注=复位',
		'/襄公|-543~||精=年|卒=前535年|在位=前543年~前535年',
		'/灵公|-534~||精=年|生=前540年|卒=前493年|在位=前534年~前493年',
		'/出公|-492~||精=年|卒=前456年|在位=前493年~前481年/前477年~前470年（复位）',
		'/庄公姬蒯聩|-480~||精=年|君主名=姬蒯聩|君主=卫庄公',
		'/斑师|-478~||精=年|君主名=姬般师|君主=公孙般师|在位=前477年|注=《史记》作斑师',
		'/君起|-477~||精=年|君主=公子起',
		'/出公|-476~||精=年|注=前476年 - 前456年（史记）|注=复位',
		'/悼公|-469~||精=年|卒=前465年|在位=前469年~前465年|注=前455年 - 前451年（史记）',
		'/敬公|-464~||精=年|卒=前432年|在位=前465年~前432年|注=前450年 - 前432年（史记）',
		'/昭公|-431~||精=年|卒=前426年|在位=前432年~前426年',
		'/怀公|-425~||精=年|卒=前415年|在位=前426年~前415年',
		'/慎公|-414~||精=年|卒=前373年|在位=前415年~前373年|注=前414年 - 前373年（史记）',
		'/声公|-382~||精=年|卒=前362年|在位=前373年~前362年|注=前372年 - 前362年（史记）',
		'/成侯|-371~||精=年|卒=前343年|在位=前371年~前343年|注=前361年 - 前333年（史记）',
		'/平侯|-342~||精=年|卒=前335年|在位=前342年~前335年|注=前332年 - 前325年（史记）',
		'/嗣君|-334~||精=年|卒=前293年|在位=前334年~前293年|注=前324年 - 前383年（史记）',
		'/怀君|-292~||精=年|卒=前252年|在位=前292年~前252年|注=前282年 - 前253年（史记）',
		'/元君|-254~||精=年|卒=前230年|在位=前252年~前230年|注=前252年 - 前230年（史记）',
		'/君角|-241~-209||精=年|在位=前241年~前209年|注=前229年 - 前209年（史记）',

		'赵氏/成子|-636~||精=年|注=赵氏宗主|时期=周诸侯国',
		'/宣子|-621~||精=年',
		'/庄子|-600~||精=年',
		'/文子|-583~||精=年',
		'/景叔|-540~||精=年',
		'/简子|-517~||精=年',
		'/襄子|-475~||精=年',
		'/桓子|-424~||精=年',
		'/献子|-423~||精=年',
		'赵国/烈侯|-408~||精=年|时期=周诸侯国|卒=前400年|在位=前408年~前400年|注=赵烈侯六年（前403年），与韩、魏并立为诸侯。',
		'/武侯|-399~||精=年|卒=前387年|在位=前399年~前387年',
		'/敬侯|-386~||精=年|生=约前410年左右|卒=前375年|在位=前386年~前375年',
		'/成侯|-374~||精=年|卒=前350年|在位=前374年~前350年',
		'/肃侯|-349~||精=年|卒=前326年|在位=前349年~前326年',
		'/武灵王|-325~||精=年|生=约前340年|卒=前295年|在位=前326年~前298年农历5月1日',
		'/惠文王|-298~||精=年|生=前310年|卒=前266年|在位=前298年5月1日~前266年',
		'/孝成王|-265~||精=年|卒=前245年|在位=前265年~前245年',
		'/悼襄王|-244~||精=年|卒=前236年|在位=前244年~前236年',
		'/幽缪王|-235~||精=年|君主=赵王迁|君主名=赵迁|在位=前235年~前228年',
		'/代王嘉|-227~-222||精=年|君主名=赵嘉',

		'郑国/桓公|-806~||精=年|君主名=姬友|时期=周诸侯国|卒=前771年',
		'/武公|-770~||精=年|君主名=姬掘突|卒=前744年',
		'/庄公|-743~||精=年|君主名=姬寤生|生=前757年|卒=前701年|在位=前744年~前701年',
		'/昭公|-701~||精=年|君主名=姬忽|卒=前695年|在位=前696年~前695年',
		'/厉公|-700~||精=年|君主名=姬突|卒=前673年|在位=前700年~前673年',
		'/昭公|-696~||精=年|注=复位',
		'/子亹|-694~||精=年|君主名=姬子亹|卒=前694年|在位=前694年~前694年',
		'/子婴|-693~||精=年|君主名=姬婴;郑子;郑子仪|君主字=子仪|卒=前680年|在位=前693年~前680年',
		'/厉公|-679~||精=年|注=复位',
		'/文公|-672~||精=年|君主名=姬踕|卒=前628年|在位=前672年~前628年',
		'/穆公|-627~||精=年|君主名=姬兰|生=前647年|卒=前606年|在位=前627年~前606年',
		'/灵公|-605~||精=年|君主名=姬夷|卒=前572年',
		'/襄公|-604~||精=年|君主名=姬坚|卒=前587年|在位=前604年~前587年',
		'/悼公|-586~||精=年|君主名=姬沸|卒=前585年|在位=前586年~前585年',
		'/成公|-584~||精=年|君主名=姬睔|卒=前571年|在位=前584年~前571年',
		'/厘公|-570~||精=年|君主名=姬恽|卒=前566年|在位=前570年~前566年',
		'/简公|-565~||精=年|君主名=姬嘉|卒=前107年',
		'/定公|-529~||精=年|君主名=姬宁',
		'/献公|-513~||精=年|君主名=姬趸|卒=前501年|在位=前513年~前501年',
		'/声公|-500~||精=年|君主名=姬胜',
		'/哀公|-462~||精=年|君主名=姬易|卒=前455年',
		'/共公|-455~||精=年|君主名=姬丑|卒=前424年|注=郑共公在位年数据杨宽《战国史料编年辑证》作了修正。',
		'/幽公|-423~||精=年|君主名=姬已|卒=前423年',
		'/𦈡公|-422~||精=年|君主名=姬骀|卒=前396年',
		'/康公|-395~-375||精=年|君主名=姬乙|注=前375年为韩国所灭。',

		'韩氏/武子|-424~||精=年|君主名=韩启章|据=《史记·六国年表》|时期=周诸侯国|卒=前409年|在位=前424年~前409年|注=韩康子之子',
		'韩国/景侯|-408~||精=年|君主名=韩虔|据=《史记·韩世家》|时期=周诸侯国|卒=前400年|在位=前408年~前400年|注=韩武子之子。三家分晋之后，韩国建都于平阳。',
		'/烈侯|-399~||精=年|君主名=韩取|据=《史记·韩世家》 吴镇锋《金文人名汇编》|卒=前387年|在位=前399年~前387年|注=韩景侯之子',
		'/文侯|-386~||精=年|据=《史记·韩世家》|卒=前377年|在位=前386年~前377年|注=韩列侯之子',
		'/哀侯|-376~-374||精=年|据=《史记·韩世家》《战国史料编年辑证》|卒=前374年|在位=前376年~前374年|注=韩文侯之子',
		'/懿侯|-374~||精=年|君主名=韩若山|据=《史记·韩世家》《汉书·古今人表》《战国史料编年辑证》|卒=前363年|在位=前374年~前363年|注=韩哀侯之子',
		'/昭侯|-362~||精=年|君主名=韩武|据=《史记·韩世家》《吕氏春秋》《韩非子》《战国史料编年辑证》|卒=前333年|在位=前362年~前333年|注=韩懿侯之子',
		'/宣惠王|-332~||精=年|据=《史记·韩世家》《古本竹书纪年辑证》|卒=前312年|在位=前332年~前312年|注=韩昭侯之子',
		'/襄王|-311~||精=年|据=《史记·韩世家》《史记·留侯世家》|卒=前296年|在位=前311年~前296年|注=韩宣惠王之子',
		'/厘王|-295~||精=年|君主名=韩咎|据=《史记·韩世家》|卒=前273年|在位=前295年~前273年|注=韩襄王之子',
		'/桓惠王|-272~||精=年|据=《史记·韩世家》《史记·留侯世家》|卒=前239年|在位=前272年~前239年|注=韩厘王之子',
		'/韩王安|-238~-230||精=年|君主名=韩安|据=《史记·韩世家》|卒=前226年|在位=前238年~前230年|注=韩桓惠王之子',

		'魏国/文侯|-445~||精=年|君主名=魏斯|据=《史记·六国年表》 杨宽《战国史》|时期=周诸侯国|卒=前396年|在位=前445年~前396年，前424年称侯立元年',
		'/武侯|-395~||精=年|君主名=魏击|据=《史记·韩世家》 杨宽《战国史》|卒=前370年|在位=前395年~前370年',
		'/惠王|-369~||精=年|君主名=魏䓨|据=《史记·韩世家》 吴镇锋《金文人名汇编》 杨宽《战国史》|生=前400年|卒=前319年|在位=前369年~前319年，前334年改年称后元年',
		'/惠王/后|-334~||精=年|君主名=魏䓨|据=《史记·韩世家》 吴镇锋《金文人名汇编》 杨宽《战国史》|生=前400年|卒=前319年|在位=前369年~前319年，前334年改年称后元年|注=前334年称王并改元，改侯年为王年',
		'=/襄王|-318~||精=年|君主名=魏嗣|据=《史记·韩世家》|卒=前296年|在位=前318年~前296年',
		'/昭王|-295~||精=年|君主名=魏遫|据=《史记·韩世家》《战国史料编年辑证》|卒=前277年|在位=前295年~前277年',
		'/安厘王|-276~||精=年|君主名=魏圉|据=《史记·韩世家》《汉书·古今人表》《战国史料编年辑证》|卒=前243年|在位=前276年~前243年',
		'/景湣王|-242~||精=年|君主名=魏午|据=《史记·韩世家》《吕氏春秋》《韩非子》《战国史料编年辑证》|卒=前228年|在位=前242年~前228年',
		'/魏假|-227~-225||精=年|君主名=魏王假|君主名=魏假|据=《史记·韩世家》《古本竹书纪年辑证》|卒=前225年?|在位=前227年~前225年',

		// ----------------------------------//

		// -721年12月17日至-479年11月春秋战国历采用19年7闰，闰年的末月置闰并取名闰十三。年首为正月。
		// 秦昭王时期颛顼历实施至-104年11月秦汉历同样采用19年7闰，闰年的末月置闰并取名后九月。年首为十月。

		// 颛顼历实施至汉初古历数。朱桂昌以秦献公十九年（前366年）作为假定颛顼历实施年（《颛顼日历表》，中华书局，2012年），但据文物1982年第1期《四川省青川县战国墓发掘简报》引秦牍「〔秦武王〕二年十一月己酉朔」，秦武王时期仍旧使用周历，故颛顼历实施时间当在秦昭王时期。
		'秦汉历|-291/11/12~-104/11/14|-290/=505 3ql847o 59m 4g4s591 3qu447p 3oq 4o1859h 47p 39zw46i 59h 3quk47p 3mn047e 59m 3quk505 47e 4oj059m 4g4s591 47m 4okc3oq 579 3qsc47p 3oq 4mgc59h 3qu447p 42y 4ofg59l 47p 3mn046i 3pss47e 59m 3quk505 47e 4ojw59m 505 3ql847m 4okc3oq 591 3qsc47p 3oq 4mgc59h 3quk47p 42y 4ofg59l 47p 3mn047e 59l 3quk505 3pss47m 59m 4g4s579 47m 4ojw59m 4mgc59h 47o 4okc42y 59h 3quk579 47e 4ojw59m 4g4s591 47o 4okc3oq 591 3qsc47p 39zw46i 59h 3quk47p 42y 4ofg59m 47p 3mn047e 4oj059m 505 3ql847m 59m 4g4s579 3qsc47p 3oq 4mgc59h 47o 4okc42y 4ofg59m 47p 3mn047e 59l 3quk505 47e 4oj059m 4g4s579 47m 4okc3oq 579 3qsc47o 4okc42y 59h 3qu447p 42y 4o1859l 47p 3mn046i 4oj059m 47p 3pss47m 59m 3quk579 3qsc47o 59m 4mgc591 47o 4okc42y 591 3qu447p 39zw46i 59l 3quk47p 46i 4ofg59m 3quk579|岁首=10|闰月名=后|参照用|历法=颛顼历',

		'秦国/秦侯|-857~||精=年|时期=周诸侯国|卒=前848年|在位=前858年~前848年',
		'/公伯|-847~||精=年|卒=前845年|在位=前848年~前845年',
		// 史记 十二诸侯年表: 前841, 秦仲四年
		'/秦仲|-844~||精=年|卒=前822年|在位=前845年~前822年',
		'/庄公|-821~||精=年|卒=前778年|在位=前822年~前778年',
		'/襄公|-777~||精=年|卒=前766年|在位=前778年~前766年',
		'/文公|-765~||精=年|卒=前716年|在位=前766年~前716年',
		'/宁公|-715~||精=年|生=前725年|卒=前704年|在位=前716年~前704年',
		'/出公|-703~||精=年|生=前389年或前388年|卒=前385年|在位=前386年~前385年',
		'/武公|-697~||精=年|卒=前678年|在位=前697年~前678年',
		'/德公|-677~||精=年|生=前710年|卒=前676年|在位=前678年~前676年',
		'/宣公|-675~||精=年|卒=前664年|在位=前676年~前664年',
		'/成公|-663~||精=年|卒=前660年|在位=前664年~前660年',
		'/穆公|-659~||精=年|卒=前621年|在位=前659年~前621年',
		'/康公|-620~||精=年|卒=前609年|在位=前620年~前609年',
		'/共公|-608~||精=年|卒=前605年|在位=前608年~前605年',
		'/桓公|-603~||精=年|卒=前577年|在位=前604年~前577年',
		'/景公|-576~||精=年|卒=前537年|在位=前576年~前537年',
		'/哀公|-536~||精=年|卒=前501年|在位=前536年~前501年',
		'/惠公|-500~||精=年|卒=前492年',
		'/悼公|-490~||精=年|卒=前477年|在位=前491年~前477年',
		'/厉共公|-476~||精=年|生=前771?|卒=前443年|在位=前476年~前443年',
		'/躁公|-442~||精=年|卒=前429年|在位=前442年~前429年',
		'/怀公|-428~||精=年|卒=前425年|在位=前428年~前425年',
		'/灵公|-424~||精=年|卒=前415年|在位=前424年~前415年',
		'/简公|-414~||精=年|生=前428年)|卒=前400年|在位=前415年~前400年',
		'/惠公(战国)|-399~||精=年',
		'/出子|-386~||精=年|生=前708年|卒=前698年|在位=前703年~前698年',
		'/献公|-384~||精=年',
		'/孝公|-361~||精=年|生=前381年|卒=前338年|在位=前361年~前338年',
		'/惠文君|-337~||精=年|君主名=嬴驷|生=前356年|卒=前311年|在位=前337年~前311年',
		'/惠文王|-324~||精=年|君主名=嬴驷|君主=秦惠王|生=前356年|卒=前311年|在位=前337年~前311年|注=改侯年为王年',
		'/武王|-310~||精=年|生=前329年 (《史记·卷六·秦始皇本纪》：悼武王生十九年而立。)|卒=前307年|在位=前310年~前307年|注=秦武王二年十一月己酉朔，年始寅正',
		'/=|-309/2/9~|2/=47m|疑|准=年|据=[http://www.bsm.org.cn/show_article.php?id=2372 许名玱:青川郝家坪秦牍《田律》历日考释]|注=以汉传古《颛顼历》为基础，进其月朔余分470，所得历日合于牍文“十一月己酉朔”。',
		'/=|-308/1/29~|3/=:CE|精=年',
		'/昭襄王|-306~||君主=秦昭王|君主名=嬴则;嬴稷|精=年|生=前325年|卒=前251年|注=秦昭襄王，简称秦昭王。',

		// 朱桂昌(2012/6 中华书局)颛顼日历表
		'/昭襄王|秦汉历-290~|17/=:秦汉历|准=2日',
		'/孝文王|秦汉历-250~|:秦汉历|准=2日|君主名=嬴柱|生=前302年 (《史记·卷六·秦始皇本纪》：孝文王生五十三年而立。)|卒=前250年11月14日|在位=前250年11月12日~前250年11月14日',
		'/庄襄王|秦汉历-249~|:秦汉历|准=2日|君主名=嬴楚|表字=异人|生=前281年 (《史记·卷六·秦始皇本纪》：庄襄王生三十二年而立。)|卒=前247年7月6日|在位=前250年11月14日~前247年7月6日',

		// 李忠林(2012)秦至汉初(前246至前104)历法研究———以出土历简为中心
		'/秦王政|秦汉历-246~|:秦汉历|朝代=东周;战国|君主名=嬴政;赵政|君主=秦始皇|生=前259年正月|卒=前210年七月丙寅|在位=前247年五月丙午~前210年七月',
		// 秦始皇帝
		'秦/秦始皇|秦汉历-221~|26/=:秦汉历|君主=始皇帝|君主名=嬴政;赵政|生=前259年正月|卒=前210年七月丙寅|在位=前247年五月丙午~前210年七月|注=始皇三十一年十二月更名腊曰嘉平。',
		'/秦二世|秦汉历-209~-207/11/13|:秦汉历|君主=二世皇帝|君主名=嬴胡亥|生=前230年|卒=前207年 (在世年从《秦始皇本纪》后引《秦记》)|在位=前210年八月~前207年八月|注=秦二世可能改正月为端月。黄一农(2001)秦汉之际（前220-前202年）朔闰考。',
		'/秦王婴|秦汉历-207/10~|:秦汉历|君主=秦王子婴|君主名=嬴婴|注=汉元年十月，沛公兵遂先诸侯至霸上。|注=子婴为秦王四十六日，楚将沛公破秦军入武关，遂至霸上，使人约降子婴。',

		// 辛德勇 2008-7-3 重谈中国古代以年号纪年的启用时间
		// 辛德勇 2011-9-5 改订西汉新莽纪年表, 2012-2-20 汉宣帝地节改元事发微
		// "君主=汉高祖" 将会导致搜寻"南汉高祖干亨1年"时，先符合"汉高祖"，结果就找不到了。
		'西汉/高帝|秦汉历-206~|:秦汉历|朝代=汉|庙号=太祖|谥=高皇帝|君主=沛公|君主名=刘邦|表字=季|时期=两汉|生=前256年10月30日|卒=前195年6月1日|在位=前202年2月28日(改订西汉新莽纪年表:西汉高帝元年二月为汉王,五年二月即皇帝位)~前195年6月1日',
		'/惠帝|秦汉历-194~|:秦汉历|君主名=刘盈|生=前211年|卒=前188年9月26日|在位=前195年6月23日~前188年9月26日',
		'/高后|秦汉历-187~-180/11/14|:秦汉历|君主=吕后|君主名=吕雉|表字=娥姁|生=前241年|卒=前180年8月18日|君主性别=女|在位=改订西汉新莽纪年表：西汉惠帝7年8月吕后亲政',
		'/前少帝|秦汉历-187~|:秦汉历|君主名=刘恭|生=前199年7月|卒=前184年6月15日|在位=前188年九月~前184年八月|注=名不详，钱穆《国史大纲》作刘恭',
		'/后少帝|秦汉历-184/5/11~|4/=:秦汉历|君主名=刘弘|生=前195年3月|卒=前180年11月14日|在位=前184年八月~前180年九月|注=五月丙辰，立常山王义为帝，更名曰弘。不称元年者，以太后制天下事也。',
		'/文帝/前元|秦汉历-179~|:秦汉历|庙号=太宗|谥=孝文帝|君主名=刘恒|生=前203年|卒=前157年7月6日|在位=前180年11月14日~前157年7月6日|注=当时未用年号，年号为后世史籍追记。',
		'/后元|秦汉历-163~|:秦汉历|注=孝文本纪:	十七年，得玉杯，刻曰「人主延寿」。于是天子始更为元年，令天下大酺。|注=重谈中国古代以年号纪年的启用时间: 当时未用年号，仅称改元。目的可能是图重启国祚、延年益寿。年号为后世史籍追记。',
		'/景帝/前元|秦汉历-156~|:秦汉历|谥=孝景帝|君主名=刘启|生=前188年|卒=前141年3月9日|在位=前157年7月14日~前141年3月9日|注=当时未用年号，年号为后世史籍追记。',
		'/中元|秦汉历-149~|:秦汉历|注=当时未用年号，仅称改元。年号为后世史籍追记。',
		'/后元|秦汉历-143~|:秦汉历|注=当时未用年号，仅称改元。年号为后世史籍追记。',
		// 西汉于武帝及之后，新王初上常采逾年改元。任内多间隔固定年数改元以示天运，但常于改元当年方诏书今年改元。诏书需花费一二个月传递全国，因之此年间不同地公文书两年号偶并存。之后添补之文书常会回溯新年号至年首，事先已写就之计划性文书则可能沿用旧年号。事后归纳总结性文书可能全年或整案件采单一年号，多为新年号。
		'/武帝/建元|秦汉历-140~|:秦汉历|庙号=世宗|谥=孝武帝|君主名=刘彻|生=前157年7月14日或前156年春|卒=前87年3月29日|在位=前141年3月9日~前87年3月29日|注=重谈中国古代以年号纪年的启用时间: 当时未用年号，年号为武帝太初后追记往事用。',
		'/元光|秦汉历-134~|:秦汉历|注=重谈中国古代以年号纪年的启用时间: 当时未用年号，年号为武帝太初后追记往事用。',
		'/元朔|秦汉历-128~|:秦汉历|注=重谈中国古代以年号纪年的启用时间: 当时未用年号，年号为武帝太初后追记往事用。',
		'/元狩|秦汉历-122~|:秦汉历|注=重谈中国古代以年号纪年的启用时间: 十月尚未改元。当时未用年号，年号为武帝太初后追记往事用。',
		'/元鼎|秦汉历-116~|:秦汉历|注=改订西汉新莽纪年表: 正月以后改元。当时未用年号，年号为武帝太初后追记往事用。',
		'/元封|秦汉历-110~-104/11/14|:秦汉历|注=元封七年五月改历，使用太初历。|注=雷宝, 詹石窗. 太岁系统差异形成考:以太初历计算，太初元年前一年(元封七年)岁名当为子，为丙子年，同元封六年。|注=重谈中国古代以年号纪年的启用时间: 当时未用年号，年号为武帝太初后追记往事用。',
		// '/太初|秦汉历-104~-104/11/14|:秦汉历',

		'/太初|-104/2/22~|59m 4g4s591 47m|历法=太初历|注=太初元年五月改历，使用太初历，以建寅之月为岁首。|注=改订西汉新莽纪年表: 改元之初可能还没使用年号纪年，而是在太初元年五月与改正朔、易服色的改制措施同时实行。|注=据陈久金「敦煌、居延汉简中的历谱」说法，太初历初期依三统历规定三年一闰，六年二闰，九年三闰的的机械规定，因而出现错误，后来发现不符无中气置闰原则而改正，但之后置闰仍有错误。经过二百年的发展，逐步走向完善和严格。（见中国古代天文文物论集，文物出版社，1989年）',
		'/天汉|-100/2/8~|59m 4g4j579 47m',
		'/太始|-96/1/25~|4okc3oq 4mg959h|注=陈来疯: 陈久金《敦煌居延汉简中的历谱》相关考证: 《汉书五行志》太始四年十月甲寅晦，日有食之。刘次沅《诸史天象记录考证谓》谓后世所推历表与当时实行历不符。',
		'/征和|-92/2/9~-88/10/18|47o 4ok542y 59h 3qtt|年号=延和|注=改订西汉新莽纪年表: 居延汉简有征和五年正月庚申朔庚、（后元）元年九月丙戌朔丙戌。',
		'/后元|-88/1/26~|3qtt47p|注=西汉武帝后元二年二月戊辰，太子即皇帝位。明年改元始元。|注=改订西汉新莽纪年表: 当时未用年号，仅称改元。年号为后世史籍追记。',
		'/昭帝/始元|-86/2/3~|3mmy46i 59l 3quf505 46i 4oiq|谥=孝昭帝|君主名=刘弗陵|生=前94年|卒=前74年6月5日|在位=前87年3月30日~前74年6月5日|注=汉昭帝始元七年置闰新研: 始元七年八月，改始元为元凤。始元七年置闰未定。亦可能闰三月。',
		'/元凤|-80/9/21~|8=4oiq59m 3quj579 47m 4ojs',
		'/元平|-74/2/21~|59m|注=昭帝元平元年四月癸未，昭帝于未央宫暴病而死。七月汉宣帝即位沿用',
		'/昌邑王/=|-74/7/18~|6=59m|君主名=刘贺|君主=海昏侯|生=前92年7月25日|卒=前59年|在位=昭帝元平元年六月丙寅即天子位~昭帝元平元年六月癸巳废黜',
		'/宣帝/=|-74/9/10~|/7/25=59m|庙号=中宗|谥=孝宣帝|君主名=刘询;刘病巳|表字=次卿|生=前91年|卒=前48年1月10日|在位=前74年9月10日~前48年1月10日|注=西汉元平元年七月庚申，武帝曾孙病已即皇帝位。明年改元本始。',
		'/本始|-73/2/10~-68/6/25|579 3ql147o 59m 4mg1591|注=汉宣帝地节改元事发微: 汉宣帝在本始六年五月追改本始五年为地节元年、本始六年为地节二年',
		'/地节|-69/1/27~-65/6/8|4mg1591 3qu147p 3oq|注=应劭曰：「以先者地震，山崩水出，于是改年曰地节，欲令地得其节。」本始四年夏四月壬寅，郡国四十九地震，或山崩水出|注=汉宣帝地节改元事发微: “地节二年五月乙亥造”钱范是行用“地节”年号最早的实物证据，而且出自京师城垣之内。',
		// 罗振玉和王国维在《流沙坠简》一书中最先将这类残简称为“历谱”，计有“元康三年历谱”、“神爵三年历谱”、“五凤元年八月历谱”
		// 47e 4ojs59m 579 3ql147o 59m 4g4h47e 4oju59m 505 3ql447m 59m 4g4l591
		// 47m 4ok13oq 4mg959h
		'/元康|-65/2/11~-61/7/23|3oq 4o1359l 47p 39zn|注=汉宣帝地节改元事发微: 元年3月下诏，4月改元行用，庆霍氏乱去，天下归小康。|注=《元康五年诏书》（居延汉简10.27）有「元康五年五月二日壬子日夏至」',
		'/神爵|-61/3/28~|3=39zn46i 4ofg59m|注=Wikipedia: 元康五年二月改元，三月使用神爵年号。',
		// 甘肃肩水金关遗址所出五凤三年历谱
		'/五凤|-57/2/13~-53/6/25|47p 3pso47e 59m 3qud|注=册府元龟卷15: 东汉应劭: 先者凤凰五至，因以改元云',
		'/甘露|-53/1/30~-49/4/13|3qud505 47e 4ojm59m|注=汉宣帝地节改元事发微: 元年4~5月改元',
		'/黄龙|-49/2/15~|59m|注=册府元龟卷15: 此年二月黄龙见广汉郡故改元',
		'/元帝/初元|-48/2/3~-43/3/8|4g4q591 47m 4ok63oq 591|庙号=高宗|谥=孝元帝|君主名=刘奭|生=前76年|卒=前33年|在位=改订西汉新莽纪年表：黄龙1年12月~竟宁1年6月|注=后除庙号',
		'/永光|-43/2/8~-38/10/6|591 3qs347p 39zw42y 59h|注=汉宣帝地节改元事发微: 张德芳文只提供有初元六年正月的用例，而西汉铜器中有一件铜弩 机郭，上面铭文镌作“永光元年七月廿日右尚方造”改元永光的时间，至迟不得晚于七月。|注=《永光五年历谱》释文：永光五年 正月乙巳朔大 二月乙亥朔小二日丙子春分 三月甲辰朔大十九日壬辰立夏 四月申戌朔大（以上为简A面第一栏） 五月甲辰朔小四日丁未夏至 六月癸酉朔大八日庚辰初伏十八日庚寅中伏廿一日癸已   立秋 七月癸卯朔小八日庚戌后伏 八月壬申朔大八日己卯秋分（以上为简A面第二栏）］［九月壬寅朔小廿三日甲子立冬  □高五尺 十月辛未朔大 十一月辛丑朔小十日庚戌冬至 十二月庚午朔大十七日丙戌腊廿七日丙申立春己亥晦（《敦煌》1560A/B）;《永元六年历谱》释文：十二月大 □日癸丑建大寒 □日甲寅除八魁 …□（以上为简A面第一栏） 十六日戊辰平全 十七日己巳平全八魁 十八日庚午定反支□ 十九日辛未执（以上为简A面第二栏） 七月廿七日壬午开天李  廿八日癸未闭反支 廿九日甲申建□ 卅日乙酉除（以上为简A面第三栏）］［十日癸巳执□□  廿二日乙巳 十一日甲午破血忌天李  廿三日丙 □二日乙未危白□□□《敦煌》1968A/B',
		'/建昭|-38/2/13~|59h 3qug47p 42y 4of8|注=汉宣帝地节改元事发微: 元年7~8月改元',
		'/竟宁|-33/2/18~|59l|注=六月汉成帝即位沿用',
		'/成帝/建始|-32/2/6~-28/6/19|47p 3mmp47e 4oiy59m|庙号=统宗|谥=孝成帝|表字=太孙|君主名=刘骜|生=前51年|卒=绥和2年4月|在位=改订西汉新莽纪年表：竟宁元年六月~成帝绥和二年四月|注=汉宣帝地节改元事发微: 可能是在竟宁元年七月“大赦天下”的时候颁布诏书，宣布预定翌年改元为建始，不然僻在居延，不可能这么快就接到朝廷诏命。|注=后除庙号',
		'/河平|-28/2/22~|59m 505 3psm47m|注=汉宣帝地节改元事发微: 成帝建始五年三月因“河决东郡，流漂二州，校尉王延世塞辄平”，下诏改元，张文谓建始五年简最晚见于是年四月',
		'/阳朔|-24/2/8~-20/7/20|59m 4g4j579 3qsc47o',
		'/鸿嘉|-20/2/23~-16/8/4|47o 59m 4mg859h 47o|注=汉宣帝地节改元事发微: 元年4~5月改元',
		'/永始|-16/2/9~-12/9/18|47o 4ok542y 591 3qtt|注=汉宣帝地节改元事发微: 元年5~6月改元，七月之后永始|据=[http://blog.sina.com.cn/s/blog_a2e8e3c60102y7hz.html 陈来疯: 陈久金《敦煌居延汉简中的历谱》相关考证]|注=据《中国简牍集成》（敦煌文艺出版社，2001年）第9册页38「永始二年五月乙酉朔丙午」、页75「永始二年六月甲申」及第10册页25「永始二年七月癸丑朔庚辰」来推算，汉成帝永始二年应为闰五月，陈的闰四月说显然有误。',
		'/元延|-12/1/26~-8/6/8|3qtt47p 3mmy46i 59l|注=汉宣帝地节改元事发微: 元年6~7月改元',
		'/绥和|-8/2/11~|59l 3qug|注=二年四月汉哀帝即位沿用|注=汉宣帝地节改元事发微: 元年4月改元|注=陈来疯: 陈久金《敦煌居延汉简中的历谱》相关考证: 《天象》为绥和二年闰七月。未找到相关竹简朔日',
		'/哀帝/建平|-6/2/19~-1/3/23|47p 46i 4oir59m 3quk579|谥=孝哀帝|君主名=刘欣|生=前27年|卒=元寿2年9月|在位=改订西汉新莽纪年表：绥和2年4月~元寿2年9月|注=二年六月改元太初元将，同年八月又改回建平二年|注=汉宣帝地节改元事发微: 简牍最晚建平六年正月',
		'/太初元将|-5/7/5~-5/10/1|6=46i|据=改订西汉新莽纪年表|注=汉宣帝地节改元事发微: 哀帝建平二年六月甲子改元为太初元将，未几复于八月下诏废止太初元将，重称建平二年',
		'/元寿|-2/2/5~|3quk579|年号=元受|注=二年九月汉平帝即位沿用|注=改订西汉新莽纪年表: 元年12月~闰12月改元. 汉宣帝地节改元事发微: 陈垣等过去推算元寿元年闰十一月，陈梦家则依据汉简所反映的实际情况，确定本年闰十二月，故张氏新增的材料，应是进一步加大了在闰十二月改元元寿的可能性。',
		'/平帝/元始|1/2/12~6/3/18|47e 4ojs59m 579 3ql147o|庙号=元宗|谥=孝平帝|君主名=刘衎;刘箕子|生=前9年|卒=6年2月3日|在位=前1年10月17日~6年1月4日|注=居延汉简中这个年号被用至元始二十六年|注=改订西汉新莽纪年表: 元始5年12月王莽摄政，称假皇帝或摄皇帝. 汉宣帝地节改元事发微: 居延新简有“元始六年二月丁亥居延甲渠候放免冠叩头死罪死罪敢言之”云云，应属奉诏改元之前的文牍|注=后除庙号',
		'/孺子婴/居摄|6/2/17~|47o 59m 4g4h|年号=居聑|君主名=刘婴|生=5年|卒=25年|在位=6年~8年十一月|注=《肩水金关汉简（贰）》：居聑（摄）三年十月甲戌朔壬午...|注=改订西汉新莽纪年表: 3月立刘婴为皇太子，号孺子。|注=肩水金关汉简《元始六年(居摄元年)磿日》简册再复原: 天正子月入甲子统壬午章第15年',
		'/初始|9/1/6~|/11/21=9|年号=始初|注=张小锋(2006)“初始”年号始用时间辨析；认为初始年号始于居摄三年十一月廿一日（9年1月6日），只使用了9天。|注=汉宣帝地节改元事发微: 敦煌简牍中另有题作“●居摄三年十一月 ”者，显示出直到本月，敦煌还没有奉召改元。',

		'新/王莽/始建国|9/1/15~14/4/18|47e 4ojv59m 505 3ql447m|君主名=王莽|君主=新莽|表字=巨君|年号=建国|时期=两汉|生=前45年|卒=23年10月6日|在位=8年~23年',
		'/始建国天凤|14/1/20~|47m 59m 4g4l591 47m 4ok1|年号=天凤;始建国天凤上戊|注=汉宣帝地节改元事发微: 陈梦家推断在始建国天凤元年正、二月间， 但《汉书·王莽传》明确记载这次改元确定于始建国五年年末，翌年从正月元旦起即行用始建国天凤年号，...新莽简所见之“始建国六年二月”，应该属正常的现象',
		'/始建国地皇|20/1/14~23/11/1|3oq 4mg959h 47o|年号=地皇;始建国地皇上戊',

		'更始朝/淮阳王/更始|23/3/11~25/11/9|2=3oq 3qud500|谥=武顺王|君主名=刘玄|表字=圣公|君主=更始帝|朝代=玄汉|时期=两汉|卒=25年|在位=23年二月~25年九月|注=更始二年复寅正。',

		// 玄汉时期建立的其他政权的年号, 新朝之后，更始至东汉初建立的各政权年号
		'东汉/卢芳|25/11/10~|:东汉|疑|君主=西平王;上将军;汉皇帝|君主名=卢芳|字=君期|注=更始政权灭亡后，三水的豪杰拥立自称汉朝皇族的卢芳为上将军、西平王，与西羌、匈奴缔结和约。',
		'/代王|40/2/2~42/2/8|:东汉|疑|君主名=卢芳|注=建武十六年，卢芳入居代郡高柳县，以闵堪之兄闵林为使者，向光武帝表示投降。光武帝封卢芳为代王，闵堪为代相，闵林为代国太傅，卢芳负责汉朝与匈奴修好的事务。十七年，卢芳入朝，在向洛阳途中，光武帝下诏命卢芳延期至明年（十八年）入朝。卢芳疑心皇帝猜忌，在代地再反汉朝，与闵堪、闵林在高柳县互相攻打数月，匈奴派兵将其与妻室接走，卢芳入匈奴十数年病死。',

		'赤眉/刘盆子/建世|25/7/15~27/3/26|:东汉|疑|生=10年|君主名=刘盆子|时期=两汉|年号=建始|注=赤眉军议立皇帝时，首领樊崇将刘盆子立为皇帝. 后汉书/卷11: 六月，遂立盆子为帝，自号建世元年。',

		'成家/公孙帝/龙兴|25/5/17~37/1/5|:两汉|疑|卒=成家龙兴12年11月|君主名=公孙述|字=子阳|时期=两汉|注=后汉书/卷13: 文曰『公孙帝』。建武元年四月，遂自立为天子，号成家。色尚白。建元曰龙兴元年。',
		'东汉/西州大将军/汉复|23/8/6~|:两汉|疑|君主=朔宁王|君主名=隗嚣|卒=建武九年春|字=季孟|年号=复汉;朔宁|注=建武七年，隗嚣称臣于述，公孙述以嚣为朔宁王|注=十一年隗纯沿用',
		'成家/朔宁王/汉复|33/2/18~34/11/29|:东汉|疑|君主名=隗纯|卒=42年|注=后汉书/卷13: 建武九年春，嚣病且饿，出城餐糗糒，恚愤而死。 王元、周宗、行巡、高峻、苟宇、赵恢等人立嚣少子纯为朔宁王。 建武十年十月，来歙在落门聚（天水郡冀县）大败隗纯，隗纯投降，汉朝平定陇右。',

		'东汉/光武帝/建武|25/7/15~|6=385 47e 4oip59m 4g4q591 47m 4ok63oq 579 3qs347p 39zw42y 59h 3qu047p 42y 4of859l 47p 3mmp46i 4oiy59m 505 3psm47m 59m 3qub579 3y8|庙号=世祖|君主名=刘秀|表字=文叔|朝代=汉|时期=两汉|生=前5年1月15日|卒=57年3月29日|在位=25年8月5日~57年3月29日',
		'/建武中元|56/5/4~|4=31i447o|年号=中元|注=二年二月汉明帝即位沿用',
		'/明帝/永平|58/2/13~|59m 4mg9591 47o 4ok542y 591 3qtt47p 39zu46i 59l 3quf47p 46i 4of759m 3quj|庙号=显宗|谥=孝明帝|君主名=刘庄;刘阳|表字=子丽|生=28年6月15日|卒=75年9月5日|在位=57年3月29日~75年9月5日|注=十八年八月汉章帝即位沿用',
		'/章帝/建初|76/2/24~|579 47e 4ojs59m 505 3ql147o 59m 4g01|庙号=肃宗|谥=孝章帝|君主名=刘炟|生=57年|卒=88年4月9日|在位=75年9月5日~88年4月9日',
		'/元和|84/9/19~|8=362 5sl 3mmy474|注=汉章帝元和2年1月依 太初元年至元和二年朔闰表 改壬午朔。',
		'/章和|87/8/17~|7=362 59l|注=二年二月汉和帝即位沿用',
		'/和帝/永元|89/1/30~|3quf505 46i 4oir59m 4g4r579 47m 4ojs59m 579 3qs547o 59m 4mg15dx 3y8|庙号=穆宗|谥=孝和帝|君主名=刘肇|生=79年|卒=106年2月13日|在位=88年4月9日~106年2月13日',
		'/元兴|105/5/2~|4=31jt',
		'/殇帝/延平|106/2/21~|47p|谥=孝殇帝|君主名=刘隆|生=105年|卒=106年9月21日|在位=106年2月13日~9月21日|注=八月汉安帝即位沿用',
		'/安帝/永初|107/2/10~|42y 4o1359l 47p 39zo46i 4oj0|庙号=恭宗|谥=孝安帝|君主名=刘祜|生=94年|卒=125年4月30日|在位=106年9月21日~125年4月30日',
		'/元初|114/2/23~|59m 47p 3pso47e 59m 3qud54w',
		'/永宁|120/5/15~|4=385 474|年号=永宁|注=三国志：年号永宁',
		'/建光|121/8/1~|7=362 4kci',
		'/延光|122/4/24~125/5/19|3=3f8 59m 4g4q54w|注=四年三月北乡侯刘懿即位沿用；同年十一月汉顺帝即位沿用',
		'/北乡侯/延光|125/4/21~|4/3/=3o5|君主=前少帝|君主名=刘懿;刘犊|在位=125年5月18日~125年12月10日',
		'/顺帝/永建|126/2/10~|47o 4ok63oq 591 3qs347p 35s|庙号=敬宗|谥=孝顺帝|君主名=刘保|生=115年|卒=144年9月20日|在位=125年12月16日~144年9月20日',
		'/阳嘉|132/4/4~|3=39zw46i 59h 3qug',
		'/永和|136/2/20~|47p 42y 4of859m 47p 3mmp',
		'/汉安|142/2/13~|47e 4oiy54w',
		'/建康|144/5/20~|4=3ai|注=八月汉冲帝即位沿用',
		'/冲帝/永憙|145/2/10~|505|谥=孝冲帝|君主名=刘炳|生=143年|卒=145年2月15日|在位=144年9月20日~145年2月15日|年号=元嘉;永嘉;永熹|注=正月汉质帝即位沿用|注=《后汉书》作「永嘉」；《后汉纪》作「元嘉」。何焯考证应为永憙。',
		'/质帝/本初|146/1/30~|3ql2|谥=孝质帝|君主名=刘缵;刘续|注=闰六月汉桓帝即位沿用',
		'/桓帝/建和|147/2/18~|47m 59m 4g4j|庙号=威宗|谥=孝桓帝|君主名=刘志|生=132年|卒=168年1月25日|在位=146年8月1日~168年1月25日',
		'/和平|150/2/15~|591',
		'/元嘉|151/2/4~|3qsc47p 3k0',
		'/永兴|153/6/10~|5=3ai 4mg9',
		'/永寿|155/2/20~|59h 47p 39zp41s',
		'/延熹|158/7/14~|6=36y 59h 3qtt47p 3mmy47e 59l 3quf505 45c',
		'/永康|167/7/5~|6=36y',
		'/灵帝/建宁|168/1/28~|4oir59m 4g4r579 45c|谥=孝灵帝|君主名=刘宏|生=156年|卒=189年5月13日|在位=168年2月17日~189年5月13日',
		'/熹平|172/6/9~|5=382 4ojs59m 579 3qs547o 4qo',
		'/光和|178/4/6~|3=3oq 4mg1591 3qu147p 42y 4o13',
		'/中平|185/1/19~|12=35s 59l 47p 39zo46i 54w|注=中平元年黄巾军起事后，韩遂、马腾据凉州大乱，宋建据枹罕自号「河首平汉王」，改年号，置百官，割据三十余年。建安十九年十月，曹操派遣夏侯渊自兴国讨宋建，屠枹罕，斩宋建。',
		'/少帝/光熹|189/5/3~|4=3a8|谥=怀王|君主=弘农王;弘农怀王|君主名=刘辩|生=176年|卒=190年3月6日|在位=189年5月15日~189年9月28日',
		'/昭宁|189/8/29~|8=35s',
		'/献帝/永汉|189/9/28~|9=360|谥=孝献帝;孝愍帝|君主名=刘协|表字=伯和|生=181年|卒=234年4月21日|在位=189年9月27日~220年11月25日',
		'/中平|189/12/26~|6/12/=2t64|注=后汉书献帝纪 十二月，诏除光熹、昭宁、永汉三号，复称中平六年',
		'/初平|190/2/23~|59m 47p 3pso47e',
		'/兴平|194/2/9~|59m 3qud',
		'/建安|196/2/17~|579 47e 4ojm59m 4g4q591 47o 4ok63oq 591 3qs347p 39zw46i 59h 3qug47p 42y 4of859m 47p 3mmp47e 4oiy4qo',
		'/延康|220/4/21~220/11/12|3=3oo',

		// 东汉时期建立的其他政权的年号
		'东汉/张曼成/神上|184/2/29~184/7/25|:中国|疑|据=Wikipedia|注=汉灵帝光和七年二月（184年），太平教大方（总指挥官）马元义事败被捕于洛阳车裂，黄巾之乱时南阳黄巾军首领张曼成闻讯立即率众在南阳起兵。三月庚子日击斩南阳郡守褚贡后，屯兵宛县（南阳郡政府所在地）城下百余日；六月，遭新任南阳郡长秦颉反攻击斩。《后汉书》和《资治通鉴》都未言建年号之事，李兆洛《纪元编》载：「张曼成，神上。」其注云「见《类聚考》，不知所本。」',

		// 魏晋南北朝,三国两晋南北朝/三国时期

		'蜀/昭烈帝/章武|221/5/10~|4=3f9 3ql245c|君主名=刘备|表字=玄德|朝代=蜀汉|时期=三国|生=161年|卒=223年6月10日|在位=221年四月~223年6月10日',
		'/后主/建兴|223/6/16~|5=382 59m 4g4j591 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qtt47p|君主名=刘禅|表字=公嗣|谥=思公;孝怀皇帝;怀帝|生=207年|卒=271年|在位=223年~263年',
		'/延熙|238/2/2~|3mmy47e 59l 3quf505 46i 4oir59m 4g4r579 47m 4ojs59m 579 3qs547o 59m 4mg1591 3qu1',
		'/景耀|258/2/21~|47p 42y 4o1359l 47p 39qc',
		'/炎兴|263/9/21~264/1/16|8=36c',

		// 罗新：走马楼吴简中的建安纪年简问题
		// 孙权与魏决裂之后，对于自己曾经奉行黄初年号一定是有所忌讳的，何况与曹魏的敌对关系也不允许再在文书中提到这一年号，因此，在追述公元220至223年之间的往事时，使用何种纪年方法，一定是经过了认真考虑的。我认为，延长建安以衔接黄武，是孙吴官方的政策，在孙吴境内要普遍遵守。这就是今天我们在文献上看到建安二十五、二十六、二十七纪年的来历，同样也是吴简中出现这些建安纪年简的原因。
		'吴/大帝/黄武|222/11/22~|10=35x 59l 47p 39zo46i 4oj059m 4qo|庙号=太祖|君主名=孙权|表字=仲谋|朝代=孙吴|时期=三国|生=182年|卒=252年|在位=229年~252年',
		'/黄龙|229/5/11~|4=3f9 3pso47m',
		'/嘉禾|232/2/9~|59m 4g4l579 47m 4ok23oq 56o',
		'/赤乌|238/8/28~|8=2tnu59h 47p 39zq42y 59h 3qtv47p 3mn047m 59m 3qug505 45c',
		'/太元|251/6/6~|5=37u 4qo',
		'/神凤|252/2/27~|2=3k0',
		'/会稽王/建兴|252/4/26~|4=2xc459m|君主=吴废帝|君主名=孙亮|表字=子明|生=243年|卒=260年|在位=252年~258年',
		'/五凤|254/2/5~|579 3qkx47k',
		'/太平|256/11/5~|10=35w 4oka42w',
		'/景帝/永安|258/11/13~|10=35u 591 3qtz47p 42y 4o0z58g|君主名=孙休|表字=子烈|生=235年|卒=264年|在位=258年~264年',
		'/末帝/元兴|264/8/10~|7=36x 3y8|君主=吴后主;乌程侯;归命侯|君主名=孙皓;孙彭祖|表字=元宗;皓宗|生=242年|卒=284年|在位=264年~280年5月1日|注=幼名彭祖',
		'/甘露|265/5/3~|4=31kb4zk',
		'/宝鼎|266/9/17~|8=36d 46i 4oiw59k',
		'/建衡|269/11/11~|10=35u 505 3psl|生=1988年2月28日',
		'/凤凰|272/2/16~|47m 59m 4g4h',
		'/天册|275/2/13~|591 474',
		'/天玺|276/7/28~|7=2tlm',
		'/天纪|277/2/20~280/5/15|47p 3oq 4o1354w',

		// 晋书/卷017: 黄初三年十一月二十九日庚申加时西南维日蚀 疑应为"三十日"
		'魏/文帝/黄初|220/11/13~|10=35u 505 3ql247m 59m 4g4j591|庙号=世祖|君主名=曹丕|表字=子桓|朝代=曹魏|时期=三国|生=187年|卒=226年6月29日|在位=220年11月25日~226年6月29日|注=七年五月魏明帝曹叡即位沿用|注=魏武王曹操子',
		'/明帝/太和|227/2/4~|3qsc47p 3oq 4mg959h 47p 35s|庙号=烈祖|君主名=曹叡;曹睿|表字=元仲|正统=中国|生=206年|卒=239年1月22日|在位=226年~239年',
		'/青龙|233/2/27~|2=39zp42y 59h 3qtt3y8|正统=中国',
		// https://zh.wikisource.org/wiki/%E5%85%A8%E4%B8%89%E5%9C%8B%E6%96%87/%E5%8D%B711#.E5.BE.A9.E7.94.A8.E5.A4.8F.E6.AD.A3.E8.A9.94
		'/景初|237/4/13~|4=3bp 3ql7	30;29;30;29;30;29;30;29;30;29;30;30;后12=29|注=青龙五年三月改元并改用景初历，以建丑之月为正月。因此青龙五年三月则成为景初元年四月。|注=复用夏正诏（《魏志‧齐王芳纪》，又见《册府元龟》四）：魏少帝十二月，诏曰：「烈祖明皇帝以正月弃背天下，臣子永惟忌日之哀，其复用夏正；虽违先帝通三统之义，斯亦礼制所由变改也。又夏正于数为得天正，其以建寅之月为正始元年正月，以建丑月为后十二月。」|注=三年正月齐王曹芳即位沿用',
		'/齐王/正始|240/2/10~|47p 3mmu46i 59l 3qub505 3pss47m 59m 4qo|正统=中国|谥=厉|君主=少帝|君主名=曹芳|表字=兰卿|君主=少帝;废帝;邵陵厉公|生=232年|卒=274年|在位=239年~254年',
		'/嘉平|249/4/30~|4=31k9591 47m 4ok53oq 58w',
		'/高贵乡公/正元|254/10/29~|10=35x 3qs145c|表字=彦士|君主名=曹髦|生=241年11月15日|卒=260年6月2日|在位=254年~260年',
		'/甘露|256/7/10~|6=385 39zu46i 59h 45c',
		'/元帝/景元|260/6/26~|6=2v8n47p 46i 4of754w|君主名=曹奂;曹璜|表字=景明|生=246年|卒=303年|在位=260年~265年',
		'/咸熙|264/6/12~266/2/7|5=3ai 3quj|注=泰始元年冬十二月丙寅...升坛受禅...于是大赦，改元',

		// 曹魏统治地区出现的其他割据势力的年号
		'/燕王/绍汉|237/7/10~238/8/27|:魏|疑|君主名=公孙渊|政权=燕;燕国|据=Wikipedia|卒=238年|在位=237年~238年|注=景初元年（237年），魏派出幽州刺史毌丘俭攻公孙渊，久战不利回师。公孙渊即自立为燕王，改元绍汉，引诱鲜卑侵扰北方。景初二年（238年）正月向东吴称臣。同年春，魏又派司马懿和高句丽王高位宫攻公孙渊，围城日久，公孙渊于八月粮尽出逃被擒斩。',

		// 魏晋南北朝,三国两晋南北朝/两晋

		'西晋/武帝/泰始|266/2/8~|/12/17=3quj579 47e 4ojs59m 579 3ql147o 59m 4mg1|庙号=晋世祖|君主=晋武帝|君主名=司马炎|表字=安世|时期=两晋|生=236年|卒=290年5月16日|在位=266年2月4日~290年5月16日|建正=寅|注=泰始元年冬十二月丙寅...升坛受禅...于是大赦，改元',
		'/咸宁|275/2/13~|591 3qu147p 3oq 4o1354w',
		'/太康|280/5/16~|4=3ah 47p 3mms46i 4oj059m 505 3pso47m 59m',
		'/太熙|290/1/28~|4qo',
		'/惠帝/永熙|290/4/27~|4=31k5|君主=晋惠帝|君主名=司马衷|表字=正度|生=259年2月13日|卒=307年1月8日|在位=290年5月16日~307年1月8日',
		'/永平|291/2/16~|4qo',
		'/元康|291/4/16~|3=3md 47m 4ok23oq 4mga59h 47p 39zq42y',
		'/永康|300/2/7~|59h 3oqr',
		'/永宁|301/5/24~|4=3ai 47o',
		'/太安|303/1/5~|12=35t 3mn0|年号=大安',
		'/永安|304/2/22~|47e',
		'/建武|304/8/17~|7=47e',
		'/永安|304/12/14~|11=47e|注=永安元年七月改元建武元年，同年十一月复称永安，次月又改元为永兴元年。',
		'/永兴|305/1/12~|12=47e 59m 45c',
		'/光熙|306/6/28~|6=2v8o|注=十一月晋怀帝即位沿用',
		'/怀帝/永嘉|307/2/19~|505 47e 4ojo59m 505 3qkx47p|君主=晋怀帝;孝怀帝|君主名=司马炽|表字=丰度',
		'/愍帝/建兴|313/5/12~317/3/28|4=47p 3mmy3oq 591 3qtz|君主名=晋愍帝;司马邺;司马业|表字=彦旗|生=300年|卒=318年2月7日|在位=313年6月7日~316年12月11日|注=也有只记到晋愍帝投降前赵时的建兴四年。前凉多位君主沿用该年号',

		// 西晋统治地区出现过的其他年号
		'/赵廞/太平|300/12/28~301/2/24|:西晋|疑|据=Wikipedia|君主名=赵廞|注=《晋书·惠帝纪》：永康元年十二月「益州刺史赵廞与洛阳流人李庠....据成都反。」《资治通鉴》考异：「《晋春秋》云『建号太平元年』。他书无之。」',
		'/司马伦/建始|301/1/26~6/22|:西晋|疑|据=Wikipedia|君主名=司马伦|卒=301年4月13日|在位=301年1月~301年4月|注=《晋书·惠帝纪》记载：永宁元年正月赵王伦篡帝位。《赵王伦传》说篡帝位，大赦，改元建始。',
		'张汉/刘尼/神凤|303/6/2~9/27|:西晋|疑|据=Wikipedia|时期=两晋|君主名=丘沈|君主名=张昌|注=义阳蛮首领张昌以山东县吏丘沈为天子，更名为刘尼，称国号「汉」。建元神凤。',

		'东晋/元帝/建武|317/3/29~|3=3qtz47p|庙号=中宗|君主=晋元帝|君主名=司马叡;司马睿|表字=景文|时期=两晋',
		'/太兴|318/4/17~|3=47p 3oq 4o0z59l|年号=大兴',
		'/永昌|322/2/3~|3quj3y8|注=闰十月晋明帝即位沿用',
		'/明帝/太宁|323/4/22~|3=3f9 46i 4oiw4qo|庙号=肃宗|君主=晋明帝|君主名=司马绍|表字=道畿|生=299年|卒=325年|在位=323年~325年|注=三年闰八月晋成帝即位沿用',
		'/成帝/咸和|326/3/20~|2=3oq 47p 3psl47m 59m 3qu9579 3qsa47o|君主=晋成帝|庙号=显宗|君主名=司马衍|表字=世根',
		'/咸康|335/2/10~|59m 4mg759h 47o 4ok442y 4ofg59l|注=八年六月晋康帝即位沿用',
		'/康帝/建元|343/2/11~|47p 3mmw|君主=晋康帝|君主名=司马岳|表字=世同|注=二年九月晋穆帝即位沿用',
		'/穆帝/永和|345/2/18~|47e 59l 3qud505 47e 4oiq59m 4g4q591 47m 4ok63oq|君主=晋穆帝|庙号=孝宗|君主名=司马聃|表字=彭祖|生=343年|卒=361年|在位=344年~361年',
		'/升平|357/2/6~|591 3qs347p 39zw46i|注=五年五月晋哀帝即位沿用。前凉沿用该年号. 中华书局《晋书》第01册第202页:非"升平"',
		'/哀帝/隆和|362/2/11~364/4/17|59h 3qug47p|君主名=司马丕|表字=千龄|年号=崇和',
		'/兴宁|363/1/31~|3qug47p 46i|注=兴宁元年二月改元兴宁。二年三月庚戌朔、庚戌土断颁布。八月，前燕夺取洛阳。三年二月，哀帝死；废帝司马奕即位，沿用至明年改元太和。',
		// TODO: 海西公太和四年闰月乙亥: 闰二月25日?
		'/海西公/太和|366/1/28~|4of859m 47p 3psh47m 4oju|君主名=司马奕|表字=延龄|君主=海西县公;废帝|生=342年|卒=386年|在位=365年~371年',
		'/简文帝/咸安|371/12/23~|11=35s 59m|庙号=中宗|君主名=司马昱|表字=道万|注=二年七月晋孝武帝即位沿用',
		'/孝武帝/宁康|373/2/9~|579 3qs747o|庙号=烈宗|君主=晋孝武帝|君主名=司马曜;司马昌明|表字=昌明|注=《魏书》错写作康宁',
		'/太元|376/2/7~|59m 4mg359h 3qu447p 42y 4ofd59l 47p 3mmt47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4ok3|注=二十一年九月晋安帝即位沿用',
		'/安帝/隆安|397/2/13~|3oq 4o1759h 47p 39zs|君主=晋安帝|君主名=司马德宗|表字=安德|年号=崇安|生=382年|卒=419年1月28日|在位=397年~419年',
		'/元兴|402/2/18~|46i 59h 3qud|注=胡三省注《资治通鉴》：元年三月，元显败，复隆安年号。桓玄寻改曰大亨。玄篡，又改曰永始。',
		'/义熙|405/2/15~|47p 46i 4of659m 3qui579 47e 4ojq59m 579 3qkz47o 4okc42y',
		'/恭帝/元熙|419/2/11~420/5/27|591 45c|君主=晋恭帝|君主名=司马德文',
		// 东晋统治地区出现的其他年号
		'/元王/建康|319/5/6~320/7/21|:东晋|疑|据=Wikipedia|君主=南阳王;晋王|谥=元王|君主名=司马保|表字=景度|生=296年|卒=320年|注=司马保故将陈安灭张春、杨次，将司马保以天子之礼葬于上邽，并谥为元王。',
		'/圣王/凤凰|370/9/7~370/11/4|:东晋|疑|据=Wikipedia|君主名=李弘|君主名=李金银|生=652年|卒=675年|注=《晋书·废帝纪》作九月反；《资治通鉴》作八月反，九月平。|注=李金银指使广汉李弘诈称是成汉末代皇帝李势的儿子，聚集了一万多兵众反晋，李弘自称圣王，年号为凤凰。九月，益州刺史周楚派孙子梓潼太守周虓讨伐平定了李弘、李金银之乱。',

		'/桓玄/大亨|402/4/18~403/2/7|3=:东晋|君主名=桓玄;桓灵宝|表字=敬道|谥=武悼皇帝|据=Wikipedia|生=369年|卒=404年6月19日|在位=403年~404年|注=桓玄在三月攻入建康时就废除了元兴年号，恢复隆安年号，不久又改元大亨。',
		'桓楚/=/永始|404/1/1~|/12/3=:东晋|据=Wikipedia|时期=两晋|注=桓玄于十二月壬辰日（404年1月1日）正式登位为帝，并改元「永始」|注=根据《晋书》记载，桓玄最初改元「建始」，因为和赵王司马伦同，改为永始。',
		'/桓谦/天康|404/6/20~405/4/14|:东晋|君主名=桓谦|表字=敬祖|据=Wikipedia|年号=天安',

		// 魏晋南北朝,三国两晋南北朝/五胡十六国(两晋十六国,东晋十六国)

		// 成
		// TODO: import 备注 from
		// https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E5%B9%B4%E5%8F%B7%E5%88%97%E8%A1%A8
		'成汉/始祖/建初|303/2/3~|:中国|疑|国号=成|时期=五胡十六国|注=李特之子李雄称王时，追谥李特为成都景王，等到称帝时，再追谥为景皇帝，庙号为始祖。|据=时间规范资料库',
		'/太宗/建兴|304/11/14~311/3/5|10=:中国|疑|君主=成武帝|谥=武皇帝|庙号=太宗|君主名=李雄|表字=仲隽',
		'/晏平|306/6/28~|6=:中国|疑|年号=宣平',
		'/玉衡|311/3/6~|2=:中国|疑|注=二十四年六月李班即位沿用，十月李期即位沿用',
		'/哀帝/=|334/8/11~|24/6/25=:中国|疑|谥=哀皇帝|君主名=李班|表字=世文|生=288年|卒=334年|在位=334年~334年|注=资治通鉴/卷095。(东晋成帝咸和九年六月)丁卯，雄卒，太子班即位。',
		'/幽公/玉恒|335/3/11~|2=:中国|疑|君主名=李期|表字=世运|谥=成废帝|年号=玉恒|生=314年|卒=338年|在位=334年~338年',
		// 汉
		'/中宗/汉兴|338/5/6~|4=:中国|疑|君主名=李寿|表字=考武|君主=昭文帝|谥=昭文皇帝|国号=汉|注=李寿发动兵变夺取政权，改国号为「汉」|注=《晋书》又称之为「后蜀」，唐代以后，已基本不使用「后蜀」来指称',
		'/末主/太和|344/1/31~|:中国|疑|君主=归义侯;后主|君主名=李势|表字=子仁',
		'/嘉宁|346/10/31~347/4/26|10=:中国|疑',

		'汉赵/高祖/元熙|304/11/14~|10=:中国|疑|君主=光文帝|君主名=刘渊|表字=元海|据=时间规范资料库|时期=五胡十六国|生=约251年|卒=310年8月19日|在位=304年~310年',
		'/永凤|308/10/31~|10=:中国|疑',
		'/河瑞|309/5/26~|闰4=:中国|疑',
		'/烈宗/光兴|310/8/12~|7=:中国|疑|君主=昭武帝|君主名=刘聪;刘载|表字=玄明|卒=318年8月31日|在位=310年~318年',
		'/嘉平|311/7/3~|6=:中国|疑',
		'/建元|315/4/21~|3=:中国|疑',
		'/麟嘉|316/12/1~|11=:中国|疑',
		'/隐帝/汉昌|318/8/13~|7=:中国|疑|君主名=刘粲|谥=隐皇帝;灵皇帝|卒=318年|在位=318年',
		// 八月止
		'前赵/刘曜/光初|318/11/10~329/10/8|10=:中国|疑|君主=后主|表字=永明|年号=佐初|据=时间规范资料库|时期=五胡十六国',
		// 前赵统治地区出现的其他势力年号
		'大秦/句渠知/平赵|320/7/22~8/20|:东晋|据=Wikipedia|时期=五胡十六国|注=前赵将领结合部分巴氐首领谋叛，事泄皆被前赵帝刘曜所杀。于是巴氐族人皆反，推句渠知为领袖，国号「大秦」，改元平赵。',
		'后赵/赵王|319/11/29~|11=:中国|疑|君主名=石勒|政权=石赵|时期=五胡十六国|生=274年|卒=333年8月17日|在位=319年~333年|注=太兴二年十一月，石勒称大将军、大单于、领冀州牧、赵王，于襄国即赵王位，正式建立后赵，称赵王元年。|据=时间规范资料库',
		'/高祖/太和|328/2/27~|2=:中国|疑|君主=明帝|表字=世龙|君主名=石勒|生=274年|卒=333年8月17日|在位=319年~333年',
		'/建平|330/9/29~|9=:中国|疑',
		'/海阳王/延熙|334/2/20~|:中国|疑|君主名=石弘|表字=大雅|生=314年|卒=335年|在位=333年~334年|注=《资治通鉴》考异：「《三十国·春秋》『虎即位，改元永熙』；《大统历》云『石虎即位，改建平五年为延兴，明年改建武。』」而《三十国春秋》并没有记载石弘改元延熙，故《资治通鉴》考异认为「陈鸿云虎改建平五年为延兴，即是弘逾年不改元，恐鸿说误」。「弘既号延熙，虎安肯称永熙？」',
		'/武帝/建武|335/2/10~|:中国|疑|庙号=赵太祖|谥=武皇帝|君主名=石虎|表字=季龙|生=295年|卒=349年|在位=334年~349年',
		'/太宁|349/2/4~|:中国|疑',
		'/少帝/=|349/5/4~|4=:中国|疑|君主名=石世|生=339年|卒=349年|在位=349年',
		'/成帝/=|349/6/2~|5=:中国|疑|君主名=石遵|卒=349年|在位=349年|注=本为彭城王',
		'/石鉴/=|349/12/26~|12=:中国|疑|君主=后主|君主名=石鉴;石鉴|表字=大郎|卒=350年|在位=349年~350年|注=本为义阳王',
		'/青龙|350/1/25~|:中国|疑',
		'/石祗/永宁|350/4/23~351/6/10|3=:中国|疑|注=本为新兴王',
		// 后赵统治地区出现的其他势力的年号
		'/侯子光/龙兴|337/8/13~9/10|:东晋|君主名=侯子光;李子杨|君主=大黄帝|据=Wikipedia|卒=337年',

		'前凉/太祖/永康|301/1/26~|2/=:西晋|疑|君主名=张轨|谥=武王|据=时间规范资料库|时期=五胡十六国|生=255年|卒=314年|在位=301年~314年|注=张轨使用西晋年号',
		'/永宁|301/5/24~|4=:西晋',
		'/太安|303/1/5~|12=:西晋',
		'/永安|304/2/22~|:西晋',
		'/建武|304/8/17~|7=:西晋',
		'/永安|304/12/14~|11=:西晋',
		'/永兴|305/1/12~|12=:西晋',
		'/永嘉|307/2/19~|:西晋',
		'/建兴|313/5/12~|4=:西晋',
		'/高祖/=|314/10/25~|2/10/=:中国|疑|君主名=张寔|表字=安逊|君主=元公|生=271年|卒=320年|在位=314年~320年|注=建兴五年前凉明王张寔袭用西晋年号，年号一作永安',
		'/太宗/=|320/7/22~|8/6/=:中国|疑|君主=成公;成王|君主名=张茂|生=277年|卒=324年|在位=320年~324年|注=年号一作永元',
		'/世祖/=|324/6/8~|12/5/=:中国|疑|君主=凉文王;忠成公|君主名=张骏|表字=公庭|生=307年|卒=346年|在位=324年~346年|注=年号一作太元',
		'/世宗/=|346/6/6~|34/5/=:中国|疑|君主=桓王|君主=敬烈公|君主名=张重华|表字=泰临|生=327年|卒=353年|在位=346年~353年|注=年号一作永乐：346年五月-353年',
		'/威王/=|353/12/29~|41/11/18=:中国|疑|君主=长宁侯|君主名=张祚|表字=太伯|生=327年前|卒=355年|在位=353年~355年',
		'/和平|354/6/7~|5=:中国|疑',
		'/冲王/建兴|355/10/22~|43/9/=:中国|疑|君主=敬悼公|君主名=张玄靓|表字=元安|生=350年|卒=363年|在位=355年~363年|注=355年闰九月-。年号或作太始。建兴四十九年十二月改元升平五年（用晋穆帝年号）。也有说升平一作太始，而非建兴一作太始。',
		'/升平|362/1/12~|5/12/=:中国|疑',
		'/悼公/=|363/8/26~376/9/29|7/8/=:中国|疑|君主名=张天锡|表字=纯嘏|年号=太清|生=346年|卒=406年|在位=363年~376年|注=升平二十年八月被前秦战败投降，前凉亡。|注=《太平御览》引《十六国春秋·前凉录》称「玄靖八年即位，年十八」故得生年。',
		// 前凉统治地区出现的其他势力年号
		'/张大豫/凤凰|386/3/17~387/8/29|2=:中国|疑|时期=五胡十六国|注=八月，广武人押解张大豫送到姑臧，吕光斩张大豫。',

		'后凉/太祖/太安|386/11/8~|10=:中国|疑|君主=懿武帝|君主名=吕光|表字=世明|据=时间规范资料库|时期=五胡十六国|生=338年|卒=399年|在位=386年~399年',
		'/麟嘉|389/3/13~400/1/12|2=:中国|疑',
		'/龙飞|396/7/22~|6=:中国|疑',
		// /太祖/承康: 诸史不载。
		'/灵帝/咸宁|400/1/13~|12=:中国|疑|君主名=吕纂|表字=永绪|卒=401年|在位=399年~401年',
		'/建康公/神鼎|401/3/1~403/10/1|2=:中国|疑|君主=尚书公|君主名=吕隆|表字=永基|卒=416年|在位=401年~403年',

		'前燕/烈祖/元玺|352/2/2~|:中国|疑|君主=景昭帝|君主名=慕容俊|表字=宣英|据=时间规范资料库|时期=五胡十六国|生=319年|卒=360年正月二十一日 (360年2月23日)|在位=348年~360年正月二十一日|注=十一月丁卯，慕容俊置百官，次日(353/1/4)即位为皇帝，改年号为「元玺」。十六国春秋 卷三 前燕录:元玺元年正月，司南车成，隽大悦...',
		'/光寿|357/3/29~|/2/23=:中国|疑',
		'/幽帝/建熙|360/2/17~371/1/2|/1/15=:中国|疑|君主名=慕容暐|表字=景茂|生=350年|卒=384年|在位=360年~370年',

		'后燕/世祖/燕元|384/2/8~|:中国|疑|君主名=慕容垂;慕容覇|表字=道明|据=时间规范资料库|谥=燕武成帝|时期=五胡十六国|生=326年|卒=396年6月2日|在位=384年~396年|注=《十六国春秋》始称后燕，以别于慕容氏诸燕',
		'/建兴|386/4/4~|/2/19=:中国|疑',
		'/烈宗/永康|396/6/3~|/4/11=:中国|疑|君主名=慕容寳|表字=道祐|君主=惠愍帝|注=慕容宝出走后为兰汗所诱而归龙城，最终被其杀害。',
		'/兰汗/青龙|398/5/27~398/8/15|/4/26=:中国|疑|谥=顺文帝|注=杀死慕容宝后，改元青龙。夺位当年即为慕容盛所杀。',
		//
		'/开封公/建始|397/6/28~|/5/17=:中国|疑|君主名=慕容详|谥=安武帝|卒=397年|注=后燕永康二年（397年），后燕不敌北魏的进攻，皇帝慕容宝等撤出都城中山（今中国河北省定县），城内大乱，慕容详当时不及跟随撤退，因此被推为盟主以抵御北魏的攻击。然而，慕容详为巩固自己的地位，不断翦除城内其他势力，同年稍后不久并即皇帝位，改元建始。',
		'/赵王/延平|397/8/10~398/1/15|7=:中国|疑|君主名=慕容麟|谥=顺武帝|生=4世纪？|卒=398年|注=由于慕容详嗜酒好杀，不恤士民，中山城民遂迎赵王慕容麟入城，慕容麟入城后，杀慕容详，亦称帝，改元延平。但随后又被北魏击败，南奔邺城（今中国河南省临漳县）投靠范阳王慕容德，并不再称帝。',
		//
		'/中宗/建平|398/11/9~|/10/14=:中国|疑|君主名=慕容盛|表字=道运|谥=昭武帝|生=373年|卒=401年|在位=398年~401年',
		'/长乐|399/3/19~|/1/26=:中国|疑',
		'/昭文帝/光始|401/10/17~|/闰8/24=:中国|疑|君主名=慕容熙|表字=道文|生=385年|卒=407年|在位=401年~407年',
		'/建始|407/2/23~407/9/16|2=:中国|疑',

		'前秦/高祖/皇始|351/3/4~|/1/20=:中国|疑|君主=景明帝|君主名=苻健|表字=建业|据=时间规范资料库|时期=五胡十六国|生=317年|卒=355年7月10日|在位=351年~355年',
		'/厉王/寿光|355/7/11~|/6/16=:中国|疑|君主名=苻生|表字=长生|生=335年|卒=357年|在位=355年~357年',
		'/世祖/永兴|357/7/3~|6=:中国|疑|君主=宣昭帝|君主名=苻坚|表字=永固|生=338年|卒=385年10月16日|在位=357年7月~385年10月16日',
		'/甘露|359/7/12~|6=:中国|疑',
		'/建元|365/2/7~|:中国|疑',
		'/哀平帝/太安|385/10/17~|/8/27=:中国|疑|君主名=苻丕|表字=永叔|卒=386年|在位=385年~386年',
		'/太宗/太初|386/12/8~|11=:中国|疑|君主=秦高帝|君主名=苻登|表字=文高|生=343年|卒=394年|在位=386年~394年',
		'/末主/延初|394/8/13~394/12/8|7=:中国|疑|君主名=苻崇|君主=延初帝;后主|卒=394年|在位=394年',
		// 前秦统治地区其他势力的年号
		'/张琚/建昌|352/2/2~6/28|:东晋|疑|君主=秦王|君主名=张琚|据=Wikipedia|时期=五胡十六国|卒=352年|注=张琚自立为秦王，改年号为建昌。五月，前秦皇帝苻健在宜秋攻打张琚，将其斩杀。',
		'/张育/黑龙|374/5/27~11/20|:东晋|疑|君主=蜀王|君主名=张育|据=Wikipedia|时期=五胡十六国|卒=374年|注=宁康二年五月，张育自称蜀王，六月，张育改元为黑龙。九月，杨安在成都以南打败了张重、尹万，斩杀士兵二万三千人，张重阵亡。另一方面，张育、杨光被邓羌攻杀于绵竹，益州又归前秦所有。',
		'/窦冲/元光|393/6/26~394/9/11|:东晋|疑|君主=秦王|君主名=窦冲|据=Wikipedia|时期=五胡十六国|注=393年六月，窦冲自称秦王，改年号为元光。394年七月，后秦安南将军强熙、镇远将军强多叛变，拥推窦冲为盟主。已经是后秦皇帝的姚兴亲自带兵前去讨伐，部队行进到武功县的时候，强多的侄儿强良国杀死了强多归降。强熙则逃奔秦州，窦冲逃奔，被氐族首领仇高抓住送还给后秦。',

		'后秦/太祖/白雀|384/5/7~|4=:中国|疑|君主=武昭帝|君主名=姚苌|表字=景茂|据=时间规范资料库|时期=五胡十六国|生=330年|卒=393年|在位=384年~394年|注=《晋书》及《资治通鉴》皆载姚苌死于太元十八年，通鉴更写姚苌死于十二月庚子日|注=后秦用三纪历|历法=三纪历',
		'/建初|386/6/13~|5=:中国|疑',
		'/高祖/=|394/2/1~|8/12/15=:中国|疑|君主=文桓帝|君主名=姚兴|表字=子略|生=366年|卒=416年|在位=394年~416年',
		'/皇初|394/7/1~|/5/17=:中国|疑',
		'/弘始|399/10/16~|9=:中国|疑',
		'/后主/永和|416/3/15~417/9/20|2=:中国|疑|君主名=姚泓|表字=元子|生=388年|卒=417年|在位=416年~417年',

		'西秦/烈祖/建义|385/10/20~|9=:中国|疑|君主=宣烈王|君主名=乞伏国仁|据=时间规范资料库|时期=五胡十六国|卒=388年|在位=385年~388年',
		'/高祖/太初|388/7/20~|6=:中国|疑|君主=武元王|君主名=乞伏干归|卒=412年|在位=388年~400年 409年~412年',
		'/更始|409/7/28~|7=:中国|疑',
		'/太祖/永康|412/9/22~|8=:中国|疑|君主=文昭王|君主名=乞伏炽盘|表字=安石|卒=428年|在位=412年~428年',
		'/建弘|420/1/31~|:中国|疑',
		'/后主/永弘|428/5/30~431/2/27|5=:中国|疑|君主名=乞伏暮末;乞伏慕末|表字=安石|卒=431年|在位=428年~431年',

		'南凉/烈祖/太初|397/2/13~|:中国|疑|谥=武王|庙号=烈祖|君主名=秃发乌孤|据=时间规范资料库|时期=五胡十六国|卒=399年|在位=397年~399年',
		'/康王/建和|400/2/11~|:中国|疑|君主名=秃发利鹿孤|卒=402年|在位=399年~402年',
		'/景王/弘昌|402/4/18~|3=:中国|疑|谥=景王|君主名=秃发傉檀|君主=景公|生=365年|卒=415年|在位=402年~414年',
		'/嘉平|408/12/4~409/1/31|11=:中国|疑|注=408年十一月复称凉王，改元嘉平。',

		'西凉/太祖/庚子|400/12/2~|11=:中国|疑|君主=武昭王|君主名=李暠|表字=玄盛|据=时间规范资料库|时期=五胡十六国|生=351年|卒=417年|在位=400年~417年',
		'/建初|405/2/15~|:中国|疑',
		'/凉公/嘉兴|417/3/4~|2=:中国|疑|君主=后主|君主名=李歆|表字=士业;桐椎|卒=420年|在位=417年~420年|注=小字桐椎',
		'/李恂/永建|420/11/21~421/5/17|10=:中国|疑|君主=后主|表字=士如',

		'北凉/建康公/神玺|397/6/12~|5=:中国|疑|据=时间规范资料库|君主名=段业|时期=五胡十六国|卒=401年|在位=397年~401年',
		'/天玺|399/3/23~|2=:中国|疑|年号=六玺',
		'/太祖/永安|401/6/27~|6=:中国|疑|谥=武宣王|君主名=沮渠蒙逊|庙号=太祖|生=368年|卒=433年|在位=401年~433年',
		'/玄始|412/12/19~|11=:中国|疑|年号=元始',
		'/承玄|428/6/28~|6=:中国|疑',
		'/义和|431/6/26~|6=:中国|疑',
		'/哀王/承和|433/5/5~|4=:中国|疑|君主名=沮渠牧犍;沮渠牧虔|谥=哀王|卒=447年|在位=433年~439年|年号=永和|注=437年起可能存在一个建平年号',
		'/沮渠无讳/承平|443/2/15~|:中国|疑|君主=拓王;酒泉王;河西王|注=关于沮渠无讳何时改元承平，晋书、宋书、魏书、南史、北史、十六国春秋、资治通鉴皆未载',
		'/沮渠安周/=|444/7/1~|2/6/=:中国|疑|君主=武拓王;河西王|君主名=沮渠安周|注=二年六月沮渠安周沿用。',
		// |时期=南北朝 @北朝时代柔然.
		// 阚氏高昌
		'高昌/阚伯周|460/12/29~|:中国|疑|君主名=阚伯周|注=柔然的附庸国。460年，柔然攻高昌，河西王沮渠安周被杀，高昌北凉灭亡。阚伯周被柔然立为高昌国王',
		'/阚义成|477/7/26~|:中国|疑|注=477年，其父阚伯周去世，阚义成即位。次年，其兄阚首归杀害阚义成，自立为王。',
		'/阚首归|478/8/14~|:中国|疑|君主名=阚首归|卒=488年被高车王可至罗所杀',
		'/阚首归/建初|489/2/16~492/2/13|:中国|疑|君主名=阚首归|注=被认为是阚氏的最后年号',
		'=/张孟明|488/1/29~|:中国|疑|君主名=张孟明|生=460年|卒=496年|注=488年，高昌王阚首归被高车王可至罗所杀，阚氏高昌灭亡。高昌人拥立张孟明为王',
		'/马儒|496/1/31~|:中国|疑|君主名=马儒|卒=501年|注=496年，高昌国人将高昌王张孟明杀害，拥立马儒为高昌王。',
		// 曲氏高昌
		'/昭武王/承平|502/1/24/2/4~|:中国|疑|君主名=曲嘉|谥=昭武王|关系=王莽时期西迁的汉人后代|在位=501年或502年~约525年在位|注=《高昌史稿.统治篇》谥号昭武王',
		'/义熙|510/8/20~|:中国|疑|注=不知其后是否还有年号，也不知其子是否沿用该年号，暂定该年号止于曲嘉死之年',
		'/曲光/甘露|525/8/5~|:中国|疑|君主名=曲光|关系=曲嘉子|在位=约525年~约530年',
		'/曲坚/章和|531/2/3~|:中国|疑|君主名=曲坚|关系=曲嘉子、曲光弟|在位=531年~548年',
		'/曲玄喜/永平|549/2/13~|:中国|疑|君主名=曲玄喜|关系=曲坚子|在位=549年~550年|注=该年号诸史皆无，有黄文弼根据《田元初墓表》补正',
		'/和平王/和平|551/1/23~|:中国|疑|关系=曲玄喜子|在位=551年~554年|注=佚名。该年号诸史皆无，黄文弼根据《汜绍和及妻张氏墓表》及《孟宣宗墓表》补正，不知为哪位君主的年号。',
		'/曲宝茂/建昌|555/2/7~|:中国|疑|君主名=曲宝茂|关系=高昌和平王子|在位=555年~560年',
		'/曲干固/延昌|561/2/1~|:中国|疑|君主名=曲干固|关系=曲宝茂子|在位=561年~601年|注=该年号由黄文弼根据高昌时期的残纸和《曲氏造寺碑》上的文字，考据出是曲干固的年号。',
		'/曲伯雅/延和|602/1/29~|:中国|疑|君主名=曲伯雅|关系=曲干固子|在位=602年~613年，复辟后：620年~623年|注=曲伯雅嗣位时间诸史皆无，黄文弼根据《延和二年癸亥唐元护妻令狐氏墓表》推算。',
		'/义和王/义和|614/2/15~|:中国|疑|在位=614年~619年|注=佚名，发动政变登位。该年号诸史皆无。黄文弼根据一些墓表和吐鲁番出土文书补正。吴震考订：高昌国延和十二年（613年）发生了一场政变。政变者统治高昌后，于次年改元义和。',
		'/曲伯雅/重光|620/2/9~|:中国|疑|注=复位。也有文献认为是曲文泰的年号',
		'/曲文泰/延寿|624/1/26~|:中国|疑|君主名=曲文泰|关系=曲伯雅子|在位=624年~640年',
		'/曲智盛/|640/7/24~641/2/15|:中国|疑|君主名=曲智盛|关系=曲文泰子|在位=640年|注=640年唐朝灭曲氏高昌。',
		// 高昌统治地区其他不详的年号:
		// 吐鲁番地区曾出土高昌时期的白雀年号。至于此白雀年号为高昌本身之年号或奉后秦之年号则仍然待考

		'南燕/世宗/燕平|398/2/3~|:中国|疑|君主=献武帝|君主名=慕容德;慕容备德|表字=玄明|据=时间规范资料库|时期=五胡十六国|生=336年|卒=405年|在位=398年~405年|注=诸书未言燕平年号之事，所据不详',
		'/建平|400/9/5~|:中国|疑|据=Wikipedia|注=《十六国春秋·南燕录》记八月改元，《通鉴》系于年末',
		'/北海王/太上|405/12/7~410/4/19|11=:中国|疑|君主=后主|君主名=慕容超|表字=祖明|生=385年|卒=410年|在位=405年~410年|据=Wikipedia|注=《十六国春秋·南燕录》记十一月改元，《通鉴》误作九月',
		//
		'北燕/惠懿帝/正始|407/9/15~|/7/28=:中国|疑|谥=惠懿帝|君主名=高云;慕容云|表字=子雨|据=时间规范资料库|时期=五胡十六国|注=由于对慕容云是否属后燕慕容氏一族成员的看法不同，因此有人认为慕容云是后燕末任君主，也有人把他视为北燕立国君主。',
		'/文成帝/太平|409/10/25~|10=:中国|疑|庙号=太祖|君主名=冯跋|表字=文起|卒=430年|在位=409年~430年',
		'/昭成帝/=|430/10/3~|22/9/=:中国|疑|君主名=冯弘|表字=文通|卒=438年|在位=430年~436年',
		'/太兴|431/1/29~436/6/4|:中国|疑',

		'胡夏/世祖/龙升|407/7/21~|6=:中国|疑|君主=武烈帝|君主名=赫连勃勃|表字=屈孑|据=时间规范资料库|时期=五胡十六国|生=381年|卒=425年|在位=407年~425年',
		'/凤翔|413/4/17~|3=:中国|疑',
		'/昌武|418/12/14~|11=:中国|疑|君主=武烈帝',
		'/真兴|419/3/12~|2=:中国|疑',
		'/秦王/承光|425/8/30~|8=:中国|疑|君主名=赫连昌;赫连折|表字=还国|年号=承阳;永光|卒=434年|在位=425年~428年',
		'/康王/胜光|428/3/2~431/7/25|2=:中国|疑|君主=后主|君主名=赫连定|卒=432年|在位=428年~431年',

		'冉魏/平帝/永兴|350/3/25~|闰2=:中国|疑|君主名=冉闵;石闵|君主=武悼天王|表字=永曾;棘奴|据=Wikipedia|时期=五胡十六国|卒=352年6月1日|在位=350年~352年',
		'/惠帝/=|352/3/2~352/5/29|闰2=:中国|疑|君主名=冉智|据=Wikipedia|卒=354年',

		'代国/高祖/建国|338/11/28~377/1/25|11=:中国|疑|君主名=拓跋什翼犍|君主=昭成帝|据=时间规范资料库|生=318年|卒=376年|注=北魏的前身。|时期=五胡十六国',

		'丁零/翟斌|330/2/5~|:东晋|疑|据=Wikipedia|部落=敕勒|时期=五胡十六国|注=读史方舆纪要/卷三 晋咸和五年翟斌归于石赵，赵封斌为句町王，赵亡，归燕。永和七年慕容隽复封翟鼠为归义王，居中山。秦灭燕，徙其族居新安、渑池间，斌因起兵叛秦。',
		'/翟真|384/2/8~|:东晋|疑|据=Wikipedia',
		'/翟成|385/1/27~|:东晋|疑|据=Wikipedia',
		'/翟辽|385/8/22~|:东晋|疑|据=Wikipedia',
		'翟魏/翟辽/建光|388/3/24~|2=:东晋|疑|据=时间规范资料库|时期=五胡十六国|部落=敕勒',
		'/翟钊/定鼎|391/11/13~393/1/28|10=:东晋|疑',
		// 高车（敕勒）@北魏, 邓至（白水羌）@北魏, 宕昌国，又称宕昌羌@北周
		// https://zh.wikipedia.org/wiki/%E4%B8%9C%E6%99%8B%E5%8D%81%E5%85%AD%E5%9B%BD%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8
		'鲜于赵/鲜于乞|385/4/26~386/2/14|:东晋|疑|据=Wikipedia|时期=五胡十六国|注=385年四月，鲜于乞杀翟真及翟氏族人，自立为赵王。不久，鲜于乞又被丁零部众翟真的堂弟翟成所杀。',

		'西燕/济北王/燕兴|384/5/7~|4=:中国|疑|君主名=慕容泓|据=时间规范资料库|时期=五胡十六国|卒=384年|在位=384年',
		'/威帝/更始|385/1/27~|:中国|疑|君主名=慕容冲|生=359年|卒=386年|在位=385年~386年',
		'/段随/昌平|386/3/17~|2=:中国|疑',
		'/慕容𫖮/建明|386/4/15~5/14|3=:中国|疑|君主名=慕容𫖮;慕容凯|卒=386年|在位=386年|注=《资治通鉴》作慕容𫖮，《魏书》作慕容凯。',
		'/慕容瑶/建平|386/4/15~5/14|3=:中国|疑',
		'/慕容忠/建武|386/4/15~|3=:中国|疑',
		'/慕容永/中兴|386/11/8~394/10/10|10=:中国|疑',

		// 魏晋南北朝,三国两晋南北朝/南朝
		// 时期=六朝

		'刘宋/武帝/永初|420/6/27~|6=2v8847p 42y|庙号=宋高祖|君主名=刘裕|表字=德兴|朝代=前宋;南朝宋|时期=南北朝|生=363年4月16日|卒=422年6月26日|在位=420年7月10日~422年6月26日|注=三年五月刘义符即位沿用',
		'/营阳王/景平|423/1/28~|4o1059c|君主名=刘义符|表字=车兵|君主=少帝|生=406年|卒=424年8月4日|在位=422年6月26日~424年7月7日',
		'/文帝/元嘉|424/9/9~|8=361 47p 3mmp46i 4oiy59m 47p 3psm47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qud47p 42y 4of659m 3qui505 47e 4ojq|庙号=太祖|君主名=刘义隆|生=407年|卒=453年3月16日|在位=424年9月17日~453年3月16日|注=三十年四月刘骏即位沿用',
		'/孝武帝/孝建|454/2/14~|59m 505 3qkz|庙号=世祖|君主名=刘骏|表字=休龙|生=430年9月19日|卒=464年7月12日|在位=453年5月20日~464年7月12日',
		'/大明|457/2/10~|47o 4okc42y 591 3qu147p 42y 4o11|注=八年闰五月刘子业即位沿用',
		'/前废帝/永光|465/2/12~|59c|君主=废帝|君主名=刘子业|生=449年2月25日|卒=466年1月1日|在位=464年7月12日~466年1月1日',
		'/景和|465/9/6~|8=360',
		'/明帝/泰始|466/1/3~|12=35t 47p 3mmp46i 4oiz59m 505|庙号=太宗|君主名=刘彧|表字=休景|生=439年12月9日|卒=472年5月10日|在位=466年1月9日~472年5月10日',
		'/泰豫|472/1/26~|3psn|注=四月刘昱即位沿用',
		'/苍梧王/元徽|473/2/13~|47m 59m 4g4j579 474|君主名=刘昱|表字=德嗣|君主=后废帝|生=463年3月1日|卒=477年8月1日|在位=472年5月11日~477年8月1日',
		'/顺帝/升明|477/7/26~|7=2tlo47p 3k0|君主名=刘准|表字=仲谋|生=469年8月8日|卒=479年6月23日|在位=477年8月5日~479年5月27日',

		'南齐/高帝/建元|479/5/7~|4=3ai 4mg959h 47p|庙号=太祖|君主名=萧道成|表字=伯绍|朝代=萧齐|时期=南北朝|生=427年|卒=482年4月11日|在位=479年5月29日~482年4月11日|注=四年三月萧赜即位沿用',
		'/武帝/永明|483/1/24~|39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e|庙号=齐世祖|君主名=萧赜|表字=宣远|生=440年|卒=493年8月27日|在位=482年4月11日~493年8月27日|注=十一年七月萧昭业即位沿用',
		'/郁林王/隆昌|494/1/23~|4oas|君主名=萧昭业|表字=尚元|生=473年|卒=494年9月7日|在位=493年8月27日~494年9月7日',
		'/海陵王/延兴|494/8/17~|7=368|君主名=萧昭文|表字=季尚|生=480年|卒=494年|在位=494年9月10日~494年11月23日',
		'/明帝/建武|494/11/14~|10=35w 59m 4g4s591 3y8|君主=高宗|君主名=萧鸾|表字=景栖|生=452年|卒=498年|在位=494年12月22日~498年9月1日',
		'/永泰|498/5/7~|4=3f8|注=元年七月萧宝卷即位沿用',
		'/东昏侯/永元|499/1/28~|4ok83oq 4qo|君主名=萧宝卷|表字=智藏|生=483年|卒=501年|在位=498年~501年',
		'/和帝/中兴|501/4/4~|3=3o5 3y8|君主名=萧宝融|表字=智昭|生=488年|卒=502年|在位=501年4月14日~502年4月30日|注=梁书/卷01 永元三年三月乙巳，南康王即帝位于江陵，改永元三年为中兴元年，遥废东昏为涪陵王。',

		'南梁/武帝/天监|502/4/23~|4=31jo47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4okc3oq 579 3qs847p|庙号=梁高祖|君主名=萧衍|表字=叔达|朝代=萧梁|时期=南北朝|生=464年|卒=549年|在位=502年~549年|注=梁书/卷02 天监元年夏四月丙寅，高祖即皇帝位于南郊。...改齐中兴二年为天监元年。',
		'/普通|520/2/4~|3oq 4mg559h 47p 39zm42y 4ofe4qo',
		'/大通|527/4/17~|3=3oq 47p 3mkm',
		'/中大通|529/11/17~|10=35x 47e 59m 3qub505 3ql8|注=梁书/卷03 中大通元年冬十月己酉改元',
		'/大同|535/2/18~|47o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu3y8',
		'/中大同|546/5/16~|4=3e2 54w',
		'/太清|547/5/5~|4=3ah 3quf47p|注=三年五月萧纲即位沿用',
		'/简文帝/大宝|550/2/2~|46i 4oar|庙号=太宗|君主名=萧纲|表字=世缵|生=503年|卒=551年|在位=549年~551年',
		'/豫章王/天正|551/9/16~|8=36a|君主名=萧栋|卒=552年|在位=551年|注=551年八月—十一月',
		'/萧纪/=|552/2/11~553/8/24|59m 3quj|君主=武陵王;废帝|注=552年四月—553年七月。《资治通鉴》记载，侯景之乱时，萧纪不救援。等到萧衍死后，在四川即位，年号天正。',
		'/元帝/承圣|552/12/2~|11=59m 3quj579 45c|君主=孝元帝|庙号=世祖|君主名=萧绎|表字=世诚|生=508年9月16日|卒=555年1月27日|在位=552年12月13日~555年1月27日',
		'/闵帝/天成|555/6/5~|5=380|君主=贞阳侯|谥=闵帝|君主名=萧渊明|表字=靖通|卒=556年|在位=555年',
		'/敬帝/绍泰|555/10/31~|10=35u 4oi0|君主名=萧方智|表字=慧相|生=543年|卒=558年|在位=555年~557年',
		'/太平|556/10/19~|9=35w 59k',

		'陈/武帝/永定|557/11/7~|10=35u 579 3qs4|庙号=陈高祖|君主名=陈覇先;陈霸先|表字=兴国|时期=南北朝',
		'/文帝/天嘉|560/2/12~|47o 59m 4mg259h 3qu247p 35s|庙号=世祖|君主名=陈蒨|表字=子华|生=522年|卒=566年|在位=559年~566年',
		'/天康|566/3/7~|2=42y',
		'/临海王/光大|567/1/26~|4ofa59l|君主=废帝|君主名=陈伯宗|表字=奉业;药王|生=554年|卒=570年|在位=566年~568年|注=小字药王',
		'/宣帝/太建|569/2/2~|47p 3mms47e 4oj059m 505 3ql547m 59m 4g4l591 47m 4ok23oq|君主=孝宣帝|谥=孝宣皇帝|庙号=高宗|君主名=陈顼;陈昙顼|表字=绍世|生=530年|卒=582年|在位=568年~582年',
		'/后主/至德|583/1/29~|4o1759h 47p 39zr|君主名=陈叔宝|表字=元秀|生=553年|卒=604年|在位=582年~589年',
		'/祯明|587/2/13~589/2/20|46i 59h 35s',

		// 南朝宋统治地区其他势力的年号
		'刘宋/蜀王/泰始|432/2/17~437/6/18|:刘宋|君主名=程道养|注=赵广拥道士程道养冒充司马飞龙，立为蜀王，改元泰始。',
		'/刘劭/太初|453/3/17~6/21|:刘宋|表字=休远|生=刘宋文帝元嘉元年|卒=453年5月27日|注=弑父夺位',
		'/鲁爽/建平|454/3/15~8/9|:刘宋|小名=女生|卒=454年|注=刘宋文帝元嘉三十年，太子刘劭发动政变弑父登位，荆州刺史、南谯王刘义宣不久就起兵讨伐，...鲁爽自建年号建平，并制造舆服，杀怀疑不支持他的长史韦处穆、中兵参军杨元驹及治中庾腾之。义宣等知鲁爽起兵，只得狼狈跟随，进鲁爽为征北将军，而鲁爽就将造好的舆服送到江陵，征北府更版命义宣为皇帝、臧质为丞相、朱修之为车骑将军。',
		'/楚王/永光|455/7/30~8/28|:刘宋|君主名=刘浑|君主=武昌王;武昌县侯|表字=休渊|生=439年|卒=455年8月29日|年号=元光;允光',
		'/刘子勋/义嘉|466/2/7~9/19|:刘宋|君主名=刘子勋|君主=晋安王|表字=孝德|生=456年|卒=466年9月19日|注=刘宋明帝泰始二年正月初七，邓琬与雍州刺史袁𫖮等在寻阳城奉刘子勋为帝，年号义嘉，并得到全国州镇的支持，出兵讨伐建康的刘彧政权，史称「义嘉之难」。八月己卯，刘子勋被刘彧大将沈攸之捕斩，年仅十一岁，即葬寻阳庐山。',
		'仇池/大秦王/建义|436/4/2~|:刘宋|疑|君主名=杨难当|时期=南北朝|注=436年仇池（今中国甘肃南一带）首领杨难当自称大秦王，改元建义，然犹贡奉宋、魏不绝。',
		'/武都王/=|440/2/19~442/7/23|5/=:刘宋|疑|君主名=杨难当|注=440年，杨难当复称武都王。',

		// 南齐统治地区其他势力的年号
		'南齐/镇西将军/建义|500/3/16~500/5/13|:南齐|君主名=雍道晞',
		'唐吴/唐㝢之/兴平|486/1/21~487/2/8|:南齐|君主名=唐寓之|时期=南北朝',

		// 南梁统治地区其他势力的年号
		'南梁/鲜于琛/上愿|535/2/18~536/2/7|:南梁',
		'/刘敬躬/永汉|542/2/1~542/4/29|:南梁|注=南梁大同八年（542年）十二月在安成郡（今江西安福）率众起事，称帝',
		'/临贺王/正平|548/12/16~549/8/8|:南梁|君主名=萧正德',
		'/萧庄/天启|558/4/4~560/4/10|:陈|生=548年|卒=577年|在位=557年~560年|注=《资治通鉴》载萧庄即位在三月。',
		'侯汉/侯景/太始|551/12/14~552/5/8|:南梁|时期=南北朝|生=503年|卒=552年|注=551年，废萧纲，再立豫章王萧栋为帝，改元天正。同年，再命萧栋禅让，侯景登极为帝，国号汉，改元太始。追尊汉司徒侯霸为始祖，晋征士侯瑾为七世祖。',

		// 魏晋南北朝,三国两晋南北朝/北朝

		'北魏/道武帝/登国|386/2/15~|47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4oar|庙号=太祖|君主名=拓跋珪;拓拔珪|时期=南北朝|生=371年8月4日|卒=409年11月6日|在位=386年2月20日~409年11月6日',
		'/皇始|396/8/20~|7=36d 3oq 4o17',
		'/天兴|399/1/23~|12=35s 59h 47p 39zs46i 59h 3qth',
		'/天赐|404/11/18~|10=35u 47p 46i 4of659m 47k',
		'/明元帝/永兴|409/10/25~|10=2t9m579 47e 4ojq59m|庙号=太宗|君主名=拓跋嗣;拓拔嗣|表字=木末|生=392年|卒=423年12月24日|在位=409年11月10日~423年12月24日',
		'/神瑞|414/2/6~|579 3qkz3y8',
		'/泰常|416/5/13~|4=3f8 4okc42y 591 3qu047p 42y 4o10',
		'/太武帝/始光|424/2/16~|59l 47p 3mmp46i 4qo|庙号=世祖|君主名=拓跋焘;拓拔焘|生=408年|卒=452年3月11日  北魏天赐 (北魏)|在位=423年12月27日~452年3月11日',
		'/神䴥|428/3/2~|2=39yi59m 47p 3psm',
		'/延和|432/2/17~|47m 59m 4g4j',
		'/太延|435/2/14~|579 3qsc47p 3oq 4mg958g',
		'/太平真君|440/7/15~|6=36t 47p 39zp42y 59h 3qu947p 3mm247e 59m 3quf4xs',
		'/正平|451/7/15~|6=385 3y8',
		'/南安王/承平|452/4/5~|3=3ew|君主名=拓跋余|卒=452年10月29日|在位=452年3月11日~10月29日|注=《魏书》作永平，《宋书》、《资治通鉴》作承平。李崇智以永平为后来的北魏宣武帝的其中一个年号，认为宣武帝应不会承继旧年号，所以从承平。',
		'/文成帝/兴安|452/10/29~|10=35u 4ojq58g|庙号=高宗|君主名=拓跋濬;拓拔濬;拓跋浚|生=440年|卒=465年6月20日|在位=452年10月31日~465年6月20日',
		'/兴光|454/8/10~|7=36y 54w',
		'/太安|455/7/1~|6=385 3qky47o 4okc42y|注=中央研究院 两千年中西历转换记北魏文成帝太安四年闰十二月，另有文载北魏文成帝太安四年闰十月',
		'/和平|460/2/8~|591 3qu147p 42y 4o1059l',
		'/献文帝/天安|466/2/1~|47p 3mdd|庙号=显祖|君主名=拓跋弘;拓拔弘|表字=万民|生=454年|卒=476年7月20日|在位=465年6月21日~471年9月20日',
		'/皇兴|467/9/15~|8=36d 46i 4oix59m 4zk',
		'/孝文帝/延兴|471/9/1~|8=36d 3psm47m 59m 4g4j54w|庙号=魏高祖|君主名=元宏|生=467年10月13日|卒=499年4月26日|在位=471年9月20日~499年4月26日|注=冯太后在文成帝死后于466年发动政变除掉了矫诏擅权、多行不法的丞相太原王乙浑，随即长期摄政',
		'/承明|476/7/8~|6=385',
		'/太和|477/1/30~|3qsb47p 3oq 4mg959h 47p 39zo42y 59h 3qu947p 3mmx47e 59m 3quf505 47e 4ojo59m 4g4r591 47o 4ok8',
		'/宣武帝/景明|500/2/15~|3oq 591 3qtw47p|庙号=世宗|君主名=元恪|生=483年|卒=515年2月12日|在位=499年5月7日~515年2月12日',
		'/正始|504/2/1~|39zw46i 59l 3quh474',
		'/永平|508/9/11~|8=36d 46i 4oiu59m 3y8',
		'/延昌|512/5/2~|4=3f9 3psi47m 4okc',
		'/孝明帝/熙平|516/2/18~|3oq 579 35s|庙号=肃宗|君主名=元诩|生=510年4月8日|卒=528年3月31日|在位=515年2月12日~528年3月31日',
		'/神龟|518/2/26~520/8/28|2=3qs747p 3oq',
		'/正光|520/2/4~|3oq 4mg559h 47o 4ok241s|注=魏书/卷9 正光元年春正月乙酉...秋七月丙子...辛卯，帝加元服，大赦，改年，内外百官进位一等。',
		'/孝昌|525/7/6~|6=36y 4off59l 47k',
		'/武泰|528/2/13~|/1/8=47k',
		'/元氏/武泰|528/4/1~|/2/26=47k|生=北魏孝明帝孝昌四年春正月初七乙丑|注=武泰元年二月廿五癸丑日孝明帝元诩被胡太后(灵太后,宣武灵皇后)暗中串通近臣用毒酒毒死，武泰元年二月廿六甲寅日，胡太后伪称皇女元氏为皇太子，拥立元氏登基为皇帝，胡太后继续临朝称制。一天不到，胡太后见人心安定，发下诏书宣布皇帝本是女儿身，废黜女婴皇帝，改立已故宗室临洮王元宝晖的世子元钊为皇帝。尔朱荣又另立元子攸为皇帝，是为孝庄帝，北魏出现了两帝并立的局面。15日后，建义元年四月庚子，尔朱荣的军队占领京师洛阳，胡太后和幼主元钊被俘。尔朱荣不听，下令将幼主和胡太后沉入黄河',
		'/元钊/武泰|528/4/2~|/2/27=47k|生=526年|卒=528年5月17日|注=二月乙卯（528年4月2日），元钊即位。元钊当年才虚龄三岁',
		'/孝庄帝/建义|528/5/15~|/4/11=47k|庙号=敬宗|君主名=元子攸|生=507年|卒=永安三年十二月甲子（531年1月26日），魏孝庄帝于晋阳城（今太原市晋源区境）三级寺被尔朱兆绞杀|在位=528年5月15日~531年1月6日|注=建义元年四月十一日，元子攸被尔朱荣拥立为皇帝。十二月三日（531年1月6日），尔朱兆攻入洛阳，杀死孝庄帝在襁褓中的儿子，孝庄帝被俘囚于永宁寺、后解送囚于晋阳三级寺。',
		'/永安|528/9/29~|9=35x 3mmv47e',
		'/长广王/建明|530/12/5~|/10/30=47e 59l|君主名=元晔|君主=东海王|注=永安三年十月三十日（530年12月5日），尔朱兆另立元晔为帝。',
		'/节闵帝/普泰|531/3/4~532/6/18|2=59l 3qub|年号=普嘉|君主名=元恭|表字=修业|生=498年|卒=北魏孝武帝太昌元年五月丙申|在位=531年4月1日~532年6月|注=《历代建元考》：诸书皆作普嘉。北魏长广王建明二年二月廿九日，尔朱荣堂弟尔朱世隆废元晔，立元恭为帝。军阀高欢则立渤海太守安定王元朗为帝。东魏称广陵王或前废帝，西魏谥节闵帝。',
		'/安定王/中兴|531/10/26~532/6/18|10=59l 3qub|君主名=元朗|生=513年|卒=北魏孝武帝太昌元年十一月甲辰，元朗和元晔都在门下外省被杀死。永熙二年葬于邺西南野马冈|注=北魏普泰元年十月六日被高欢立为皇帝，普泰2年四月高欢因元朗世系疏远，迫使他让位于孝武帝元修。',
		'/孝武帝/太昌|532/5/20~|4=3qub|君主=孝武帝;出帝|君主名=元修;元修|表字=孝则|生=510年|卒=535年2月3日|在位=532年6月13日~535年2月3日',
		'/永兴|533/1/11~2/9|12=3qub|注=永兴（532年十二月）是北魏孝武帝元修的第二个年号，历时未及一个月。|注=魏书/卷11 十有二月..丁亥，杀大司马、汝南王悦。大赦天下，改太昌为永兴，以太宗号，寻改为永熙元年。 二年春正月庚寅朔，朝飨群臣于太极前殿。',
		'/永熙|533/1/11~|12=35s 505 3ql8|注=闰十二月十五日（535年2月3日），宇文泰以元修淫及从姊妹有伤风化为由，把元明月和元修都给杀死，改立元宝炬为帝。北魏从此正式分裂成东西魏。',

		'东魏/孝静帝/天平|534/10/23~|10=2t7g47m 59m 4g4p|君主名=元善见|时期=南北朝|生=524年|卒=551年|在位=534年~550年',
		'/元象|538/2/15~|591 47k',
		'/兴和|539/11/27~|11=35u 4ok53oq 591',
		'/武定|543/1/21~550/5/30|3qs147p 39zu46i 59h 3quf47p 45c|注=543年-550年五月',

		'西魏/文景帝/建平|508/9/11~508/11/8|:北魏|君主名=元愉|君主字=宣德|时期=南北朝|注=太和二十一年（497年）封京兆王，西魏大统元年春正月戊申，文帝元宝炬追谥元愉为文景皇帝。',
		'/文帝/大统|535/2/18~|47m 59m 4g4p591 47m 4ok53oq 591 3qs147p 39zu46i 59h 3quf47p 46i 4of8|君主名=元宝炬|生=507年|卒=551年|在位=535年~551年',
		'=/废帝/干明|552/2/11~|59m 3quk|疑|君主名=元钦|注=段长基的《历代统纪表》卷七认为西魏君主元钦有干明元年及二年，但是其他诸书均无记载，都称元钦没有年号',
		'=/恭帝|554/2/18~557/1/15|579 47e 4ojs|君主名=拓跋廓;拓拔廓|生=537年|卒=557年|在位=554年~557年',

		// 北魏统治地区其他势力的年号
		'北魏/白亚栗斯/建平|415/3/26~|:北魏|疑|注=胡族，自称大将军，自号为单于，以司马顺宰为谋主。',
		'/刘虎/=|416/2/14~416/11/6|:北魏|疑|注=北魏神瑞二年被上党胡人推为主',
		'/司马小君/圣君|471/11/28~472/1/25|:北魏|疑',
		'/吕苟儿/建明|506/2/9~506/9/2|:北魏|疑|注=魏书/卷8: 天监三年春正月壬申...秦州民王灋智等聚众二千自号王公，寻推秦州主簿吕苟儿为主，年号建明。...秋七月...庚辰，元丽大破秦贼，降吕苟儿及其王公三十余人|注=资治通鉴/卷146: 天监五年春正月乙亥...魏秦州屠各王灋智聚众二千...己卯...六月...乙巳，魏安西将军元丽击王灋智，破之，斩首六千级。...七月...吕苟儿率众十余万屯孤山，围逼秦州，元丽进击，大破之。行秦州事李韶掩击孤山，获其父母妻子，庚辰，苟儿帅其徒诣丽降。',
		'/陈瞻/圣明|506/2/9~506/9/2|:北魏|疑|据=魏书/卷8',
		// 樊素安/正始: 见于叶维庚的《纪元通考》和李兆洛《纪元编》，不详何时，或以为是北魏宣武帝元恪的正始年号之误
		'/法庆/大乘|515/6/27~515/10/22|:北魏|疑|注=九月十四日，大乘军兵败，法庆、惠晖及头领百余人被捕杀，叛民被屠杀者以万数。《魏书》、《资治通鉴》谓法庆自号大乘，未有提及建立年号。《玉海》以大乘为法庆的年号。',
		'/破六韩拔陵/真王|524/4/19~525/8/4|:北魏|疑|君主名=破六韩拔陵;破落汗拔陵|注=六镇之乱领导人',
		'/杜洛周/真王|525/9/3~528/4/4|2/=:北魏|疑|君主名=杜洛周;吐斤洛周|注=据《两件北魏「真王五年」造像铭考》考证，杜洛周奉破六韩拔陵「真王」正朔，525年为真王二年。武泰元年二月，杜洛周被葛荣偷袭杀死，部众被葛荣兼并。',
		'/秦天子/天建|524/7/17~527/11/8|:北魏|疑|君主名=莫折念生',
		'/襄厉王/天启|525/2/8~525/5/7|:北魏|疑|年号=大启|谥=襄厉王|君主名=元法僧|君主=始安郡公|注=孝昌元年正月庚申称帝。甲戌，梁朝任命元法僧为司空，封始安郡公，寻改封宋王。三月己巳，梁朝任命元景隆为衡州刺史，元景仲为广州刺史。梁武帝召元法僧及元略回建康，元法僧驱赶彭城官民万人南渡。',
		'/鲜于修礼/鲁兴|526/1/29~526/9/21|:北魏|疑|年号=普兴|注=丁零族，河北起义。八月，鲜于修礼被元洪业杀害',
		// 陈双炽/始建 诸书记载「自号始建王」，并没有说改元。而《玉海》等书则把「始建」作为年号
		'/刘获/天授|527/8/13~527/9/10|:北魏|疑|注=527年七月，刘获和同乡郑辩在西华反魏，改年号为天授，并与南梁谯州刺史湛僧智合谋',
		'/汉王/天统|528/7/3~529/5/23|:北魏|疑|君主名=邢杲|注=建义元年六月率众起事',
		'/万俟丑奴/神兽|528/8/1~530/6/10|:北魏|疑|年号=神虎;神平|注=「万俟」为复姓，读作「陌奇」。万俟丑奴原为胡琛部将；胡琛为破六韩拔陵所杀，万俟丑奴继承指挥权。',
		'/北海王/孝基|529/4/24~|:北魏|疑|君主名=元颢|君主字=子明|注=袭封北海王。528年，河阴之变后，元颢南投萧梁，梁武帝封他为魏王',
		'/建武|529/6/17~529/8/19|:北魏|疑|注=资治通鉴卷第一百五十三: 丙子，颢入洛阳宫，改元建武，大赦。',
		'/汝南王/更兴|530/7/11~533/2/9|:北魏|疑|君主名=元悦|谥=文宣|年号=更新|注=北魏孝文帝元宏第六子',

		'葛齐/葛荣/广安|526/9/22~528/10/28|:北魏|疑|时期=南北朝|国号=齐|注=鲜卑人',
		'萧齐/萧宝夤/隆绪|527/9/11~528/3/6|:北魏|疑|时期=南北朝|君主字=智亮|注=南齐齐明帝萧鸾第六子，投奔北魏，成为北魏驸马。',

		// 北周统治地区其他势力的年号
		'稽胡/刘蠡升/神嘉|525/12/30~535/5/17|:中国|疑|时期=南北朝|注=稽胡，又称山胡、步落稽|注=北魏边境常被刘蠡升侵扰，时人称他为「胡荒」。...三月辛酉，刘蠡升的北部王斩刘蠡升之首来投降',
		'/圣武皇帝/石平|577/11/26~577/12/24|:中国|疑|君主名=刘没铎|注=刘蠡升的孙子。',

		// 东魏统治地区其他势力的年号
		'东魏/王迢触/平都|536/10/1~10/29|:东魏|疑|注=《北齐书·第2卷·神武帝纪下》：九月辛亥，汾州胡王迢触、曹贰龙聚众反，署立百官，年号平都。神武讨平之。',

		// 柔然汗国可考年号
		// https://zh.wikipedia.org/wiki/%E4%B8%9C%E6%99%8B%E5%8D%81%E5%85%AD%E5%9B%BD%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8#.E6.9F.94.E7.84.B6.E6.B1.97.E5.9B.BD
		'柔然/丘豆伐可汗|402/2/18~|:中国|疑|君主名=社仑',
		'/蔼苦盖可汗|410/6/18~|:中国|疑|君主名=斛律|注=北魏永兴二年（410年）5月，北魏进攻柔然，社仑卒于逃跑途中。由于儿子度拔年幼，故立社仑弟斛律为可汗。',
		'/步鹿真|414/6/4~|:中国|疑|注=斛律侄。义熙十年（414年）5月，步鹿真作乱。',
		'/牟汗纥升盖可汗|414/7/4~|:中国|疑|君主名=大檀|注=斛律季父之子，414年立，429年7月卒。这名称也是鞑靼一名的来源。',
		'/敕连可汗|429/8/16~|:中国|疑|君主名=吴提|注=444年9月，吴提逝世。',
		'/处可汗|444/9/28~|:中国|疑|君主名=吐贺真|注=464年7月卒',
		'/受罗部真可汗/永康|464/8/19~|:中国|疑|君主名=予成|注=485年7月卒。',
		'/伏名敦可汗/太平|485/7/28~|:中国|疑|君主名=豆仑|注=492年8月遭叔父一派杀害夺位。',
		'/候其伏代库者可汗/太安|492/9/8~|:中国|疑|君主名=那盖|注=506年10月卒。',
		'/佗汗可汗/始平|506/11/1~|:中国|疑|君主名=伏图|注=508年遭高车王弥俄突所杀。',
		'/豆罗伏跋豆伐可汗/建昌|508/2/17~|:中国|疑|君主名=丑奴;丑奴',
		'=/敕连头兵豆伐可汗|520/9/28~|:中国|疑|君主名=阿那瓌|生=472年|卒=552年|注=520年9月立汗。西魏废帝元年正月土门发兵攻击柔然，大破柔然军于怀荒镇北面。阿那瓌因而自杀，其子庵罗辰投奔北齐，余众复立阿那瓌叔父邓叔子为柔然国主。',
		//
		'/铁伐|552/2/11~|:中国|疑|注=552年立汗，553年遭契丹所杀。',
		'/登注俟利|552/3/11~|:中国|疑|注=铁伐之父亲，552年立汗，553年遭大人阿富提所杀。',
		'/库提|553/1/30~|:中国|疑|注=登注俟利之子，于553年立汗。',
		//
		'/庵罗辰|553/3/30~555/2/6|:中国|疑|注=553年立汗，554年叛北齐，奔西魏后被杀。',
		'/邓叔子|553/3/30~556/1/27|:中国|疑|注=与庵罗辰同于553年并立。于553年3月立汗，555年，防线被突厥破，率3000兵士奔西魏，后被杀。557年，突厥宣布正式并吞柔然地区。',
		//
		'/弥偶可杜句可汗|521/1/24~526/1/28|:中国|疑|君主名=俟力发婆罗门|注=婆罗门是阿那瓌之堂兄，于521年元月立汗，与阿那瓌并立。后因高车攻打，入塞降北魏。',

		'北齐/文宣帝/天保|550/5/31~|5=36y 4oiq59m 3quj579 47m 4ojs59m 579 3qs4|历法=天保历|庙号=显祖|君主名=高洋|表字=子进|时期=南北朝|生=526年|卒=559年|在位=550年~559年|注=十年十月高殷即位沿用',
		'/废帝/干明|560/2/12~|474|君主=济南王|君主名=高殷|表字=正道|生=545年|卒=561年|在位=559年~560年',
		'/孝昭帝/皇建|560/9/6~|8=36c 59k|庙号=肃宗|君主名=高演|表字=延安|生=535年|卒=561年|在位=560年~561年',
		'/武成帝/太宁|561/11/23~|11=2t7g3y8|年号=大宁;泰宁|庙号=齐世祖|君主名=高湛|生=538年|卒=569年1月13日|在位=561年12月3日~565年6月8日',
		'/河清|562/5/19~|4=3ai 59h 3qu23y8|注=北史卷8: 河清元年夏四月庚寅，河、济清。以河、济清，改大宁二年为河清',
		'/后主/天统|565/5/16~|4=3f9 42y 4ofa59l 47p|君主=温国公|君主名=高纬|表字=仁纲|生=556年5月29日|卒=北周武帝建德六年冬十月诛温公高纬|在位=565年6月8日~577年2月4日',
		'/武平|570/1/22~|3mmq47e 4oiz59m 505 3ql447m',
		'/隆化|577/1/17~577/2/4|/12/13=47m 4qo|注=北齐书卷8 北齐后主武平七年十二月丁巳，大赦，改武平七年为隆化元年。',
		'/安德王/德昌|577/1/18~577/1/21|/12/14=47m|注=北齐书卷8 北齐后主武平七年十二月戊午，延宗从众议即皇帝位于晋阳，改隆化为德昌元年。...辛酉，延宗与周师战于晋阳，大败，为周师所虏。',
		'/幼主/承光|577/2/4~4/3|59m|君主名=高恒|生=北齐书卷8 武平元年六月生于邺|卒=577或578年|注=北齐书卷8 武平元年十月立为皇太子...隆化二年春正月乙亥，即皇帝位，时八岁，改元为承光元年',
		// 北齐统治地区其他势力的年号
		'/范阳王/武平|577/2/4~579/2/11|8/=59m 4g4k|历法=天保历|君主名=高绍义|注=北齐书卷12 高宝宁在营州，表上尊号，绍义遂即皇帝位，称武平元年。《廿二史考异》则认为应是用后主高纬年号，作武平九年。认为后主在武平八年失国，高绍义投奔突厥，次年称帝仍用武平年号，并不应该算作是改元。',
		// 1963年北京怀柔县出土北齐武平二年墓磗有磗文「安太二年」字样，但是这个年号不见于史籍，仍然有待于进一步考证

		'北周/孝闵帝|557/1/16~|12=35s 59c|君主=孝愍帝|君主名=宇文觉|表字=陀罗尼|讳=觉|时期=南北朝|生=542年|卒=557年|在位=557年',
		'/明帝|557/10/9~|9=362 579 3qbp|庙号=世祖|君主名=宇文毓|讳=毓|生=534年|卒=560年|在位=557年~560年',
		'/=/武成|559/9/18~|8=36d 47o|注=武成二年四月北周武帝宇文邕即位沿用。',
		'/武帝/保定|561/2/1~|59m 4mg1591 3qu147o|庙号=周高祖|君主名=宇文邕|表字=弥罗突|生=543年|卒=宣政元年六月丁酉|在位=560年5月31日~578年6月21日',
		'/天和|566/2/6~|59m 3qug505 47e 4ojo59m 4qo',
		'/建德|572/3/30~|3=3f9 3qkx47m 4oka3oq 591 3y8',
		'/宣政|578/3/24~|3=31hy',
		'/宣帝/大成|579/2/12~|35s|君主名=宇文赟|表字=干伯|生=武成元年|卒=大象二年五月己酉|在位=宣政元年六月戊戌~579年',
		'/静帝/大象|579/3/14~|2=47m 59m|君主名=宇文阐;宇文衍|生=建德二年六月壬子|卒=开皇元年五月壬申（《隋书》作五月辛未，相差一天）|在位=大象元年二月辛巳~581年|注=原名宇文衍',
		'/大定|581/1/21~2/19|35s|注=历时数月',

		// 魏晋南北朝,三国两晋南北朝: 其他国

		'西梁/宣帝/大定|555/2/7~|:中国|疑|庙号=中宗|君主名=萧詧|表字=理孙|朝代=后梁;南朝梁|据=时间规范资料库|时期=南北朝|生=519年|卒=562年|在位=555年~562年',
		'/孝明帝/天保|562/3/21~|:中国|疑|庙号=世宗|君主名=萧岿|表字=仁远|生=542年|卒=585年|在位=562年~585年|注=二十四年五月萧琮即位沿用',
		'/莒公/广运|585/6/3~587/10/7|5=:中国|疑|君主名=萧琮|表字=温文|君主=后主|在位=585年~587年',

		'隋/文帝/开皇|581/2/20~|2=3qub579 3qsc505 46i 4oiw59m 505 3psk47m 4okc3oq 579 3qsa47p 3oq 4oit59m 505 3qkx|庙号=隋高祖|君主名=杨坚|生=541年7月21日|卒=604年8月13日|在位=581年3月4日~604年8月13日|时期=隋唐',
		'/仁寿|601/2/8~|47m 4oka3oq 591|注=四年七月隋炀帝即位沿用',
		'/炀帝/大业|605/1/25~|3qs747p 3oq 4o0z59h 3quj47p 46i 4ofd59m 47p 3psl47c|君主名=杨广;杨英|生=569年|卒=618年4月11日|在位=604年8月21日~618年4月11日|注=605年—618年三月。《隋书》、《北史》等只记载到大业十三年，而《资治通鉴》则只记载到十二年。赵翼则考证李渊虽然立杨侑为帝，改元义宁，但是隋炀帝仍在，大业年号并没有废',
		'/恭帝/义宁|617/12/4~|11=35u 54w|君主名=杨侑|生=605年|卒=唐高祖武德二年八月丁酉 (619年9月14日)|在位=617年12月18日~618年6月12日',
		'/皇泰主/皇泰|618/5/30~|5=3ai 3g9e|君主名=杨侗|生=604年|卒=619年7月|在位=618年6月22日~619年5月23日|注=杨侗原本封为越王，驻守东都洛阳。618年4月11日，隋炀帝被弑，消息传到东都后，皇泰元年五月二十四戊辰日（618年6月22日），王世充与元文都、卢楚等拥立杨侗为皇帝，史称皇泰主。',
		'/大郑皇帝/开明|619/5/25~621/6/24|/4/7=3g9e4a2 3b1m|君主名=王世充|国号=郑国|卒=621年|在位=619年~621年|注=皇泰二年四月初五癸卯日（619年5月23日），王世充废杨侗，将杨侗囚于含凉殿，两天后，王世充自称「大郑皇帝」，建元「开明」，改封杨侗为潞国公',

		// 隋末农民起义时各割据势力年号
		'/向海明/白鸟|614/1/16~2/14|:隋|疑|注=被隋将杨义臣所杀。',
		'/皇王/大世|614/6/13~7/11|:隋|疑|君主名=刘迦论|注=被隋将屈突通败于上郡，击斩。',
		'/元兴王/始兴|617/1/13~2/10|:隋|疑|君主名=操师乞|年号=天成|注=十二月癸未，自号元兴王。',
		'/长乐王/丁丑|617/2/11~|:中国|疑|君主名=窦建德|注=隋大业十三年正月在乐寿（今河北沧州献县）称长乐王',
		'/夏王/五凤|618/12/19~621/6/24|:中国|疑|君主名=窦建德|注=唐高祖武德元年冬至在乐寿称夏王',
		'/魏公/永平|617/3/13~619/1/20|:中国|疑|君主名=李密|君主字=玄邃;法主|生=582年|卒=619年1月20日',
		'/永乐王/正平|617/4/11~618/8/25|:中国|疑|君主名=郭子和|君主=屋利设;金河郡公;郕国公|年号=丑平',
		'/曹武彻/通圣|618/1/12~1/31|:隋|疑|君主名=曹武彻|注=隋恭帝义宁元年十二月丁亥，曹武彻举兵反隋，建元通圣。不久，被梁王萧铣所灭。',
		//
		'朱楚/楚帝/昌达|615/12/26~619/4/19|:隋|疑|时期=隋唐|君主名=朱粲|注=621年，唐王李世民攻灭王世充，朱粲被杀于洛水。',
		'林楚/楚帝/太平|617/1/13~622/12/7|:中国|疑|时期=隋唐|年号=延康;天成|君主=南越王|君主名=林士弘|注=病亡',
		'刘汉/定杨可汗/天兴|617/4/11~620/6/5|:中国|疑|时期=隋唐|君主名=刘武周|生=582年|卒=622年',
		'梁国/梁皇帝|617/4/11~|:中国|疑|时期=隋唐|君主名=梁师都|君主=大度毗伽可汗;解事天子',
		'/=/永隆|618/2/1~628/6/6|:中国|疑|注=据《资治通鉴卷183》，梁师都建元称帝在617年三月；但《上柱国杞国公总管梁明达志》首句即「永隆二年岁次己卯十一月丙寅朔七日壬申」，故永隆元年当为618年。',
		'薛秦/武帝/秦兴|617/5/11~618/12/21|:中国|疑|时期=隋唐|君主名=薛举|君主=西秦霸王|注=年号误作泰兴',
		'萧梁/萧铣/鸣凤|617/5/11~621/11/18|:中国|疑|时期=隋唐|君主名=萧铣|年号=凤鸣|生=583年|卒=621年',
		'李凉/河西大凉王/安乐|617/8/7~|:中国|疑|时期=隋唐|君主名=李轨|卒=619年|注=《旧唐书》将李轨建元一事记在617年七月李轨自称「河西大凉王」之时。《新唐书》和《资治通鉴》则记在618年十一月李轨自称凉帝之时。出土墓志《刘和墓志》则称志主刘和下葬于「安乐元年岁次丁丑九月己酉朔廿四日癸酉」，可知应以《旧唐书》记载为准。',
		'/凉帝/=|618/11/23~619/7/16|:中国|疑|君主名=李轨|卒=619年|注=十一月，李轨占河西（今甘肃河西走廊）五郡之地，改称凉帝',

		'唐/高祖/武德|618/5/30~|5=3ai 3g9e4a2 3b1m445 3oq 4o1359h 49u|谥=神尧大圣光孝皇帝|君主名=李渊|表字=叔德|生=566年4月8日|卒=635年6月25日|在位=618年6月18日~626年9月4日|时期=隋唐',
		'/太宗/贞观|627/1/23~|4soz5es 3rkc4a2 47p 3mmw46i 5d1 3sr84a0 5as 3t6q52s 4g4q579 47e 4sgm5e9 591 3qtv47p 3mn046i|谥=文武大圣大广孝皇帝|君主名=李世民|庙号=太宗|生=598年1月28日 (599年1月23日) (隋文帝开皇十八年戊午马年十二月二十二日 598年1月28日)|卒=649年7月10日 (唐太宗贞观 (唐太宗)) (649年7月10日)|在位=626年9月4日~649年7月10日',
		'/高宗/永徽|650/2/7~|59l 3quh505 46i 4oit59m|谥=天皇大圣大弘孝皇帝|君主名=李治|表字=为善|生=628年7月21日 (《旧唐书·太宗本纪》记载：贞观二年，“六月庚寅，皇子治生。”贞观二年六月十五庚寅日，用万年历换算为公历则是628年7月21日。)|卒=683年12月27日|在位=649年7月15日~683年12月27日',
		'/显庆|656/2/1~|505 3psh47m 4oka3oq 4qo',
		'/龙朔|661/4/5~|3=3md 3qs747p',
		'/麟德|664/2/2~|3oq 4mg3',
		// 干封一年至开元七年照中国史历表朔闰订正举隅一文更改
		'/干封|666/2/10~|48a 3mws3f9',
		'/总章|668/4/17~|3=3f9 46h 4rkp',
		'/咸亨|670/3/27~|3=4rkp5e0 5uw 4pl15as',
		'/上元|674/9/6~|8=5as 50q 4g4j',
		'/仪凤|676/12/11~|11=4g4j4es 43kq4gi',
		'/调露|679/7/13~|6=4gi 5e8',
		'/永隆|680/8/30~|8=5e8 57h3',
		'/开耀|681/10/17~|9=57h34a1',
		'/永淳|682/3/15~|2=4a1 3pw',
		'/弘道|683/12/24~|12=3pw',
		'/中宗/嗣圣|684/1/23~|4qo|谥=大和大圣大昭孝皇帝|君主名=李哲;李显|生=656年11月26日|卒=710年7月3日|在位=684年1月3日~684年2月26日  705年2月23日~710年7月3日',
		'/睿宗/文明|684/2/21~|2=38cl|谥=元贞大圣大兴孝皇帝|君主名=李旦;李旭轮;李轮|生=662年6月22日|卒=716年7月13日|在位=684年2月27日~690年10月16日  710年7月25日~712年9月8日|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 唐中宗嗣圣元年二月戊午，中宗为武太后所废，己未立睿宗，同日改元文明。',
		'/武后/光宅|684/10/14~|9=35x|君主名=武曌|君主=则天皇帝;武照;武则天|谥=则天顺圣皇后|政权=周;周唐|生=624年2月17日|卒=705年12月16日|君主性别=女|在位=690年10月16日~705年2月22日|注=文明元年九月，武则天颁布《改元光宅赦文》，迁都洛阳；大赦九月五日昧爽之前，大辟以下罪犯。',
		'/垂拱|685/2/9~|42y 58z 3qs14gy|注=光宅行用仅四月。平息李敬业叛乱后，武则天以《尚书 武成》「惇信明义，崇德报功，垂拱而天下治」，改元「垂拱」。',
		'/永昌|689/1/27~|4snd',
		'/载初|689/12/18~|5aw|岁首=11|月名=正;腊|注=永昌元年十一月初一庚辰（689年12月18日），改元载初。用周历子正，以十一月为正月，十二月为腊月，来岁正月为一月。',
		'/天授|690/10/8~|11=35t 3fw 4u8|国号=武周|岁首=11|月名=正;腊|注=载初元年九月初九壬午（690年10月16日），改国号为周，改元天授。',
		'/如意|692/4/22~11/13|6=2uh3|岁首=11|月名=正;腊|注=天授三年四月初一丙申（692年4月22日），改元如意。',
		'/长寿|692/10/15~694/6/27|11=35s 505 468|岁首=11|月名=正;腊|注=如意元年九月初九庚子（692年10月23日），改元长寿。',
		'/延载|694/5/30~|7=36y 4qo|岁首=11|月名=正;腊|注=长寿三年五月十一甲午（694年6月9日），改元延载。',
		'/证圣|694/11/23~695/11/11|4of8|岁首=11|月名=正;腊|注=证圣元年正月初一辛巳（694年11月23日），改元证圣。按《旧唐书》载，延载二年一月改元：「证圣元年春一月，上加尊号曰慈氏越古金轮圣神皇帝，大赦天下，改元。」',
		'/天册万岁|695/10/14~696/2/8|11=4of85e1|岁首=11|月名=正;腊|注=证圣元年九月初九甲寅（695年10月22日），改元天册万岁。',
		'/万岁登封|696/1/10~5/6|2=5e1|岁首=11|月名=正;腊|注=天册万岁二年腊月十一甲申（696年1月20日），改元万岁登封。',
		'/万岁通天|696/4/7~697/10/20|5=5e1 4a0|岁首=11|月名=正;腊|注=万岁登封元年三月十六丁巳（696年4月22日），改元万岁通天。',
		'/神功|697/9/21~|11=2t58|岁首=11|月名=正;腊|注=万岁通天二年九月初九壬寅（697年9月29日），改元神功。',
		'/圣历|697/12/20~700/6/20|5uy 3q1 325l|岁首=11|月名=正;腊|注=圣历元年正月初一甲子（697年12月20日），改元圣历。',
		'/久视|700/5/23~701/3/13|5=3t6v4qo|注=圣历三年五月初五癸丑（700年5月27日），改元久视。久视元年十月甲寅，废止从载初元年开始的子正，重新恢复寅正。资治通鉴/卷207 甲寅，制复以正月为十一月，一月为正月，赦天下。',
		'/大足|701/2/13~12/3|52s|注=久视二年正月初三丁丑（701年2月15日），改元大足。',
		'/长安|701/11/5~705/2/27|10=52s 4za 3pt04zu 4qo|注=大足元年十月廿二辛酉（701年11月26日），改元长安。',
		'/神龙|705/1/30~2/27|5s9',
		'/中宗/=|705/1/30~|5s9 3z4h4i0|注=神龙元年正月廿五丙午（705年2月23日），武则天退位，唐中宗复辟。神龙元年二月中宗复国号唐。',
		'/景龙|707/10/1~710/7/30|9=4i0 4pzd5as 50r|注=神龙三年九月初五庚子（707年10月5日），改元景龙。景龙4年6月甲申改元唐隆。',
		'/殇帝/唐隆|710/7/2~8/28|6=50r|年号=唐元;唐兴;唐安|君主=少帝|君主名=李重茂|生=695年|卒=714年|在位=710年7月8日~710年7月25日|注=景龙4年6月甲申改元唐隆，7月己巳改元景云。|注=唐玄宗李隆基执政期的开元、天宝年间，因避讳而改称唐元、唐兴、唐安',
		'/睿宗/景云|710/7/2~|6=50r 2xly|生=662年6月22日|卒=716年7月13日|在位=684年2月27日~690年10月16日  710年7月25日~712年9月8日|注=景龙4年/唐隆1年/景云1年7月己巳改元景云。',
		'/太极|712/2/12~|54w|注=景云三年正月己丑改元为太极',
		'/延和|712/6/9~|5=37k|注=太极元年五月辛未改元为延和',
		'/玄宗/先天|712/9/6~|8=36d 4ei|谥=至道大圣大明孝皇帝|君主名=李隆基|生=685年9月8日|卒=762年5月3日|在位=712年9月8日~756年8月12日|注=延和元年八月辛未改元为先天|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 睿宗延和元年八月庚子，睿宗传位于皇太子玄宗，同日改元先天。',
		'/开元|713/12/22~|12=4ei 4sde5e1 3sws4ia 3tm 3a93436 579 3ql14gi 4sp84ma 4aa 3b5548a 47p 3psm47d 59g 4t4z5uw 4pln3px 3fe 4f54579 47e 3z4k|注=先天2年12月(唐玄宗开元元年十二月)庚寅朔改元为开元|注=唐许王李素节之子李琬、李琎墓志合考: 唐历开元六年十二月朔日确为庚申，而辛酉日为初二。',
		'/天宝|742/2/10~756/7/31|4i1 3u0 4ihe3p1 31p63oq 579 3qs649d 4i9 3swz4a2 3b1n505 41s|年名=载|注=三年正月朔改「年」为「载」',
		//
		'/肃宗/至德|756/8/1~|7=36y 4o144qo|谥=文明武德大圣大宣孝皇帝|君主名=李亨;李嗣升;李浚;李玙|年名=载|生=711年|卒=762年5月19日|在位=756年8月12日~762年5月19日|注=称「年」为「载」|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 玄宗天宝十五载七月甲子，肃宗自立于灵武。同日改元至德。',
		'/乾元|758/3/14~|2=3oi 5uq 4090|年名=载|注=元年二月复载为年',
		'/上元|760/5/20~|闰4=40905ap',
		'/=/|761/12/2~762/6/26|50a|岁首=11|月名=建子;建丑;建寅;建卯;建辰;建巳;建午;建未;建申;建酉;建戌;建亥|注=参见:关于神会和尚生卒年代的改定|注=去上元年号大赦文: 其年但号元年，去上元之号，其以今年十一月为天正岁首，使建丑建寅，每月以所建为数。|注=唐肃宗建巳月(四月)十六日诏书:元年宜改为『宝应』，建巳月改为四月，余月并依常数，仍依旧以正月初一日为岁首。',
		'/宝应|762/4/29~5/27|4=48a|注=元年四月十五日改元，并恢复寅正。',
		'/代宗/=|762/4/29~|4=48a 3mw1|谥=睿文孝武皇帝|君主名=李豫;李俶|生=726年11月11日|卒=779年6月10日|在位=762年5月18日~779年6月10日|注=宝应元年四月十五日改元，并恢复寅正。四月二十日唐代宗即位沿用。',
		'/广德|763/8/24~|/7/11=3mw1 47p 3mmy47e 5dx|注=七月十一日，代宗下诏赦免天下，改年号|注=763年十月，吐蕃集中约二十万军队东进，唐代宗出奔陕州。十月九日，吐蕃军直入长安，占领长安十五天，唐朝叛将高晖和吐蕃大将马重英立广武王李承宏为皇帝。新旧《唐书》及《通鉴》记载曾改年号，名称不明。十月二十一日吐蕃军主动撤出长安|注=当时河西走廊被吐蕃占领，唐朝西域与中原隔绝，西域将士不知道唐朝已改元，仍继续使用广德年号，有文物显示他们至少使用该年号到「广德四年」。',
		'/永泰|765/1/26~|3mmy47e',
		'/大历|766/12/7~|11=47e 5dx 3st24aw 5aw 4igz59o 4g573md 4ei 55485e9 4a1 3bet',
		'/德宗/建中|780/2/11~|5ex 3p0 4mhd3o5|谥=神武孝文皇帝|君主名=李适|生=742年5月27日|卒=805年2月25日|在位=779年~805年',
		'/兴元|784/1/27~|4nyy',
		'/贞元|785/2/14~|59e 5uq 3twl4ia 48a 3a9046l 3mik479 59g 4t545go 5as 3rd150q 505 3psh47d 4sgq5e9 49s',
		'/顺宗/永贞|805/8/28~806/2/10|8=360 4pli|谥=至德宏道大圣大安孝皇帝|君主名=李诵|生=761年|卒=806年2月11日|在位=805年|注=五百家注昌黎文集 外集卷十: 顺宗实录卷五 八月庚子，诏曰：「...宜令皇太子即皇帝位，朕称太上皇，居兴庆宫，制敕称诰。...」永贞元年八月辛丑，太上皇居兴庆宫，诰曰：「...宜以今月九日，册皇帝于宣政殿...宜改贞元二十一年为永贞元年...」...永贞二年正月景戌朔，（戌，史作寅，下同。）太上皇于兴庆宫受朝贺...元和元年正月甲申，太上皇崩于兴庆宫咸宁殿',
		'/宪宗/元和|806/1/24~821/2/5|4pli3px 3fe 4g4i577 3qjw61d 4lt 3g9k489 3p1 38et42y 591 3qs1|谥=昭文章武大圣至神孝皇帝|君主名=李纯;李淳|注=原名李淳',
		'/穆宗/永新|820/3/22~|/2/5=3qs1|谥=睿圣文惠孝皇帝|君主名=李恒;李宥|生=唐德宗贞元11年7月6日生于大明宫之别殿|卒=824年|在位=820年~824年|注=黄永年.1992-6.唐元和后期党争与宪宗之死: 元和十五年正月二十七日庚子宪宗被杀，二十八日辛丑穆宗即位，以事属政局特殊变动，在当年二月五日丁丑即提前改元永新，但稍后感到如此做法易引起人们对帝位交替产生疑问，于巩固统治转形不利，乃又取消此永新年号而按正常办法在第二年正月三日辛丑改元长庆，同时将元和十五年二月五日丁丑赦文中改元永新之文字删除，其他文字中有永新年号者也一律窜易或毁去。',
		'/长庆|821/2/6~|49u 40965as 48a',
		'/敬宗/宝历|825/1/23~|3a93445 35s|谥=睿武圣愍孝皇帝|君主名=李湛|生=809年7月22日|卒=827年1月2日|在位=824年~827年1月2日',
		'/文宗/大和|827/3/2~|2=42y 4o0z5d1 3st84a0 5as 3rlz52k 505|谥=元圣昭献孝皇帝|君主名=李昂;李涵|年号=太和',
		'/开成|836/1/22~|3ql147e 5e1 3swh4a0',
		'/武宗/会昌|841/1/27~|4q3d3qi 3os 4g5j591 576|谥=至道昭肃孝皇帝|君主名=李炎;李瀍|生=814年7月1日|卒=846年4月22日|在位=840年2月20日~846年4月22日',
		'/宣宗/大中|847/1/21~|4sgz5e9 3twr4b6 3qi 3a93431 42t 4nys59g 5eq 3t4y4b8 3qyy|谥=元圣至明成武献文睿智章仁神聪懿道大孝皇帝|君主名=李忱;李怡|生=810年7月27日|卒=859年9月10日|在位=846年4月22日~859年9月10日',
		'/懿宗/咸通|860/12/16~|11=35s 50a 46l 3mly47d 59g 4upv5go 4ja43p0 50a 4g4o579 47d 4pac|谥=昭圣恭惠孝皇帝|君主名=李漼;李温|生=833年12月28日|卒=873年8月15日  唐文宗大和七年十一月十四|在位=859年~873年8月15日',
		'/僖宗/干符|874/12/13~|11=35u 4i9 3vt 3a8y3p1 38ey|谥=惠圣恭定孝皇帝|君主名=李儇;李俨|生=862年|卒=888年|在位=873年~888年',
		'/广明|880/2/14~|42y 58g',
		'/中和|881/7/30~|7=36d 3qs749u 5aq 3y8',
		'/光启|885/3/20~|3=322r48a 3b1n35s',
		'/文德|888/3/17~|2=47p',
		'/昭宗/龙纪|889/2/4~|42y|谥=圣穆景文孝皇帝|君主名=李晔;李杰;李敏',
		'/大顺|890/1/25~|4ofd5dx',
		'/景福|892/2/2~|4h0 4pl1',
		'/干宁|894/2/10~|5es 48k 3npd505 468',
		'/光化|898/8/21~|8=2tei4zu 5s9 3y8',
		'/天复|901/4/22~|4=33me4aw 5bc 4xs',
		'/天祐|904/5/18~|闰4=2vwk|注=闰四月乙巳改元。',
		'/哀帝/=|904/9/12~907/5/14|8=361 3os 4mho3k0|君主名=李柷;李祚|生=892年10月27日|卒=908年3月26日|在位=904年9月27日~907年5月12日|注=原名祚|君主=昭宣帝|谥=昭宣光烈孝皇帝',

		// 晚唐/唐朝统治地区其他势力的年号
		// 安史之乱
		'燕/光烈帝/圣武|756/2/5~758/2/12|:唐|君主名=安禄山|谥=光烈皇帝|时期=隋唐|朝代=唐|注=757年正月，安庆绪杀父自立，对外宣称安禄山退位。《新唐书》称安庆绪当即改元载初，但《旧唐书》和《资治通鉴》均不载该年号。同年十月，安庆绪退守邺城。《新唐书》称改元「天和」，《资治通鉴》称改元「天成」。根据出土的墓志显示，「圣武」年号最迟用至757年十月。《大燕故程府君墓志铭并序》（程思泰墓志）则称，志主程思泰在「天成元年岁次戊戌九月庚午朔三日壬申」迁葬邺县。则天成元年当是758年。疑《资治通鉴》漏载「改明年元」的「明年」二字。圣武年号应行用至该年年底。',
		'/哀帝/载初|757/1/30~|:唐|君主名=安庆绪|谥=晋剌王|注=该年号仅见于《新唐书·安庆绪传》，《旧唐书》和《资治通鉴》均不载。根据出土墓志可知，安庆绪并无此年号。|注=安禄山事迹: 十五载正月乙卯朔，禄山遣东都耆老缁黄劝进，遂伪即帝位，国曰大燕，自称雄武皇帝...二年正月五日，遂相与谋杀禄山...禄山以天宝十四年乙未十一月反，...乾元二年己亥为史思明所杀',
		'/天成|758/2/13~759/5/1|:唐|年号=天和;至成|注=《资治通鉴》和《新唐书》将改元系于757年十月。《大燕故程府君墓志铭并序》（程思泰墓志）则称志主程思泰于「天成元年岁次戊戌九月庚午朔三日壬申」迁葬邺县，则天成元年当是758年。758年，安庆绪据守邺城，邺县一带是安氏叛军的领地，年号应该不会有错。今从之。',
		'/昭武帝/应天|759/2/3~|:唐|君主名=史思明',
		'/顺天|759/5/2~|:唐',
		'/末帝/显圣|761/4/10~763/2/17|:唐|君主名=史朝义',
		// TODO:
		// https://zh.wikipedia.org/wiki/中国年号列表#唐朝

		'吐蕃/赤祖德赞/彝泰|815/2/13~839/1/18|:唐|疑|国号=大蕃|君主名=ཁྲི་རལ་པ་ཅན།;弃足德赞;可黎可足|年号=སྐྱིད་རྟག།|注=见于拉萨《长庆唐蕃会盟碑》，末书唐长庆及吐蕃彝泰纪元，是目前可考的唯一一个吐蕃的年号。大蕃彝泰九年，大唐长庆三年二月十四日，即阴水兔年春二月十四日',

		// 五代十国: 五代

		'后梁/太祖/开平|907/5/15~|4=39x 58y 55bc5e9 45c|君主=神武元圣孝皇帝|君主名=朱晃;朱温;朱全忠|时期=五代十国|生=852年12月9日|卒=912年7月18日|在位=907年~912年|注=四月二十二日大赦，改元「开平」，国号「大梁」',
		'/干化|911/5/31~|5=3bl 3bj93u2',
		'/郢王/凤历|913/3/1~|/21=3u2|年号=凤𠪱;凤历|君主名=朱友珪|表字=遥喜|卒=913年|在位=912年~913年|注=自乾隆年间开始避讳「历」字，清代刊印的古籍改用「𠪱」字代替。|注=资治通鉴 卷第二百六十八. 干化三年春正月丁巳晋周德威拔燕顺州。癸亥郢王友珪朝享太庙。甲子祀圆丘大赦改元凤𠪱。...二月...庚寅旦，袁象先等帅禁兵数千人突入宫中。友珪闻变，与妻张氏及冯廷谔趋北垣楼下，将逾城，自度不免，令廷谔先杀妻，次杀己，廷谔亦自刭。',
		'/末帝/干化|913/3/28~|3/2/18=3u2 3ot 37wy|君主名=朱友贞;朱瑱;朱锽|生=888年10月24日|卒=923年11月18日|在位=913年~923年|注=资治通鉴 卷268;太祖神武元圣孝皇帝下干化三年...二月...庚寅旦...乃即帝位于大梁，复称干化三年...丙申',
		'/贞明|915/12/17~|/11/9=37wy42t 4nyy59g 5gi 3txi45c|注=资治通鉴 卷269;十一月乙丑改元',
		'/龙德|921/6/9~|5=3bo 48a 3y8',

		'后唐/庄宗/同光|923/4/19~|4=2xlw4z1 3prw3y8|君主=光圣神闵孝皇帝|君主名=李存勗;朱邪存勗;李存勖|时期=五代十国|生=885年12月2日|卒=926年5月15日|在位=923年5月13日~926年5月15日',
		'/明宗/天成|926/5/15~|4=3ex 59g 4uq05go 4qo|君主=圣德和武钦孝皇帝|君主名=李亶;李嗣源|生=867年10月10日|卒=933年12月15日|在位=926年6月3日~933年12月15日',
		'/长兴|930/3/3~|2=3pw 4gnp3fu 505',
		'/闵帝/应顺|934/1/18~|3oqp|君主=闵宗|君主名=李从厚|生=914年|卒=934年|在位=933年~934年',
		'/废帝/清泰|934/5/16~|4=385 47d 5ag|君主名=李从珂;王从珂|君主=末帝|生=885年2月11日|卒=937年1月11日|在位=934年~937年',

		'后晋/高祖/天福|936/11/17~|11=2t6j3tf 3hl 3b1j3px 3my 4lxf|君主=圣文章武明德孝皇帝|君主名=石敬瑭|时期=五代十国|生=892年|卒=942年|在位=936年~942年|注=资治通鉴考异卷30：二年正月乙卯，日有食之。实录：「正月甲寅朔，乙卯日食。」十国纪年：「蜀乙卯朔日食。」盖晋人避三朝日食改历耳。|注=资治通鉴/卷280: 十一月...己亥，制改长兴七年为天福元年',
		'/出帝/天福|942/7/16~|7/6/=36y 591 48w|君主名=石重贵|生=914年|卒=974年|在位=942年~946年',
		'/开运|944/7/23~|7=2tlo4gy 5ea 35s',

		'后汉/高祖/天福|947/2/24~|12/2/=3t53|君主=睿文圣武昭肃孝皇帝|君主名=刘暠;刘知远|时期=五代十国',
		'/干祐|948/2/13~|35s|注=干祐元年二月后汉隐帝刘承祐即位沿用，一直到后汉灭亡。',
		'/隐帝/=|948/3/14~|2=4aa 449 3mmt|君主名=刘承祐|生=931年|卒=950年|在位=948年~950年',

		'后周/太祖/广顺|951/2/9~|42y 59h 3z2p|君主=圣神恭肃文武孝皇帝|君主名=郭威|表字=文仲|时期=五代十国|生=904年|卒=954年|在位=951年~954年',
		'/显德|954/2/6~3/7|35s',
		'/世宗/=|954/2/6~|4h0 4sqx5es 4ac 3qvb4xs|君主=睿武孝文皇帝|君主名=柴荣|生=921年10月27日|卒=959年7月27日|在位=954年2月26日~959年7月27日',
		'/恭帝/=|959/7/9~960/1/30|6/6/=385|君主=睿武孝文皇帝|君主名=柴宗训|生=953年|卒=973年|在位=959年~960年|注=显德七年（960年）正月元旦陈桥兵变，同年赵匡胤建立宋朝，改元「建隆」。',

		// |时期=隋唐
		'渤海/高王|697/12/20~|:唐|疑|谥=高王;고왕|君主名=大祚荣;대조영|据=Wikipedia;辽阳 金毓黻《渤海国志长编》卷五 年表第一 渤海国志三|卒=渤海国志长编第三册: 渤海国高王二十二年春三月丁酉王薨遣使赴唐告哀|年号=천통|注=乞乞仲象世子. 《桓檀古记》第七 大震国本纪: 大祚荣年号天统。大仲象年号重光 同为无据',
		// 应付久视元年十月甲寅恢复寅正。
		'/=|700/5/23~|3/5/=:唐|疑',
		'/武王/仁安|720/2/13~|:唐|疑|谥=武王;무왕|君主名=大武艺;대무예|卒=渤海国志长编第三册: 渤海国武王仁安十八年八月至 玄宗授以官又作书与王赍还王薨遣使赴唐告哀|年号=인안',
		'/文王/大兴|738/1/25~|:唐|疑|谥=文王;문왕|君主名=大钦茂;대흠무|年号=대흥|卒=渤海国志长编第三册: 渤海国文王大兴五十七年(成王中兴元年)春王薨',
		'=/废王|794/3/6~794/7/31|2=:唐|疑|谥=废王;폐왕|君主名=大元义;대원의|注=渤海国志长编第三册: 元义嗣位二月壬戌遣王子清允等三十余人朝唐授官有差 元义立数月遇下猜虐国人杀之',
		'/成王/中兴|794/2/5~|:唐|疑|谥=成王;성왕|君主名=大华玙;대화여|年号=중흥|卒=渤海国志长编第三册: 中兴元年冬成王薨',
		'/康王/正历|795/1/26~|:唐|疑|谥=康王;강왕|君主名=大嵩璘;대숭린|年号=정력|卒=渤海国志长编第三册: 渤海国康王正历十四年康王薨',
		'/定王/永德|810/2/8~|:唐|疑|谥=定王;정왕|君主名=大元瑜;대원유|年号=영덕|卒=渤海国志长编第三册: 渤海定王永德三年春正月癸酉使至唐宪宗御殿(麟德殿)延见赐宴甲申赐官告及衣(一袭)王薨',
		'/僖王/朱雀|813/2/5~818/4/8|:唐|疑|谥=僖王;희왕|君主名=大言义;대언의|年号=주작|卒=渤海国志长编第三册: 渤海僖王朱雀五年春二月遣使朝唐王薨',
		'/简王/太始|818/2/9~|:唐|疑|谥=简王;간왕|君主名=大明忠;대명충|年号=태시|卒=渤海国志长编第三册: 渤海简王太始元年春正月改元二月王薨',
		'/宣王/建兴|819/1/30~|:唐|疑|谥=宣王;선왕|君主名=大仁秀;대인수|年号=건흥|卒=渤海国志长编第三册: 建兴十二年宣王薨',
		'/大彝震/咸和|831/2/16~|:唐|疑|君主名=대이진|年号=함화|注=渤海国志长编第三册: 史失其谥',
		'=/大虔晃|858/1/19~|:唐|疑|君主名=大虔晃;대건황|注=渤海国志长编第三册: 史失其年号. 十四年王薨史失其谥. 《桓檀古记·太白逸史》年号大定(无据)',
		'/大玄锡|872/2/13~|:唐|疑|君主名=大玄锡;대현석|注=渤海国志长编第三册: 史失其年号. 二十二年王薨史失其谥. 《桓檀古记·太白逸史》年号天福(无据)',
		'/大玮瑎|894/2/10~|:唐|疑|君主名=大玮瑎;대위해|注=渤海国志长编第三册: 史失其年号. 十三年...是年王薨史失其谥',
		'/末王|907/2/15~926/9/16|:中国|疑|君主名=大諲譔;대인선|注=渤海国志长编第三册: 史失其年号. 渤海大諲譔二十年...八月辛卯长岭府陷于契丹 王弟率兵攻扶余城不克 保众而退 于是凡百有三城皆入于契丹 渤海国亡. Wikipedia: 926年3月6日，契丹国灭渤海国，渤海王大諲譔被俘虏。934年，世子大光显率部民数万流亡高丽. 《桓檀古记·太白逸史》年号清泰(无据)',

		// 五代十国: 十国

		'杨吴/太祖/天复|902/4/11~|2/3/=:中国|疑|君主=吴武帝|君主名=杨行密;杨行愍|表字=化源|据=时间规范资料库|国号=南吴;弘农;淮南|时期=五代十国|生=852年|卒=905年|在位=902年~905年',
		'/天祐|904/1/21~|:中国|疑',
		'/烈宗/=|905/12/24~|2/11/26=:中国|疑|君主=景皇帝|君主名=杨渥|表字=承天|生=886年|卒=908年|在位=905年~908年',
		'/高祖/=|908/6/10~|5/5/9=:中国|疑|君主=宣帝|君主名=杨隆演;杨瀛;杨渭|表字=鸿源|生=897年|卒=920年|在位=908年~920年',
		'/武义|919/5/3~|4=:中国|疑',
		'/睿帝/=|920/7/6~937/11/10|2/6/18=:中国|疑|君主名=杨溥|谥=睿皇帝|生=900年|卒=南唐升元二年十一月辛丑|在位=920年~937年|注=《十国春秋》吴三·睿帝本纪:十一月辛丑，有使者来丹杨宫，杨溥方颂佛经于楼上，使者趋前，杨溥以香炉掷之，俄而去世，终年三十八岁。',
		'/顺义|921/3/13~|2=:中国|疑',
		'/干贞|927/12/13~|/11/17=:中国|疑',
		'/大和|929/12/30~|/11/27=:中国|疑|注=太和?',
		'/天祚|935/10/4~936/1/26|/9/4=:中国|疑',

		'南唐/烈祖/升元|937/11/11~|10=:中国|疑|年号=升元|谥=光文肃武孝高皇帝|君主名=李昪;徐知诰|表字=正伦|据=时间规范资料库|时期=五代十国|生=889年1月7日|卒=943年3月30日|在位=937年~943年|注=937年十月乙酉，杨溥让位予徐知诰，南吴亡。',
		'/元宗/保大|943/4/8~|3=:中国|疑|谥=明道崇德文宣孝皇帝|君主名=李璟;李景通;李景|表字=伯玉|生=916年|卒=961年8月12日|在位=943年~961年',
		'/中兴|958/1/23~|:中国|疑',
		'/交泰|958/3/23~|3=:中国|疑|注=957年后周派兵侵入南唐，占领了南唐淮南江北的大片土地，并长驱直入到长江一带，李璟只好向后周世宗柴荣称臣，去帝号，自称唐国主，年号由原本的交泰改为后周的显德。',
		'/显德|958/6/20~|5/6/=:中国|疑',
		'/建隆|960/2/4~|/1/5=:中国|疑',
		'/后主/=|961/8/12~|2/6/28=:中国|疑|君主=李后主|君主名=李煜;李从嘉|表字=重光|生=天祚三年|卒=太平兴国三年|在位=961年~975年|注=宋朝于963年十一月正式向南唐颁历后，南唐后主李煜才停止使用后周显德年号，开始用北宋建隆年号纪年（963年）。',
		'/干德|963/12/4~|/11/16=:中国|疑',
		'/开宝|968/12/16~976/12/23|/11/24=:中国|疑',

		'吴越/太祖/天祐|907/6/14~|4/5/=:中国|疑|据=时间规范资料库|谥=武肃王|君主名=钱镠|表字=具美;巨美|时期=五代十国|生=852年3月10日|卒=932年5月6日|在位=907年~932年',
		'/天宝|908/2/5~|:中国|疑',
		'/凤历|913/2/9~|:中国|疑',
		'/干化|913/3/28~|3/2/18=:中国|疑',
		'/贞明|915/12/17~|/11/9=:中国|疑',
		'/龙德|921/6/9~|5=:中国|疑',
		'/宝大|924/2/8~|:中国|疑',
		'/宝正|926/2/15~|:中国|疑',
		'/世宗/长兴|932/5/6~|3/3/28=:中国|疑|谥=文穆王|君主名=钱元瓘;钱传瓘|表字=明宝|生=887年|卒=941年|在位=932年~941年',
		'/应顺|934/1/18~|:中国|疑',
		'/清泰|934/5/16~|4=:中国|疑',
		'/天福|936/11/17~|11=:中国|疑',
		'/成宗/=|941/9/18~|6/8/25=:中国|疑|谥=忠献王|君主名=钱弘佐|表字=元祐|生=928年|卒=947年6月22日|在位=941年~947年',
		'/开运|944/7/23~|7=:中国|疑',
		'/忠逊王/天福|947/3/10~|12/2/15=:中国|疑|君主名=钱宏倧|表字=隆道|注=947年吴越忠逊王钱弘倧，荆南文献王高从诲、楚废王马希广（四月）再用此年号。',
		'/忠懿王/=|948/2/13~|13/=:中国|疑|君主名=钱俶;钱宏俶|表字=文德|生=929/9/29|卒=端拱元年八月二十四日|在位=948年~978年|注=干祐元年正月乙卯，钱弘俶即位于杭州吴越王宫天宠堂。',
		'/干祐|948/2/17~|/1/5=:中国|疑',
		'/广顺|951/2/13~|/1/5=:中国|疑',
		'/显德|954/2/6~|:中国|疑',
		'/建隆|960/2/4~|/1/5=:中国|疑',
		'/干德|963/12/4~|/11/16=:中国|疑',
		'/开宝|968/12/16~|/11/24=:中国|疑',
		'/太平兴国|977/1/14~978/7/7|/12/22=:中国|疑|注=太平兴国三年五月乙酉，吴越丞相崔仁冀劝钱俶上表纳土，钱俶遂当即上奏',

		'闽/太祖/开平|909/1/25~|3/=:中国|疑|君主=昭武孝皇帝|君主名=王审知|表字=信通|据=时间规范资料库|时期=五代十国|生=862年|卒=925年|在位=909年~925年',
		'/干化|911/5/31~|5=:中国|疑',
		'/贞明|915/12/17~|/11/9=:中国|疑',
		'/龙德|921/6/9~|5=:中国|疑',
		'/同光|923/4/19~|4=:中国|疑',
		'/嗣王/天成|926/2/15~|:中国|疑|君主名=王延翰|表字=子逸|卒=927年|在位=926年|注=天成元年十二月初八王延翰被王延禀抓获并斩首。',
		'/惠宗/=|927/1/7~|12=:中国|疑|君主=齐肃明孝皇帝|君主名=王璘;王延钧|卒=935年|在位=926年~935年',
		'/长兴|930/3/3~|2=:中国|疑',
		'/龙启|933/1/29~|:中国|疑',
		'/永和|935/2/6~|:中国|疑',
		'/康宗/通文|936/3/26~|3=:中国|疑|君主=神圣英睿文明广武应道大宏孝皇帝|君主名=王昶;王继鹏',
		'/景宗/永隆|939/8/30~|/闰7/13=:中国|疑|君主=睿文广武明圣元德隆道大孝皇帝|君主名=王曦;王延羲',
		'/恭懿王/天德|943/3/9~945/10/8|2=:中国|疑|君主=天德帝|君主名=王延政|谥=恭懿|卒=951年|在位=943年~945年',

		'北汉/世祖/干佑|951/2/24~|4/1/16=:中国|疑|君主=武帝|君主名=刘旻;刘崇|据=时间规范资料库|时期=五代十国|生=895年|卒=954年|在位=951年~954年|注=沿用后汉年号',
		'/睿宗/=|954/11/28~|7/11/=:中国|疑|君主=孝和帝|君主名=刘承钧|生=926年|卒=968年|在位=954年~968年|注=沿用后汉年号',
		'/天会|957/2/3~|:中国|疑',
		'/少主/=|968/7/28~|12/7/=:中国|疑|君主名=刘继恩;薛继恩|生=10世纪？|卒=968年|在位=968年',
		'/英武帝/天会|968/9/25~|12/9/=:中国|疑|君主名=刘继元;何继元|生=10世纪？|卒=992年|在位=968年~979年',
		'/广运|974/1/26~979/6/26|:中国|疑',

		'前蜀/高祖/天复|907/11/3~|7/9/25=:中国|疑|君主=神武圣文孝德明惠皇帝|君主名=王建|表字=光图|据=时间规范资料库|时期=五代十国|注=903年，唐昭宗封王建为蜀王。唐哀帝天祐四年（907年），王建不服后梁统治，建国号“蜀”，史称“前蜀”，定都成都。',
		'/武成|908/2/5~|:中国|疑',
		'/永平|911/2/2~|:中国|疑',
		'/通正|916/2/6~|:中国|疑',
		'/天汉|917/1/26~|:中国|疑',
		'/光天|918/2/14~|:中国|疑',
		'/后主/=|918/7/11~|6=:中国|疑|君主=顺正公|君主名=王衍;王宗衍|表字=化源',
		'/干德|919/2/4~|:中国|疑',
		'/咸康|925/1/27~925/12/15|:中国|疑',

		'后蜀/高祖/明德|934/5/16~|4=:中国|疑|君主=文武圣德英烈明孝皇帝|君主名=孟知祥|表字=保胤|据=时间规范资料库|国号=大蜀|时期=五代十国|生=874年6月9日|卒=934年9月7日|在位=934年|注=闰一月即位',
		'/后主/=|934/8/13~|7=:中国|疑|君主名=孟昶;孟仁赞|表字=保元|生=919年12月9日(蜀梼杌校笺)|卒=965年7月12日(蜀梼杌校笺)|在位=934年~965年',
		'/广政|938/2/2~939/1/22|:中国|疑',

		// TODO:
		// https://zh.wikipedia.org/wiki/%E4%BA%94%E4%BB%A3%E5%8D%81%E5%9B%BD#.E5.85.B6.E4.BB.96.E8.97.A9.E9.8E.AE.E5.8B.A2.E5.8A.9B
		'岐/岐王/天祐|907/5/15~925/1/26|4/=:中国|疑|时期=五代十国|君主名=李茂贞;宋文通;田彦宾|谥=忠敬王|生=856年|卒=924年|据=Wikipedia|注=Wikipedia: 晋、岐、前蜀与吴敌视后梁、依旧奉唐室年号。岐国天祐二十年（923年），后唐庄宗李存勖灭后梁，李茂贞于是在次年（924年）向后唐称臣，李存勖则将李茂贞改封秦王，具有独立性质的岐王国因此消失，数月后李茂贞去世，谥忠敬王（秦忠敬王）。子李从曮袭爵，后唐时辗转各地任职。后晋时代李从曮再任岐王，归凤翔任职，946年李从曮死亡，其子李永吉不复封岐王，岐国名实皆亡。',

		// 沿用后唐年号
		'南楚/武穆王/开平|907/5/15~|4=:中国|疑|君主=武穆公|君主名=马殷|表字=覇图|朝代=马楚|据=Wikipedia|时期=五代十国|生=852年|卒=930年12月2日|在位=907年~930年|注=Wikipedia: 后梁开平元年（907年），朱温封马殷为楚王，都于潭州（今长沙），开平四年（910年）六月加封「天策上将军」。',
		'/干化|911/5/31~|5=:中国|疑',
		'/凤历|913/3/1~|/21=:中国|疑',
		'/干化|913/3/28~|3/2/18=:中国|疑',
		'/贞明|915/12/17~|/11/9=:中国|疑',
		'/龙德|921/6/9~|5=:中国|疑',
		'/同光|923/4/19~|4=:中国|疑|据=Wikipedia|注=Wikipedia: 后唐灭后梁后，明宗天成二年（927年）六月又册封为楚国王，同年八月册封使至，马殷乃建立楚国，立宫殿、置百官，以潭州为都城，改名长沙府，使用后唐年号。',
		'/天成|926/5/15~|4=:中国|疑',
		'/长兴|930/3/3~|2=:中国|疑',
		'/马希声/=|930/12/2~|/11/10=:中国|疑|君主=衡阳王|表字=若讷|据=Wikipedia|注=长兴元年十一月十日（930年12月2日），马殷去世，时年79，遗命诸子兄弟相继。后唐明宗罢朝三天，下诏赐马殷谥号武穆王。次子马希声继其位，遵从父亲的遗命，不再称楚国，而是降低规格，恢复了节度使的称号',
		'/文昭王/=|932/9/3~|3/8=:中国|疑|君主名=马希范|表字=宝规|据=Wikipedia|生=899年|卒=947年|在位=932年~947年|注=后唐明宗清泰元年（934年），马希范被封为楚王。之后又被封为天策上将军。',
		'/应顺|934/1/18~|:中国|疑',
		'/清泰|934/5/16~|4=:中国|疑',
		'/天福|936/11/17~|11=:中国|疑',
		'/开运|944/7/23~|7=:中国|疑|注=Wikipedia: 后晋出帝石重贵的年号',
		'/废王/天福|947/5/23~|12/5=:中国|疑|据=Wikipedia|君主名=马希广|表字=德丕|据=Wikipedia|卒=950年|在位=947年~950年|注=后汉高祖天福十二年（947年），马希范去世，将领排除马希范诸弟中年龄最长的马希萼，而拥护马希广继立，后汉封马希广天策上将军、楚王',
		'/干祐|948/2/13~|:中国|疑',
		'/恭孝王/保大|951/1/24~|8/12/14=:中国|疑|据=Wikipedia|君主名=马希萼|据=Wikipedia|生=900|卒=953|在位=950年~951年|注=马希广于后汉干祐三年（950年）十二月十二日被马希萼所擒，两日后，马希萼登楚王位。保大八年至九年（950年十二月-951年十一月）用南唐元宗李璟的年号',
		'/马希崇/=|951/10/4~951/12/1|9=:中国|疑|据=Wikipedia|君主=后主|据=Wikipedia|注=马希崇率家族投降，南楚亡。',

		'荆南/武信王/同光|924/4/7~|2/3=:中国|疑|君主=楚武信王|君主名=高季兴;高季昌|表字=贻孙|朝代=南平;北楚|据=Wikipedia|时期=五代十国|生=858年|卒=929年|在位=924年~929年|注=原名高季昌|注=Wikipedia: 后唐同光二年（924年）封为南平王，建都荆州，史称「南平」。',
		'/天成|926/5/15~|4=:中国|疑',
		'/文献王/=|929/1/28~|3/12/15=:中国|疑|君主名=高从诲|表字=遵圣|谥=文献王|据=Wikipedia|生=891年|卒=948年|在位=928年~948年|注=Wikipedia: 后唐明宗李嗣源天成三年（928年）十二月十五日（929年1月28日），被后唐册封为南平王的高季兴去世，高从诲嗣位。长兴三年（932年），被封为渤海王。后唐闵帝李从厚应顺元年（934年）被改封南平王。后汉隐帝刘承祐干祐元年（948年），高从诲去世，赠尚书令，谥文献王。其子高保融继位。',
		'/长兴|930/3/3~|2=:中国|疑',
		'/应顺|934/1/18~|:中国|疑',
		'/清泰|934/5/16~|4=:中国|疑',
		'/天福|936/11/17~|11=:中国|疑',
		'/干祐|948/2/13~|:中国|疑',
		'/贞懿王/=|948/12/4~|11=:中国|疑|君主名=高保融|表字=高德长|据=Wikipedia|生=920年|卒=960年|在位=948年~960年|注=Wikipedia: 后周太祖郭威广顺元年（951年），被封为渤海郡王。显德元年（954年），再被进封为南平王。因病去世，赠太尉，谥贞懿王。其子高继冲年纪尚小，因此遗命高保勗继位。',
		'/广顺|951/2/9~|:中国|疑',
		'/显德|954/2/6~|:中国|疑',
		'/建隆|960/1/31~|:中国|疑',
		'/贞安王/=|960/8/25~|8=:中国|疑|君主=侍中|君主名=高保勗|据=Wikipedia|生=924年|卒=962年|在位=960年~962年|注=Wikipedia: 宋太祖赵匡胤建隆元年（960年），高保融因病去世，其子高继冲年纪尚小，因此遗命高保勗继位，总判内外军马事。不久，即为宋任命为荆南节度使。',
		'/德仁王/=|962/11/30~963/6/23|3/11=:中国|疑|君主=侍中|君主名=高继冲|表字=成和|据=Wikipedia|生=943年|卒=973年|在位=962年~963年|注=Wikipedia: 宋太祖赵匡胤建隆三年（962年），高保勗因病去世，遗命高继冲权判内外军马事以继其位。后来高继冲亦被宋任命为荆南节度使。建隆四年（963年），宋军讨伐张文表，假道荆南，发生荆湖之战，趁机控制南平都城江陵（今湖北江陵）城巷，高继冲只得纳地以归，南平亡。',

		'南汉/高祖/干亨|917/7/22~|7=:中国|疑|君主=天皇大帝|君主名=刘䶮;刘岩;刘陟|据=时间规范资料库|时期=五代十国|生=889年|卒=942年|在位=917年~942年|历法=崇玄历|注=张金铣《南汉历法初考》: 可能自造新历，因与中原不相往来而未载。',
		'/白龙|925/12/19~|12=:中国|疑',
		'/大有|928/3/25~|3=:中国|疑',
		'/殇帝/光天|942/5/18~|4=:中国|疑|君主名=刘玢;刘弘度|生=920年|卒=943年|在位=942年~943年',
		'/中宗/应干|943/4/8~|3=:中国|疑|君主=文武光圣明孝皇帝|君主名=刘晟;刘弘熙|生=920年|卒=958年|在位=943年~958年',
		'/干和|943/11/30~|11=:中国|疑|注=张金铣《南汉历法初考》: 清代谢启昆所编《粤西金石志》、《南汉感 报寺铜钟款文》有「 维大汉干和十六年太岁戊午闰六月庚辰朔十六日己未」之语。',
		'/后主/大宝|958/9/16~971/3/28|8=:中国|疑|君主=后主;恩赦侯|君主名=刘鋹;刘继兴|生=942年|卒=980年|在位=958年~971年|注=原名刘继兴|注=张金铣《南汉历法初考》: 《南汉干亨寺铜钟款文》载其铜钟铸造时间亦称「 维大汉大宝四年岁次辛酉九月辛酉朔二十五日」 。',

		// 宋朝;赵宋
		'北宋/太祖/建隆|960/1/31~|46i 4rkz5s9 4h4|君主=启运立极英武睿文神德圣功至明大孝皇帝|君主名=赵匡胤|朝代=宋|时期=两宋|生=927年3月21日|卒=976年11月14日|在位=960年2月4日~976年11月14日|注=[[s:宋史/卷003]] 开宝九年冬十月癸丑夕，帝崩于万岁殿...太平兴国二年四月乙卯，葬永昌陵。',
		'/干德|963/11/19~|11=2t5o4aw 5bc 4ihk3p0 578',
		'/开宝|968/11/23~|11=35u 4fv958y 5sh 400i4b5 3ep648a 3p1|年号=开寳|注=九年十月宋太宗即位沿用。',
		'/太宗/开宝|976/11/14~|9/10/20=3p1|君主=至仁应道神功圣德文武大明广孝皇帝|君主名=赵炅;赵匡义;赵光义|生=939年11月20日|卒=997年5月8日|在位=976年11月15日~997年5月8日 (:s:宋史/卷5 三月丁卯，占城国来贡。壬辰，不视朝。癸巳，追班于万岁殿，宣诏令皇太子柩前即位。是日崩，年五十九。在位二十二年，殡于殿之西阶。群臣上尊谥曰神功圣德文武皇帝，庙号太宗。十月己酉，葬永熙陵。)|注=[[s:宋史/卷004]] 开宝九年冬十月癸丑，太祖崩，帝遂即皇帝位。...十二月甲寅...改是岁为太平兴国元年。',
		'/太平兴国|977/1/14~|1/12/22=3p1 37x342t 58y 55c35uq 40984ic 488|注=[[s:宋史/卷004]] 开宝九年十二月甲寅...改是岁为太平兴国元年。',
		'/雍熙|984/11/26~|11=35u 3mw946t 46i',
		'/端拱|988/1/22~|4oet5dw',
		'/淳化|990/1/30~|5us 40aq5as 4gne57u',
		'/至道|995/2/3~|505 3ql347d|注=三年三月宋真宗即位沿用',
		'/真宗/咸平|998/1/31~|5e1 3swj4a0 4plo3px 3oq|君主=应符稽古神功让德文明武定章圣元孝皇帝|君主名=赵恒;赵德昌;赵元休;赵元侃',
		'/景德|1004/1/25~|4mg9591 4gi 4so5',
		'/大中祥符|1008/2/10~|5ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0|注=高丽自1016年起用北宋年号',
		'/天禧|1017/1/31~|5es 3t504ac 3qz0505',
		'/干兴|1022/2/4~|4yy|注=二月宋仁宗即位沿用',
		'/仁宗/天圣|1023/1/25~|54895sa 4i0 4t913u0 52s 4g9e3me 4fve58w|君主=体天法道极功全德神文圣武睿哲明孝皇帝|君主名=赵祯;赵受益',
		'/明道|1032/12/6~|11=35u 5u9',
		'/景祐|1034/1/23~|400m4i9 3u1 3a90',
		'/宝元|1038/2/7~|3p1 39i435s',
		'/康定|1040/3/16~|2=46d 58w',
		'/庆历|1041/11/27~|11=35u 56x55uq 4ic 3rd148a 439 3mmp',
		'/皇祐|1049/2/5~|46h 4oez5dw 5us 4pl34qo',
		'/至和|1054/4/11~|3=3pw 50q 4g03',
		'/嘉祐|1056/10/12~|9=362 505 3ql8495 5e1 3swo4a1 3q1|注=八年四月宋英宗即位沿用',
		'/英宗/治平|1064/1/21~|32513oq 579 3qkz|君主=体干应历隆功盛德宪文肃武睿圣宣孝皇帝|君主名=赵曙;赵宗实|注=四年正月宋神宗即位沿用',
		'/神宗/熙宁|1068/2/6~|4gi 4sob5eq 4aa 3b5347u 42y 4o105np 4gy|纪年=熙宁|君主=绍天法古运德建功英文烈武钦仁圣孝皇帝|君主名=赵顼;赵仲瑊',
		'/元丰|1078/1/17~|4sox5es 3t6x52s 47u 3mna4zu 5r9|注=八年二月宋哲宗即位沿用',
		'/哲宗/元祐|1086/1/18~|3z4i4i0 4t983u0 52s 4g9k3mi 56z 3y8|君主=宪元继道显德定功钦文睿武齐圣昭孝皇帝|君主名=赵煦;赵佣|生=1077年1月4日|卒=1100年2月23日|在位=1085年4月1日~1100年2月23日',
		'/绍圣|1094/4/18~|4=319g5sh 4i9 3eoi3r4',
		'/元符|1098/7/2~|6=38p 3a953p1|注=三年正月宋徽宗即位沿用',
		'/徽宗/建中靖国|1101/1/31~|3oa|君主=体神合道骏烈圣文仁德宪慈显孝皇帝|君主名=赵佶|生=1082年11月2日|卒=1135年6月4日|在位=1100年2月23日~1126年1月18日',
		'/崇宁|1102/1/21~|4mg659e 5ua 40824ic',
		'/大观|1107/1/26~|3rd648a 439 3mmw',
		'/政和|1111/2/10~|46i 59g 57d05uw 5as 3rcx50q 4g3t',
		'/重和|1118/12/15~|11=35u 4qo',
		'/宣和|1119/3/13~|2=3md 47e 4sh15e1 4a0 4poz3q1|注=七年二月宋钦宗即位沿用',
		'/钦宗/靖康|1126/1/25~1127/6/11|32573k0|君主=恭文顺德仁孝皇帝|君主名=赵桓;赵亶;赵烜|生=1100年5月23日|卒=5月1156年|在位=1126年1月19日~1127年3月20日',

		'/赵谂/隆兴|1101/9/25~1102/3/20|:北宋|疑|年号=龙兴|生=1079年|卒=宋徽宗崇宁元年二月|注=赵谂不满宋哲宗贬黜苏轼，与张怀素暗中抨击，赵谂自称天子，并私立年号隆兴。宋徽宗崇宁元年二月，还乡探视父母时，被人密告私立年号隆兴为蓄意谋反被诛。',
		'/圣公/永乐|1120/11/1~1121/5/12|:北宋|疑|君主名=方腊|生=1048年|卒=宣和三年八月丙辰|注=《宣和遗事》作宣和二年十月改元永乐。而《续资治通鉴》作十一月戊戌改元。宣和二年十月初九方腊率众在歙县七贤村起事，改元永乐。宣和三年四月二十四日，王渊的裨将韩世忠生擒方腊。方腊及其相方肥等五十二人被俘。七月戊子，童贯俘方腊送往首都汴京，八月丙辰伏诛。史称方腊之乱。',

		// 北宋统治地区出现的其他势力年号
		'李蜀/李顺/应运|994/3/1~994/6/17|:北宋|时期=两宋|注=淳化四年二月，青城县（今都江堰市西部）茶农王小波提出「均贫富」的口号，宣称「吾疾贫富不均，今为汝均之」，发动起义。同年十二月他牺牲后，起义军由其妻弟李顺领导，继续战斗。淳化五年正月十六日占领成都，李顺随即自立为王，建国「大蜀」，定都成都。五月六日，成都被北宋军队攻克，李蜀覆灭。',
		'王蜀/王均/化顺|1000/2/8~1000/11/28|:北宋|时期=两宋|注=咸平三年元旦，戍卒赵延顺不堪上级压迫，率众杀死符昭寿，占领益州。以王均为领袖，国号大蜀，年号化顺，攻破汉州（今四川广汉），众至十余万。九月，宋军大军进攻，成都城破。十月，自缢而死，起义失败。',
		'安阳/东平郡王/得圣|1047/11/20~1048/3/16|12=3mi 4mg2|君主名=王则|时期=两宋|注=宋史/卷292: 则僣号东平郡王，以张峦为宰相，卜吉为枢密使，建国曰安阳。榜所居门曰中京，居室厩库皆立名号，改年曰得圣，以十二月为正月。|注=年号或作得胜、德胜、得天，误|注=王则等人在东京（今河南开封）被斩。前后仅65天。',
		'长生国/昭圣皇帝|1029/1/18~|:北宋|疑|君主名=侬智高|生=1025年|卒=1055年|时期=两宋|注=后李太宗天成二年后在北宋广南西路广源州，今靖西、田东一带建立「长生国」（一作「长其国」），自称「昭圣皇帝」。侬全福一度依附大瞿越李朝，但不久又宣布独立，不接受李朝的宗主地位。',
		'大历国/侬智高|1041/11/27~|:北宋|疑|君主名=侬智高|生=1025年|卒=1055年|时期=两宋|注=宋仁宗庆历元年自立为王，国号「大历国」。',
		'南天国/侬智高/景瑞|1049/2/5~|:北宋|疑|君主名=侬智高|生=1025年|卒=1055年|时期=两宋|注=庆历五年，侬智高占领安德州，宣布建立「南天国」，年号景瑞，再次与李朝决裂。',
		'大南/仁惠皇帝/启历|1052/5/31~1053/3/21|:北宋|疑|时期=两宋|君主名=侬智高|生=1025年|卒=1055年|注=皇祐四年四月初六，侬智高以五千人起兵。五月初一攻占邕州（在今广西壮族自治区境），守将张日新等战死，邕州指挥使元斌贝被侬智高生擒。侬智高在邕州自立为「仁惠皇帝」，国号「大南」，年号启历。|注=皇祐五年正月己未与狄青决战于邕州归仁铺战役，侬智高率残兵退入邕州。二月己亥，狄青班师至桂林。|注=另《玉海》还有「端懿」年号，不详何时。《纪元编》又有「大历」年号，李崇智认为是侬智高国号。',

		'南宋/高宗/建炎|1127/6/12~|5=3ai 579 3wwo4gi|君主=受命中兴全功至德圣神武文昭仁宪孝皇帝|君主名=赵构|表字=德基|朝代=宋|时期=两宋|生=1107年6月12日|卒=1187年11月9日|在位=1127年6月12日~1162年7月24日',
		'/绍兴|1131/1/31~|5e9 3t444aa 3q2 38gy42z 39gq5r9 4gy 4sp25es 4ac 3nt050a 3mp74zv 47d 3z4o4i0 5ew 4ih059w 4g9o3mi 577 3qju5u9 4i9 3eom3u1 3p1 380i|注=三十二年六月宋孝宗即位沿用',
		'/孝宗/隆兴|1163/2/5~|3oq 4o17|君主=绍统同道冠德昭功哲文神武明圣成孝皇帝|君主名=赵眘;赵伯琮;赵瑗;赵玮|表字=元永',
		'/乾道|1165/2/13~|59g 5uq 40874ig 48a 3a91439 42y 4o0x',
		// 淳"煕": see [[中山世谱/卷03]]
		'/淳熙|1174/2/4~|5d0 57dl4a0 5as 3rd250q 505 3psj47e 4sh75e9 4a0 4pp33q1 3fw 4g4l|纪年=湻熙;淳煕|注=十六年二月宋光宗即位沿用',
		'/光宗/绍熙|1190/2/7~|579 4ei 4sgy5e9 3t4a|君主=循道宪仁明功茂德温文顺武圣哲慈孝皇帝|君主名=赵惇|生=1147年9月30日|卒=1200年9月17日|在位=1189年2月18日~1194年7月24日|注=五年七月宋宁宗即位沿用',
		'/宁宗/庆元|1195/2/12~|4aa 3q1 3a1y431 3o5 4nyq|君主=法天备道纯德茂功仁文哲武圣睿恭孝皇帝|君主名=赵扩|生=1168年11月18日|卒=1224年9月18日|在位=1194年7月24日~1224年9月18日',
		'/嘉泰|1201/2/5~|4gy 4t3g5es 4ac',
		'/开禧|1205/1/22~|3qyw50a 42z',
		'/嘉定|1208/1/19~|3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o|注=十七年八月宋理宗即位沿用',
		'/理宗/宝庆|1225/2/9~|42y 591 3qrp|君主=建道备德大功复兴烈文仁武圣明宏孝皇帝|君主名=赵昀;赵贵诚|生=1205年1月26日|卒=1264年11月16日|在位=1224年9月17日~1264年11月16日',
		'/绍定|1228/2/8~|5uq 4i9 3epu48a 3a95445',
		'/端平|1234/1/31~|42y 4o135d1',
		'/嘉熙|1237/1/28~|49w 4pl05as 3rf0|纪年=嘉煕',
		'/淳祐|1241/2/13~|50s 505 3pso47e 5e1 3swk4a0 5aw 4gpe3ho 4fd6591',
		'/宝祐|1253/1/31~|56y 4sh25e9 4a9 3b503q1',
		'/开庆|1259/1/25~|3a23',
		'/景定|1260/2/13~|431 42d 4nyx59k 5eq|注=五年十月宋度宗即位沿用',
		'/度宗/咸淳|1265/1/19~|3t514ac 47u 3mox431 3mje47d 4h0 4t525ew|君主=端文明武景孝皇帝|君主名=赵禥;赵孟哲;赵孜|生=1240年5月2日|卒=1274年8月12日|在位=1264年11月16日~1274年8月12日|注=十年七月宋恭帝即位沿用',
		'/恭帝/德祐|1275/1/29~|52s 3oqr|君主=恭宗|尊号=孝恭懿圣皇帝|庙号=恭帝|君主名=赵㬎;赵显|生=1271年11月2日|卒=1323年5月|在位=1274年8月12日~1276年2月4日',
		'/端宗/景炎|1276/6/14~|5=3as 50a 4xs|君主=裕文昭武愍孝皇帝|君主名=赵昰|生=1269年7月10日|卒=1278年5月8日|在位=1276年6月14日~1278年5月8日',
		'/帝昺/祥兴|1278/5/23~1279/4/12|5=2v1n4qo|君主=昺帝|君主名=赵昺|生=1272年2月12日|卒=1279年3月19日|在位=1278年5月10日~1279年3月19日',
		// 非正统皇帝
		'/元懿太子/明受|1129/3/26~4/22|:南宋|君主名=赵旉|谥=元懿太子|生=1127年7月23日|卒=1129年7月27日|在位=1129年3月23日~1129年4月20日|注=建炎三年金人入侵淮南，三月癸未，高宗在扬州遇上苗傅、刘正彦作乱，逼迫高宗退位，拥立魏国公赵旉为傀儡皇帝，己丑改年号为明受，是为苗刘兵变。宰相张浚等闻知，举兵向傅、正彦二人问罪。四月戊申高宗复位。庚戌傅、正彦二人兵败逃走，年号改回建炎。丁卯高宗迁往临安府（今浙江杭州），壬申赵旉被册立为皇太子。五月乙酉随父亲一起抵达建康（今江苏南京）。赵旉立为太子后不久就生病，宫人不小心踢到金炉发出声响，太子受到惊吓，随后病情转剧，七月丁亥去世，得年仅2岁。',
		// 元祐皇后（垂帘听政） |君主性别=女

		'/楚王/天载|1130/3/12~5/8|:南宋|君主名=钟相|卒=1130年|年号=天战',

		// TODO: 南宋统治地区其他势力年号
		'刘齐/大齐皇帝/天会|1130/2/10~|8/=:金|君主名=刘豫|时期=两宋|表字=彦游|生=1073年|卒=1146年10月18日',
		'/阜昌|1130/12/25~1138/1/12|:金|注=1137年，金朝废刘豫为蜀王并且废除齐国，将刘豫一家迁至临潢府，1142年改封曹王，1146年10月18日（九月戊寅）过世。|注=黄会奇《刘豫改元“阜昌”年代考》和许正弘《刘豫阜昌改元始年小考》辩证史籍记载，援引石刻资料，证明阜昌元年为庚戌年，并以《伪齐录校补》卷上《伪豫传》收录的《建元阜昌诏》证明，具体改元时间为庚戌年十一月二十三日。',

		// 契丹族
		'辽/太祖/|907/2/15~|3o5 58y 55bc5e9 4b5 3bj93u2 3ot 37wy42s|谥=大圣大明神烈天皇帝|君主=耶律阿保机|君主名=耶律亿;刘亿;安巴坚|表字=阿保机|国号=大辽;大契丹国|时期=大辽|生=872年|卒=926年9月6日|在位=916年3月17日~926年9月6日 实际统治：907年2月27日~926年9月6日|注=辽史/卷1:元年春正月庚寅，命有司设坛于如迂王集会埚，<三>燔柴告天，即皇帝位。',
		'/神册|916/12/28~|12=35t 4nyy59g 5gi 3txi4b8 35s|注=辽史/卷1:神册元年春二月丙戌朔，上在龙化州，迭烈部夷离耶律曷鲁等率百僚请上尊号，三表乃允。丙申，群臣及诸属国筑坛州东，上尊号曰大圣大明天皇帝，后曰应天大明地皇后。大赦，建元神册。',
		'/天赞|922/3/2~|2=48a 3mw44z1 3prw35s',
		'/天显|926/3/17~|2=47d 59g',
		'/太宗/=|927/11/27~|2/11/=35s 4uq05go 5as 4gnp3fu 505 3psh47d 4pbv3tf 3hk|谥=孝武惠文皇帝|君主名=耶律德光|表字=德谨|生=902年11月25日 (根据《辽史》记载，辽太宗耶律德光生于唐昭宗天复二年，辽太宗耶律德光登基称帝后的生日“天授节”是十月二十三日，天复二年十月二十三日（乙未日），用万年历换算为公历则是902年11月25日)|卒=947年5月15日|在位=大契丹国皇帝：927年12月11日~947年 2月24日 大辽皇帝：947年2月24日~947年5月15日|注=天显元年七月阿保机逝世，皇后摄政。至辽天显二年十一月辽太宗即位沿用。',
		'/会同|938/11/25~|11=35t 3b1j3px 3my 4mg3591 3sd84gy 5ea 35s',
		'/大同|947/2/24~|2=3t3b',
		'/世宗/天禄|947/10/17~|9=35w 4aa 445 3mmt42o|谥=孝和庄宪皇帝|君主名=耶律阮|生=919年1月29日 (根据《辽史》记载，辽世宗耶律阮生于辽太祖神册三年十二月二十五日（甲子日），用万年历换算为公历则是919年1月29日 )|卒=951年10月7日|在位=947年5月16日~951年10月7日|注=耶律倍的长子耶律阮',
		'/穆宗/应历|951/10/4~|9=362 59h 3z2p4h0 4t555es 4ac 3qyv506 46i 54835s9 3z8c4fc 5ew 4ihk3p0 57a 4qo|谥=孝安敬正皇帝|君主名=耶律璟|生=931年9月19日 (根据《辽史》记载，辽穆宗耶律璟生于辽太宗天显六年八月初五（庚申日），用万年历换算为公历则是931年9月19日)|卒=969年3月12日|在位=951年10月11日~969年3月12日',
		'/景宗/保宁|969/2/19~|2=31at58y 5sh 400i4i9 3ep648a 3p1 37x342t 58w|谥=孝成康靖皇帝|君主名=耶律贤|表字=贤宁|生=948年9月1日 (根据《辽史》记载，辽景宗耶律贤生于辽世宗天禄二年七月二十五日（壬申日），用万年历换算为公历则是948年9月1日 )|卒=982年10月13日|在位=969年3月13日~982年10月13日',
		'/干亨|979/11/23~|11=35u 55c35uq 40984g0',
		// http://bbs.nongli.net/dispbbs_2_47386_3_4.html
		// 西元994年，即统和十二年开始使用贾俊的大明历，在万年历中也是西元994年，即统和十二年开始反应
		'/圣宗/统和|983/7/13~|6=384 48a 3mw8505 46i 4oet5dw 5us 40aq5as 4gnu3my 505 3ql347d 5e1 3swk4a1 3b573px 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 39ze|谥=文武大孝宣皇帝|君主名=耶律隆绪|生=972年1月16日 (根据《辽史》记载，辽圣宗耶律隆绪生于辽景宗保宁三年农历十二月二十七日（己丑日），用万年历换算为公历则是972年1月16日。)|卒=1031年6月25日|在位=982年10月14日~1031年6月25日|注=谈古籍整理中过度依赖传统历谱的问题: 《辽史·圣宗纪》称统和三年闰九月壬申朔',
		'/开泰|1012/12/16~|11=35t 46i 5np 3z2v4h0 5es 3t504ac 3nt8504',
		'/太平|1021/12/7~|11=35u 4yy 54895s9 4h4 4t913u0 52s 4g9f3me 4xs',
		'/兴宗/景福|1031/6/23~|6=2uze58w|谥=神圣孝章皇帝|君主名=耶律宗真|生=1016年4月3日 (根据《辽史》记载，辽兴宗耶律宗真生于辽圣宗开泰五年农历二月二十三日（戊戌日），用万年历换算为公历则是1016年4月3日。 )|卒=1055年8月28日|在位=1031年6月25日~1055年8月28日',
		'/重熙|1032/12/6~|11=35u 5u9 400m4i9 3u1 3a903p1 37x842u 58y 56x55uq 4ia 3epx48a 439 3mmp46i 4oez5dw 5us 40av5as 50g',
		'/道宗/清宁|1055/8/25~|8=362 4fc3505 3ql847e 5e1 3swo4a1 3q1 3252|谥=仁圣大孝文皇帝|君主名=耶律洪基|表字=纳琳|生=1032年9月14日 (根据《辽史》记载，辽道宗耶律洪基生于辽兴宗景福二年农历八月初七日（丙午日），用万年历换算为公历则是1032年9月14日。 )|卒=1101年2月12日|在位=1055年8月28日~1101年2月12日|注=[[宋史/卷340]], 续资治通鉴长编卷二百八十四: 熙宁十年 八月 苏颂为辽主生辰国信使...使北者冬至日与北人交相庆。是岁，本朝历先契丹一日，契丹固执其历为是',
		'/咸雍|1065/2/8~|3oq 579 3qkz4gi 4sob5ea 4aa 3b5344a 42z',
		'/大康|1075/1/19~|39gk5np 3z304h0 5es 3t6w52s 47u 3mna4zu',
		'/大安|1085/1/29~|5r9 3z4i4i0 4t983u0 52s 4g9k3mi 56y 5544',
		'/寿昌|1095/2/8~|5sh 4i9 3eoi3u1 3a953p1 35s|年号=寿隆;盛昌|注=《辽史·历象志》溯源: 陈大任修《辽史》时可能避“昌”字讳，改“寿昌”为“寿隆”|注=邱靖嘉 辽道宗“寿隆”年号探源——金代避讳之新证: 改元后初名「寿隆元年」；第二年更名为「寿昌」，是为「寿昌二年」，后同。内蒙古及东三省原辽国境内出土了「寿隆元宝」，还有「寿隆通宝」',
		'/天祚帝/干统|1101/3/2~|2=3oa 4mee58y 5ua 3twj4ic 3rd648a 439 3mmw|君主名=耶律延禧|表字=延宁|生=1075年6月5日 (根据《辽史》记载，辽天祚帝耶律延禧生于辽道宗大康元年农历闰四月十九日（庚戌日），用万年历换算为公历则是1075年6月5日。 )|卒=6月1128年/1156年 (存争议) (1128年（或1156年）)|在位=1101年2月12日~1125年3月26日|注=谈古籍整理中过度依赖传统历谱的问题: 辽干统五年闰二月己巳朔',
		'/天庆|1111/2/10~|46i 59g 57b85uw 5as 3rcx50q 4g4p579 47e',
		'/保大|1121/1/21~1125/4/5|4sdh5e1 4a0 4poz35s|注=保大五年二月二十日天祚帝在应州被为金人完颜娄室等所俘',

		// 渤海国的后继政权
		'东丹/人皇王/甘露|926/2/15~|:辽|时期=大辽|君主名=耶律倍;耶律图欲;李赞华|庙号=义宗|谥=文武元皇王;让国皇帝;文献皇帝;文献钦义皇帝|国号=东辽|据=Wikipedia;辽阳 金毓黻《渤海国志长编》卷五 年表第一 渤海国志三|生=c. 899, 900|卒=后晋高祖天福元年闰月丁丑|在位=926年~930年|注=天赞五年正月丁丑，阿保机攻入忽汗城，渤海国亡。二月丙午，阿保机将渤海国改名为东丹国，意为「东契丹国」。 辽太宗天显五年，耶律阿保机的长子耶律倍因受德光猜忌，逃奔后唐，东丹国名存实亡，后继者为其长子耶律阮。',
		'/端顺皇后/=|930/11/23~|5/11/=:辽|君主=王妃萧氏|君主性别=女|卒=会同三年七月戊寅|注=东丹王国摄政',
		'=/=|937/1/7~|:辽',
		'/耶律阮|940/8/20~|:辽|君主=辽世宗;永康王|君主名=耶律阮|注=辽史卷五本纪第五世宗: 大同元年春二月，封永康王。 金毓黻《渤海国志长编》 兀欲继主国政兀欲名阮',
		'/明王|947/11/1~953/1/17|:辽|卒=辽穆宗应历二年十二月辛亥|君主名=耶律安端|注=辽史卷五本纪第五世宗: 大同元年九月壬子朔，葬嗣圣皇帝于怀陵。丁卯，行柴册礼，群臣上尊号曰天授皇帝。大赦，改大同元年为天禄元年。追谥皇考曰让国皇帝。以安端主东丹国，封明王|注=渤海国志长编: 东丹五十七年冬十二月庚辰辽罢东京中台省东丹国除(辽景宗干亨四年十二月庚辰)',

		'定安/烈万华|938/2/2~|:辽|时期=大辽|注=936年，烈氏一族的烈万华从南海府迁居西京鸭绿府。938年，烈万华在西京鸭绿府附近（今吉林省磐石市）建立定安国。《渤海国记》定安国王大氏、乌氏迭见其理不可晓。渤海亡，始建国，下讫淳化二年，凡六十四年。',
		'/乌玄明/元兴|976/2/3~992/2/5|:辽|注=宋史避讳宋圣祖赵玄朗，又称乌元明。 宋史卷四百九十一: 元兴六年十月日，定安国王臣玄明表上圣皇帝前。',

		// 兴辽国
		'兴辽/大延琳/天庆|1029/9/11~1030/9/29|:辽|时期=大辽|注=渤海国王族，高王大祚荣的七世孙',

		// 大渤海国, 大元国
		'大渤海/高永昌/隆基|1116/1/17~1117/2/3|:辽|时期=大辽',

		'北辽/宣宗/建福|1122/4/25~|:中国|疑|君主名=耶律淳|谥=天锡皇帝;孝章皇帝|据=Wikipedia|时期=大辽|生=1062年|卒=1122年|在位=1122年三月十七至六月廿四',
		'/萧德妃/德兴|1122/7/29~|:中国|疑|君主名=萧普贤女|谥=萧德妃|君主性别=女|据=Wikipedia|卒=1123年|在位=1122年六月廿四-1123年二月初二',
		'/梁王/神历|1123/7/24~|:中国|疑|君主名=耶律雅里|谥=顺文皇帝|据=Wikipedia|生=1094年|卒=1123年|在位=1123年五月廿九（癸卯）至十月',
		'/英宗/=|1123/10/21~12/19|:中国|疑|君主名=耶律术烈|谥=显武皇帝|据=Wikipedia|卒=1123年|在位=1123年十月至十一月',

		'西辽/德宗/延庆|1124/2/17~|2=:中国|疑|君主名=耶律大石|据=Wikipedia|时期=大辽|生=1087年|卒=1143年|在位=1132年~1143年|注=元代史籍《辽史》以1124年为改元延庆之年，计10年。近代学者如纪安宗、李锡厚、柴平等皆认为在1131年或1132年之间改元延庆，计3年。',
		'/康国|1134/1/27~|:中国|疑',
		'/感天皇后/咸清|1144/2/6~|:中国|疑|君主名=萧塔不烟|君主性别=女|在位=1143年~1150年|注=耶律大石之妻，临朝称制。|注=李崇智,中国历史年号考.认为是1136年十一月－1142年十一月。',
		'/仁宗/绍兴|1151/1/20~|:中国|疑|君主名=耶律夷列|卒=1163年|在位=1150年~1163年|注=耶律大石之子|注=李崇智,中国历史年号考.认为是1142年-1154年。',
		'/承天太后/崇福|1164/1/26~|:中国|疑|君主名=耶律普速完|卒=1177年|君主性别=女|注=耶律夷列之妹，临朝称制，被萧斡里剌射杀|注=李崇智,中国历史年号考.认为是1154年十二月-1168年十一月',
		'/末主/天禧|1178/1/21~|:中国|疑|君主名=耶律直鲁古|生=12世纪|卒=1213年|注=耶律夷列次子，屈出律篡位|注=李崇智,中国历史年号考.认为是1168年-1201年。',
		'/屈出律/=|1212/2/5~1219/1/17|:中国|疑|注=乃蛮塔阳汗之子，耶律直鲁古的女婿，1218年西辽灭于蒙古帝国',
		// TODO: 克尔曼王朝（Kirmanid dynasty），
		// 又称起儿漫王朝，是西辽政权失败后其贵族在伊朗东南部克尔曼地区建立的一个政权，共延续八十余年（1224年－1303年或1306年）。中国学者王治来称后西辽。

		'西夏/景宗/显道|1032/2/14~|:中国|疑|君主=武烈帝|君主名=李元昊;拓跋曩霄;拓拔曩霄|据=时间规范资料库|国号=大夏|生=1003年6月7日|卒=1048年1月19日|在位=1038年11月10日~1048年1月19日 实际统治：1032年~1048年1月19日',
		'/开运|1034/8/17~|7=:中国|疑',
		'/广运|1034/9/16~|8=:中国|疑',
		'/大庆|1036/12/21~|12=:中国|疑',
		'/天授礼法延祚|1038/11/29~|11=:中国|疑|年号=天授;天授理法延祚',
		'/毅宗/延嗣宁国|1049/2/5~|:中国|疑|君主=昭英帝|君主名=李谅祚;小字宁令哥|生=1047年3月5日|卒=1068年1月|在位=1048年~1068年1月',
		'/天佑垂圣|1050/1/26~|:中国|疑',
		'/福圣承道|1053/1/23~|:中国|疑',
		'/奲都|1057/2/7~|:中国|疑',
		'/拱化|1063/2/1~|:中国|疑',
		'/惠宗/乾道|1068/2/6~|:中国|疑|君主=康靖帝|君主名=李秉常|生=1061年|卒=1086年8月21日|在位=1068年1月~1086年8月21日',
		'/天赐礼盛国庆|1069/1/26~|:中国|疑|年号=天赐国庆',
		'/大安|1075/1/20~|:中国|疑',
		'/天安礼定|1086/1/18~|:中国|疑',
		'/崇宗/天仪治平|1086/9/11~|8=:中国|疑|君主=圣文帝|君主名=李干顺|生=1083年|卒=1139年7月1日|在位=1086年8月~1139年7月1日',
		'/天佑民安|1090/2/3~|:中国|疑',
		'/永安|1098/2/4~|:中国|疑',
		'/贞观|1101/1/31~|:中国|疑',
		'/雍宁|1114/2/8~|:中国|疑',
		'/元德|1119/2/12~|:中国|疑',
		'/正德|1127/5/13~|4=:中国|疑',
		'/大德|1135/1/16~|:中国|疑',
		'/仁宗/大庆|1140/1/22~|:中国|疑|君主=圣德帝|君主名=李仁孝|生=1124年|卒=1193年10月16日|在位=1139年7月~1193年10月16日',
		'/人庆|1144/2/6~|:中国|疑',
		'/天盛|1149/2/10~|:中国|疑',
		'/干佑|1170/1/19~|:中国|疑',
		'/桓宗/天庆|1194/1/24~|:中国|疑|君主=昭简帝|君主名=李纯佑;李纯祐',
		'/襄宗/应天|1206/3/11~|2=:中国|疑|君主=敬穆帝|君主名=李安全|生=1170年|卒=1211年9月13日|在位=1206年3月1日~1211年8月12日',
		'/皇建|1210/1/27~|:中国|疑',
		'/神宗/光定|1211/9/9~|8=:中国|疑|君主=英文帝|君主名=李遵顼|生=1163年|卒=1226年|在位=1211年8月12日~1223年',
		'/献宗/干定|1223/12/24~|12=:中国|疑|君主名=李德旺|生=1181年|卒=1226年|在位=1223年~1226年',
		'/末帝/宝义|1226/7/26~1227/8/13|7=:中国|疑|君主名=李𪾢;李𪾢;李晛|君主=末主|卒=1227年8月28日|在位=1226年~1227年8月28日',

		'金/太祖/收国|1115/1/28~|5as 3rcx|君主=应干兴运昭德定功睿神庄孝仁明大圣武元皇帝|君主名=完颜旻;完颜阿骨打|生=1068年8月1日|卒=1123年9月19日|在位=1115年1月28日~1123年9月19日',
		'/天辅|1117/2/4~|50q 4g4p579 47e 4sh15e1 49s',
		'/太宗/天会|1123/9/22~|9=360 4poz3q1 32573oq 579 3ql44gi 5e9 3t444aa 3q1|君主=体元应运世德昭功哲惠仁圣文烈皇帝|君主名=完颜晟;完颜吴乞买|生=1075年11月25日 (根据《金史》记载，金太宗完颜晟生于辽道宗大康元年，而金太宗完颜晟登基称帝后，他的生日“天清节”是每年的农历十月十五日，大康元年农历十月十五日，用万年历换算为公历则是1075年11月25日。 )|卒=1135年2月9日|在位=1123年9月27日~1135年2月9日',
		'/熙宗/=|1135/1/16~|38gy42z 39gq|君主=宏基缵武庄靖孝成皇帝|君主名=完颜亶;完颜合刺|生=1119年8月14日|卒=1150年1月9日|在位=1135年2月10日~1150年1月9日',
		'/天眷|1138/2/12~|5r9 4gy 4sp2',
		'/皇统|1141/2/9~|5es 4ac 3nt050a 3mnf4zv 3s9 3z4o4i0',
		'/海陵王/天德|1150/1/1~|12=35s 5ew 4ih052s 4qo|君主=废帝;海陵王|谥=海陵炀王;海陵庶人|君主名=完颜亮|表字=元功|生=1122年2月24日|卒=1161年12月15日|在位=1150年1月9日~1161年12月15日',
		'/贞元|1153/3/27~|3=31p83mi 56z 35s',
		'/正隆|1156/2/23~|2=3qju5u9 4i9 3eom3u1 3p1',
		'/世宗/大定|1161/10/28~|10=3p1 380i3oa 4o1759g 5uq 40874ic 48a 3a91439 42y 4o0x5d0 57d55uw 5as 3reu50q 505 3psj47e 4sh75e1 4a0 4pp33q1 3fw 4g4l|君主=光天兴运文德武功圣明仁孝皇帝|君主名=完颜雍|生=1123年3月29日|卒=1189年1月20日|在位=1161年10月27日~1189年1月20日|注=金史/卷6:十月辛丑...丙午，庆云见，官属诸军劝进，固让良久，于是亲告天太祖庙，还御宣政殿，即皇帝位。...丁未大赦，改元大定。',
		'/章宗/明昌|1190/2/7~|579 4ei 4sgy5e9 3t4a4aa 3q0|君主=宪天光运仁文义武神圣英孝皇帝|君主名=完颜璟|生=1168年8月31日（农历七月二十七）|卒=1208年12月29日|在位=1189年1月20日~1208年12月29日',
		'/承安|1196/11/22~|11=35t 3a1y42z 3o5 4nyq',
		'/泰和|1201/2/5~|4gy 4t3g5es 4ac 3qyw50a 46l 3mhw',
		'/卫绍王/大安|1209/2/7~|5s9 4h0 4t4y|君主=衞绍王|君主名=完颜永济|卒=1213年9月11日|在位=1208年12月29日~1213年9月11日',
		'/崇庆|1212/2/5~|5ew 4xs|注=1212年正月初一（己酉朔日，阳历2月5日），改元崇庆，赦。崇庆二年五月，改元至宁。',
		'/至宁|1213/5/22~|5=3ao',
		'/宣宗/贞祐|1213/9/16~|9=2t8p59w 50a 4f53574|君主=继天兴统述道勤仁英武圣孝皇帝|君主名=完颜珣|生=1163年4月18日|卒=1224年1月14日|在位=1213年9月22日~1224年1月14日',
		'/兴定|1217/10/2~|9=35v 47d 400j4i9 3eos3ts',
		'/元光|1222/9/7~|8=361 3p1',
		'/哀宗/正大|1224/1/22~|380o42y 591 3qrp5uq 4i9 3epu48a 3a95|君主名=完颜守绪|生=1198年9月25日|卒=1234年2月9日|在位=1224年1月15日~1234年2月9日',
		'/开兴|1232/2/11~|/1/19=3a95|注=金史卷一十七：天兴元年，是年本正大九年，正月庚子改元开兴，四月甲子改元天兴。',
		'/天兴|1232/5/5~1234/3/1|/4/14=3a95445 35s|注=金哀宗天兴三年正月己酉，金哀宗不欲做亡国之君，将帝位传予金末帝完颜承麟。哀宗自缢于蔡州幽兰轩。完颜承麟收到哀宗死讯，哭奠未毕，城溃，诸禁近举火焚之。奉御绛山收哀宗骨瘗之汝水上。末帝为乱兵所害，金亡。李兆洛《纪元编》以「盛昌」作末帝年号，但没有史料证据',

		// 元朝、大蒙古国与北元皇室的氏为「孛儿只斤」，史书上一般只单独称名，较少姓名共用。
		'大蒙古国/太祖|1206/2/10~|50a 42z 3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o42y 591 3qrp|君主名=铁木真|谥=太祖法天启运圣武皇帝;圣武皇帝|庙号=太祖|君主=成吉思汗|蒙语尊号=成吉思汗|国号=大蒙古国;蒙古帝国|朝代=元|时期=大元|生=1162年 (金世宗大定 (金))|卒=元太祖二十二年丁亥猪年七月十二日（六十六岁） 1227年8月25日|在位=1206年春天 (拉施特《史集》第一卷第二分册，《第二编 成吉思汗纪四（从鼠年初至马年末，1204~1210年）》记载：“当始自伊斯兰教历602年7月的巴儿思亦勒即虎年[1206年]幸福地莅临时，初春，成吉思汗下令建九脚白旄纛，隆重地召集举行了大忽里勒台。”在这次忽里勒台上他获得了“成吉思汗”的尊号。”（拉施特《史集》中译本，余大钧 周建奇 译，第208页；北京：商务印书馆，1983年9月第1版）)~1227年8月25日',
		// 拖雷（监国）
		'/拖雷|1228/2/8~|5uq|君主=睿宗;睿宗仁圣景襄皇帝|君主名=拖雷|生=1192年 (白寿彝《中国通史》认为拖雷生于1192年。理由如下：拖雷生年史料缺载，唯《元朝秘史》第214 节有一段记事，谓成吉思汗攻杀塔塔儿人时，有一塔塔儿人逃脱，窜入成吉思汗后营行帐中觅食，乘机劫持了五岁的拖雷，幸被部属救出。这次战争当是指金承安元年（1196）的斡里札河之役，则拖雷应生1192 年，此与《睿宗传》所载“寿四十有□（此字缺）”合（按：拖雷死于1232 年），缺字当为“一”。)|卒=1232年',
		'/太宗|1229/1/27~|4i9 3epu48a 3a95445 42y 4o135d1 49w 4pl05b8 3rf050s|君主=太宗英文皇帝|君主名=窝阔台|生=1186年 (金世宗大定 (金))|卒=元太宗十三年辛丑牛年十一月八日（五十六岁） 1241年12月11日|在位=1229年9月13日~1241年12月11日',
		// 乃马真后（称制）姓乃马真氏 |君主性别=女
		'/昭慈皇后|1242/2/2~|505 3pso47e 5e1|君主=乃马真后|君主名=脱列哥那;朵列格捏|生=12世纪？|卒=蒙古定宗元年|君主性别=女',
		'/定宗|1246/1/19~|3swk4a0 5aw|君主=定宗简平皇帝|君主名=贵由|生=元太祖元年丙寅虎年 1206年|卒=元定宗三年戊申猴年三月 （四十三岁） 1248年4月|在位=1246年8月24日~1248年4月',
		// 海迷失后（称制）
		'/钦淑皇后|1249/1/16~|4gpe3os|君主=海迷失后|君主名=海迷失|卒=1252年|君主性别=女',
		'/宪宗|1251/1/24~|4mgq3o5 576 4sh25e9 4b5 3b503qi 3a233y8|君主=宪宗桓肃皇帝|君主名=蒙哥|生=元太祖三年戊辰龙年十二月三日 1209年1月10日|卒=元宪宗九年己未羊年七月二十一日（五十二岁） (古人的寿命计算方式和西方的计算方式不同，《元史》卷三《宪宗本纪》记载：“岁戊辰，十二月三日生帝。”元宪宗九年七月，“癸亥，帝崩于钓鱼山，寿五十有二，在位九年。”元宪宗蒙哥生于元太祖三年戊辰龙年十二月三日（公历1209年1月10日），去世于元宪宗九年己未羊年七月二十一日（公历1259年8月11日），按照公历计算，蒙哥享年50岁零7个月，按照农历计算，元太祖三年是公历1208年，蒙哥生于1208年农历十二月，去世于1259年农历七月，则是享年五十二岁。) 1259年8月11日|在位=1251年7月1日~1259年8月11日',
		'元/世祖/中统|1260/6/11~|5=3al 42d 4nyx4gy 5eo|君主=圣德神功文武皇帝|君主名=忽必烈;奇渥温忽必烈|国号=大元大蒙古国|时期=大元|生=元太祖十年乙亥猪年八月二十八日 1215年9月23日|卒=1294年2月18日 (元世祖至元 (元世祖))|在位=大蒙古国皇帝：1260年5月5日~1271年 12月18日 大元皇帝：1271年12月18日~1294年 2月18日',
		'/至元|1264/8/23~|8=35u 3t514ac 47u 3mox431 3mij47d 4h0 4upy5ew 52s 4g8z50a 4fxn577 47d 55bc5ep 4aa 3b5x44a 431 37wy42t 3z2y4h0 5es 3t6u4ac 47u|注=1271年忽必烈于大都公布《建国号诏》，建国号曰大元，盖取《易经》乾元之义',
		'/成宗/元贞|1295/1/17~|3mp04yz 35s|君主=钦明广孝皇帝|君主名=铁穆耳|生=1265年10月15日 (元世祖至元 (元世祖))|卒=元成宗大德十一年丁未羊年正月初八日（四十三岁） 1307年2月10日|在位=1294年5月10日~1307年2月10日',
		// 大"徳": see [[中山世谱/卷03]]
		'/大德|1297/2/23~|2=3prw47d 4i0 4t3c5ew 52s 4g9h3mi 579 3qk149d|纪年=大徳',
		'/武宗/至大|1308/1/24~|408b4i9 3u1 3a93|君主=仁惠宣孝皇帝|君主名=海山|生=至元十八年辛巳蛇年七月十九日 1281年8月4日|卒=至大四年辛亥猪年正月初八日 1311年1月27日|在位=1307年6月21日~1311年1月27日',
		'/仁宗/皇庆|1312/2/8~|3p1 3oq|君主=圣文钦孝皇帝|君主名=爱育黎拔力八达|生=1285年4月9日|卒=元仁宗延祐七年庚申猴年正月二十一日 1320年3月1日|在位=1311年4月7日~1320年3月1日',
		'/延祐|1314/1/17~|4mg3591 49e 40814ic 3sy048a',
		'/英宗/至治|1321/1/29~|445 3mmt46i|君主=睿圣文孝皇帝|君主名=硕德八剌|生=元成宗大德七年癸卯兔年二月初六日 1303年2月22日|卒=元英宗至治三年癸亥猪年八月初四日（二十一岁） 1323年9月4日|在位=1320年4月19日~1323年9月4日',
		'/泰定帝/泰定|1324/1/27~|5d1 3sr54a0 4pl54qo|君主名=也孙铁木耳|生=1293年11月28日 (至元 (元世祖))|卒=致和元年戊辰龙年七月十日（三十六岁） 1328年8月15日|在位=1323年10月4日~1328年8月15日',
		'/致和|1328/3/12~|2=3ps',
		'/天顺帝/天顺|1328/10/4~11/1|9=360|君主名=阿速吉八|生=元仁宗延祐七年庚申猴年 1320年|卒=1328年11月14日? (元天顺帝天顺 (元))|在位=1328年10月~1328年11月14日',
		'/文宗/天历|1328/10/4~|9=360|君主=神明元孝皇帝|君主名=图帖睦尔|生=大德八年甲辰龙年正月十一日 1304年2月16日|卒=至顺三年壬申猴年八月十二日（二十九岁） 1332年9月2日|在位=1328年10月16日~1329年4月3日（第一次） 1329年9月8日~1332年9月2日（第二次）',
		'/明宗/=|1329/1/31~|2/=50g|君主=顺天立道睿文智武大圣孝皇帝|君主名=和世㻋;和世[王朿]|生=元成宗大德四年庚子鼠年十一月十一日 1300年12月22日|卒=元明宗天历二年己巳蛇年八月初六日（三十岁） 1329年8月30日|在位=1329年2月27日~1329年8月30日',
		// 天历（元年：1328年九月 - 末年：1330年五月）是元朝时元文宗图帖睦尔的年号，该年号在元明宗(1329年)时被重复使用，共计3年。
		'/文宗/=|1329/8/25~|2/8/=364 4xs|君主=神明元孝皇帝|君主名=图帖睦尔|生=大德八年甲辰龙年正月十一日 1304年2月16日|卒=至顺三年壬申猴年八月十二日（二十九岁） 1332年9月2日|在位=1328年10月16日~1329年4月3日（第一次） 1329年9月8日~1332年9月2日（第二次）',
		'/至顺|1330/5/18~|5=2v9j505 47c',
		'/宁宗/=|1332/10/20~|3/10/=35u 4scj|君主名=懿璘质班|生=元泰定帝泰定三年丙寅虎年三月二十九日 1326年5月1日|卒=元宁宗至顺三年壬申猴年十一月二十六日（七岁） 1332年12月14日|在位=1332年10月23日~1332年12月14日',
		'/顺帝/元统|1333/11/8~|10=35u 5e1 49k|庙号=惠宗|君主名=妥懽帖睦尔;妥懽贴睦尔;妥懽帖木耳;妥懽帖木尔|生=元仁宗延祐七年庚申猴年四月十七日 1320年5月25日|卒=元惠宗至正三十年庚戌狗年四月二十八日 （五十一岁） 1370年5月23日|在位=1333年7月19日~1370年5月23日',
		'/至元|1335/11/16~|11=2t5o4b5 3qh 32543p1 3md',
		'/至正|1341/1/18~|4m6t58y 5e9 3twi4b6 3bka47u 431 39h346d 59e 4t375gk 4b8 3bk147u 3mp54zx 46h 4oet4i0 5go 3tz75as 4g9m3my 579 3qk749d 5ap|注=元惠宗至正二十八年八月初二日（1368年9月14日），明军从大都的齐化门攻城而入，元朝对中国的统治结束，回到本土蒙古草原。',
		// 自元昭宗以后，所有北元君主皆不自称皇帝，只自称可汗。汉文的庙号与谥号也不再有。
		// 宣光果明哲
		'北元/昭宗/宣光|1371/1/17~|3g9f4a1 3b1n3px 3oq 4mg9591 49e|君主名=爱猷识理达腊|时期=大元',
		// 于1378年5月即位，1379年农历六月改年号为天元。
		// 益王走至也速迭儿遇害、五传坤迭木儿、咸未几而弑不复知帝号矣。
		'/益王/天元|1379/1/19~1389/1/27|4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0|君主=脱古思帖木儿;北元后主;天元帝',

		// 明朝统治地区其他势力年号
		'瓦剌/马哈木|1409/1/16~|:中国|准=年|君主名=马哈木|君主=顺宁王|政权=斡亦剌惕;卫拉特;漠西蒙古;厄鲁特|注=元朝称斡亦剌惕、明朝称瓦剌（Wǎlà/Wǎlā）、清朝称卫拉特、漠西蒙古等，厄鲁特本是卫拉特一部，但在清朝文献中也用来泛指卫拉特。|注=1412年，明成祖第一次亲征蒙古，大败本雅失里、阿鲁台，本雅失里西奔。1412年，马哈木杀死大汗本雅失里，瓦剌向明朝称臣，大汗空位。',
		'/脱懽|1416/1/30~|:中国|准=年|君主名=脱懽;脱欢;托欢|君主=顺宁王',
		'/也先/添元|1453/2/9~1458/1/14|:中国|准=年|君主名=也先太师;额森|君主=大元田盛大可汗|注=该年号见于《明英宗实录》和《明史》。学者推测该年号可能是来自音译，为求回避而故将天元译作添元。',

		// TODO: 元朝统治地区其他势力年号
		// 察合台汗国/兀鲁忽乃|在位=1251年-1260年|君主性别=女
		// 哈密国摄政 弩温答失里|在位=1460年-1467年|君主性别=女

		// 一世一元制: 明朝与清朝的每个君主，一般都只有一个年号
		'明/太祖/洪武|1368/1/20~|3qk749d 5ap 3g9f4a1 3b1n3px 3oq 4mg9591 49e 4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0 5b8 3rlw52k 4g5o579 47e 550p5s9 4aw 4q39|君主=开天行道肇纪立极大圣至神仁文义武俊德成功高皇帝|君主名=朱元璋|表字=国瑞|时期=大明|生=1328年11月19日 (元文宗天历元年九月十八日 1328年10月21日)|卒=明太祖洪武三十一年闰五月十日  1398年6月24日|在位=1368年1月23日~1398年6月24日',
		'/惠帝/建文|1399/2/6~|3qh 3hw 4g5v3md|君主名=朱允炆|君主=太宗;惠宗|谥=嗣天章道诚懿渊功观文扬武克仁笃孝让皇帝|生=1377年12月5日|卒=未知|在位=1398年6月30日~1402年7月13日',
		'/成祖/洪武|1402/7/17~|35/6/17=3md|君主=启天宏道高明肇运圣武神功纯仁至孝文皇帝|君主名=朱棣|生=元朝至正二十年四月十七日 1360年5月2日|卒=明朝永乐二十二年七月十八日 1424年8月12日|在位=1402年7月17日~1424年8月12日（在位22年）|注=明成祖登极后不承认建文年号，七月初一（一说六月十八日），将建文元、二、三、四年改为洪武三十二至三十五年，次年改元永乐元年。',
		'/永乐|1403/1/23~|4m6z58y 5sh 3twn4b6 3qi 3a90431 3m5846d 59e 57bd5gk 4b8 3rd148a 431 3mmp47d 4of05e0 5go',
		'/仁宗/洪熙|1425/1/20~|4pl3|君主=敬天体道纯诚至德宏文钦武章圣达孝昭皇帝|君主名=朱高炽|生=1378年8月16日|卒=1425年5月29日|在位=1424年9月7日~1425年5月29日',
		// 大"徳": see [[中山世谱/卷04]]
		'/宣宗/宣德|1426/2/8~|5as 50q 4fc4579 3ql849d 5e9 3swo4a1 3px|君主=宪天崇道英明神圣钦文昭武宽仁纯孝章皇帝|君主名=朱瞻基|生=1399年3月16日|卒=1435年1月31日|在位=1425年6月27日~1435年1月31日|纪年=宣徳',
		'/英宗/正统|1436/1/18~|323a3oq 591 3qs24gy 4sob5es 4aa 3b53445 42y 4o105r9 4h0|君主=法天立道仁明诚敬昭文宪武至德广孝睿皇帝|君主名=朱祁镇|生=宣德二年丁未十一月十一日|卒=1464年2月23日|在位=1435年2月7日~1449年9月1日, 1457年2月11日~1464年2月23日 夺门之变/南宫复辟',
		'/景帝/景泰|1450/1/14~1457/2/14|4sqp5es 3t6x52s 506 3psm4zu 5s9|君主=景泰帝|谥=恭仁康定景皇帝;符天建道恭仁康定隆文布武显德崇孝景皇帝|庙号=代宗|君主名=朱祁钰|生=1428年9月21日|卒=1457年3月14日|在位=1449年9月22日~1457年2月11日',
		'/英宗/天顺|1457/1/26~|5s9 3z824i0 4t973u1 3hu 4g5z3md|注=[[明史/卷12]] 英宗后纪: 天顺元年春正月...丙戌，诏赦天下，改景泰八年为天顺元年。（[[明史/卷12]]用到了"天顺元年春正月壬午"。为求实用性，从元年正月一日开始编排。）|注=景泰八年正月十六日夜[[夺门之变]]，黎明时分英宗「南宫复辟」，随即改元。仓促之中忘记罢黜朱祁钰，直到同年二月乙未才将朱祁钰废为郕王。几天之内，名义上英宗和景帝两位皇帝同时并存。',
		'/宪宗/成化|1465/1/27~|576 55435u9 4i9 3eoy3u2 3a95439 42e 4nyu59g 5uq 408y4ic 3rd650q 4vp 3mmw47d 5ac 57d05uw 5as|君主=继天凝道诚明仁敬崇文肃武宏德圣孝纯皇帝|君主名=朱见深;朱濬|生=1447年12月9日|卒=1487年9月9日|在位=1464年2月28日~1487年9月9日',
		'/孝宗/弘治|1488/1/14~|3rcx50q 4g4p579 47e 4sh15e9 4aw 4poz3px 38ez42y 591 3yon4gy 5e9 3t504aa|君主=达天明道纯诚中正圣文神武至仁大德敬皇帝|君主名=朱祐樘|生=1470年7月30日|卒=1505年6月8日|在位=1487年9月9日~1505年6月8日（在位18年）',
		'/武宗/正德|1506/1/24~|3q2 39zl42y 4o155r9 4h0 4t515ew 4ac 3nt0506 3pss56y 5s9 3z884i8|君主=承天达道英肃睿哲昭德显功宏文思孝毅皇帝|君主名=朱厚照|生=1491年10月26日 (1491年9月24日)|卒=1521年4月20日|在位=1505年6月19日~1521年4月20日',
		'/世宗/嘉靖|1522/1/28~|5ew 4ihg3p1 31p83o6 58y 554a5u9 4i9 3ep23u2 3p1 380i42u 4nz059g 5uq 40934ic 48a 3mw54z9 46i 4oep5dw 57d55uw 5as 3rdi3fu 505 3psj47e 4sh75e9 4a0 4ppj3q1 3my 4mg5591 4gi 4so25e9 3t56|君主=钦天履道英毅神圣宣文广武洪仁大孝肃皇帝|君主名=朱厚熜|生=1507年9月16日|卒=1567年1月23日|在位=1521年5月27日~1567年1月23日',
		'/穆宗/隆庆|1567/2/9~|4aa 3q2 3a0642y 5np 3z2q|君主=契天隆道渊懿宽仁显文光武纯德宏孝庄皇帝|君主名=朱载垕|生=1537年3月4日|卒=1572年5月26日|在位=1566年12月26日~1572年5月26日',
		// 万"暦": see 中山世谱
		'/神宗/万历|1573/2/2~|4h0 4t585ew 4ac 3nt450a 4yz 3pno5s5 4i0 4t8i5ew 4ihl3p1 3fe 4yty58y 5s9 407n4i9 3ep748a 3p1 380o42y 590 56xg49u 4ia 3epu48a 3mw9505 46i 4ofa5dx 49w 4pkz5as 3rdn3fu 505 3pso4ei 5e1 3swk4a8 5a8|君主=范天合道哲肃敦俭光文章武安仁止孝显皇帝|君主名=朱翊钧|生=1563年9月4日 嘉靖四十二年八月十七日|卒=1620年8月18日 万历四十八年七月丙申日|在位=1572年7月19日~1620年8月18日 （48年 30天）|纪年=万暦',
		'/光宗/泰昌|1620/8/28~|8=36h|君主=崇天契道英睿恭纯宪文景武渊仁懿孝贞皇帝|君主名=朱常洛|生=万历十年八月十一日 （1582年8月28日）|卒=泰昌元年九月一日 （1620年9月26日）|在位=1620年8月28日~1620年9月26日（29天）|注=泰昌（1620年八月-十二月）为中国明朝第十四个皇帝明光宗朱常洛的年号，由于明光宗在位仅一个月，故泰昌这个年号仅用了不足一年。实际上，直到九月二十日熹宗下《泰昌元年、<大统历>敕谕》时，方开始使用。|注=《大明泰昌元年大统历》考：经过争论，朝臣最终确定以万历四十八年七月三十日之前为万历四十八年，八月到十二月为泰昌元年。',
		// 天"启": see 中山世谱
		'/熹宗/天启|1621/1/22~|324y3oq 4mga591 4gi 4so65ep|君主=达天阐道敦孝笃友章文襄敬穆庄勤悊皇帝|君主名=朱由校|生=万历三十三年十一月十四日 （1605年12月23日）|卒=天启七年八月十一日 （1627年9月19日）|在位=1620年10月1日~1627年9月30日|纪年=天启',
		'/思宗/崇祯|1628/2/5~|4aa 3b503q2 3a2342z 42t 3z2w4h0 5es 3t6s4ac 47u 3mox4yz 3pnv5s9 4i0|君主=守道敬俭宽文襄武体仁致孝庄烈愍皇帝|君主名=朱由检|生=1611年2月6日|卒=1644年4月25日|在位=1627年10月2日~1644年4月25日',
		'/悼帝/义兴|1644/5/19~|/4/14=4i0|君主=顺宗;献愍太子|君主名=朱慈烺|生=钱海岳.《南明史·列传第二》：「悼皇帝慈烺，崇祯二年二月四日生……」|卒=1644年6月|在位=1644年5月19日~1644年6月（非正式）|注=南明弘光年间追封为献愍太子，鲁王监国元年谥为悼皇帝，庙号顺宗。',
		//
		'南明/安宗/|1644/6/19~|5=4i0|君主=简帝;福王;福忠王;弘光帝|君主名=朱由崧|朝代=明|庙号=明安宗;明质宗|谥=奉天遵道宽和静穆修文布武温恭仁孝简皇帝|时期=大明|生=万历三十五年七月乙巳|卒=1646年5月23日|在位=崇祯十七年五月壬寅~1645年6月15日|注=续明纪事本末 卷之二: 夏五月庚寅，福王监国于南京。...壬寅，福王即位于南京。',
		'/弘光|1645/1/28~|4t8m|注=续明纪事本末卷七: 宏光帝|注=崇祯十七年五月壬寅朱由崧在南京称监国，以明年（1645年）为弘光元年。弘光元年五月清军攻克南京，安宗被俘杀。',
		// http://blog.sina.com.cn/s/blog_4ab9b28b0100hyh4.html
		// 石码史话17：郑成功铸永历通宝钱初探
		// 永历二年５月（１６４８年，清顺治五年），郑成功始奉永历为正朔；永历帝于永历二年１０月（１６４８年，清顺治五年），封成功威远侯；永历三年７月（１６４９年，清顺治六年），永历遣使至岛，封成功为延平公；永历十二年春正月（１６５８年，清顺治十五年）
		'/绍宗/隆武|1645/7/23~1650/1/31|闰6=4t8m5ew 52s 4fh23mi|君主=唐王;襄帝|君主名=朱聿键|表字=长寿|庙号=明绍宗|谥=配天至道弘毅肃穆思文烈武敏仁广孝襄皇帝|生=1602年5月25日|卒=1646年10月6日|在位=1645年8月18日~1646年10月6日|注=小字"长寿"|注=顾诚 南明史p60: 隆武元年夏闰六月丁亥，绍宗监国福州。（南明史用到了"隆武元年夏闰六月丁亥"。为求实用性，从闰六月开始编排。）|注=南明史p63: 盖凛社稷于极危，必不可循逾年改元之例。古今相揆，道符不远。其以弘光元年七月初一日为隆武元年。|注=一说郑成功使用至隆武五年',
		'/鲁王/监国|1646/2/16~1656/1/25|5ew 52s 4fh23mi 4fvv58y 5sh 407s4i9 3u1|君主=鲁监国|君主名=朱以海|表字=巨川|年号=鲁监国;庚寅|生=1618年7月6日|卒=1662年12月23日|在位=1645年8月~1655年|注=据《明史》记载，1645年朱以海在绍兴不奉隆武帝正朔，自号鲁监国，以明年为监国鲁元年。未言建年号。《罪惟录》载鲁王纪年为监国元年，监国二年。李崇智认为「监国」不是年号，并认可李兆洛《纪元编》引《穉山文集》的庚寅为年号的说法。',
		'/文宗/绍武|1646/12/7~1647/1/20|11=5ew|君主名=朱聿𨮁|谥=贞天应道昭崇德毅宁文宏武达仁闵孝节皇帝|生=1605年|卒=1647年1月20日|在位=1646年12月11日~1647年1月20日',
		'/淮王/东武|1648/1/25~1648/12/13|4fh2|君主名=朱常清|生=1616年|卒=1649年|据=Wikipedia|注=该年号《明史》等史书无记载，见于《续明纪事本末》卷七: 郑成功永历二年春正月在南澳岛拥立淮王为监国。朱由榔的使节在永历二年十月到，晋郑成功威远侯，郑成功奉朔改称永历，淮王逊位取消监国及年号，同年去世。',
		'/韩王/定武|1646/2/16~1664/1/27|:明|疑|君主=定武帝|君主名=朱本𫟷;朱亶塉|生=1616年|卒=1664年|在位=1646年~1664年|注=《南明史》顾诚为代表的一些南明史学家质疑「朱本𫟷」的存在，认为是查继佐《罪惟录》讹传|注=野史载1646年，李自成部将郝永忠（又名郝摇旗）为联明抗清，推立韩王为帝，改年号为「定武」。',
		'/昭宗/|1646/12/7~|11=5ew|君主=桂王;永历帝;永明王|君主名=朱由榔|生=1623年11月1日|卒=1662年6月1日|在位=1646年~1662年|注=《明史》记载永历年号起于1646年十一月。《罪惟录》、《明纪》等则记为1646年上尊号，明年改元。今多从之。|注=崇祯年间封永明王',
		'/永历|1647/2/5~|52s 4fh23mi 4fvv58y 5sh 407s4i9 3u1 3a913p1 3mi 4mg1591 3scq|注=永历十六年四月十五日 朱由榔、太子朱慈煊被吴三桂绞杀于滇京五华山篦子坡，其身亡处时人称为逼死坡，即今天的昆明市五华区的华山西路。|注=王叔武(1979)南明史料朔闰考异——《行在阳秋》札记: 《劫灰录》卷一《永历帝纪·永历二年》 条注指出闰六月初十日甲辰。《艇火录》、《明季南略》、《鹿樵纪闻》诸书均作闰六月，盖当时所颁日历如此。《行在阳秋》、《南疆逸史》、《行朝录》、《甲行日注》、《小腆纪年附考》诸书以大统术所推之闰三月，俱不合。|注=王叔武(1979)南明史料朔闰考异——《行在阳秋》札记: 《延平王户官杨英从征实录》（亦名《先王实录》）以永历七年大统历闰八月，此亦或系当时所颁历如此，但未获详证。今从之。',

		// 台湾明郑时期东宁王朝/郑氏王朝/台湾统治者
		'明郑//=|1662/2/19~1684/2/14|16/=5uq 4ia 3rd248a 439 3mms46i 4ofg5dw 5us 4pl45as 52s 4c6e505 46i 4rky5e1 3swq4a9 3q1 3252|朝代=明;南明|时期=大明|参照用|注=南明灭亡后，台湾郑氏政权所使用日期（永历十七年～永历三十七年）',
		// 延平郡主;延平郡王
		'/郑成功/=|1662/2/19~|16/=:明郑|君主名=郑森|表字=明俨;大木|封号=延平王|生=1624年8月27日|卒=1662年6月23日',
		'/郑袭/=|1662/6/23~|16/=:明郑|表字=世袭|斋号=葵庵|封号=延平王|卒=1663年|注=郑成功风寒病逝，在台诸将推举郑成功五弟郑袭为「护理」，以定军心。郑袭部下蔡云、李应清、曹从龙、张骥等四人拉拢黄昭及萧拱宸等驻台将领，立郑袭为「东都主」。',
		'/郑经/=|1662/12/11~|16/=:明郑|君主名=郑锦|表字=贤之;元之|君主号=式天|封号=延平王|生=1642年10月25日|卒=1681年3月17日|注=11月，郑经军先至澎湖，派人与黄昭、萧拱宸等人协商不成后，率军东征。',
		// 郑克臧
		'/郑克𡒉/=|1681/3/17~|35/=:明郑|封号=延平王|生=1662年|卒=1681年3月18日|注=永历三十三年被册立为世子，并兼任监国。延平郡王郑经逝世后，承天府（今台南地区）发生东宁之变，又称东宁政变，继位不及三日的监国同时也是世子的郑克𡒉遭到罢黜并且被杀害，改由郑经之弟郑聪与外戚冯锡范所支持的郑克塽继承王位。',
		// 明宗室宁靖王朱术桂和五姬妾,闻郑克塽决计降清,均自缢而死,为明室尽节。
		'/郑克塽/=|1681/3/19~1684/2/14|35/=:明郑|封号=延平王;海澄公|表字=实弘|君主号=晦堂|生=1670年8月13日|卒=康熙46年8月27日|注=《南明大统历》永历37年：是年明清朔闰全合。节气符者三。傅以礼原历注云：「闰六月台湾降于大清，明朔亡。」考施琅「台湾纪略碑记」，琅以是年八月望日受降于赤嵌，明朔云亡，盖当于是。而古历颁授时，例年前行之，是年明历，行已半载，民多熟习，奉之终岁者必矣。故八月以后之时令，于考史非无义﻿',

		// TODO: 明朝统治地区其他势力年号
		// 明末民变/明末农民战争
		'明/张普薇/天运|1637/1/26~1638/6/11|:明|疑|时期=大明|君主名=张普薇|据=Wikipedia|注=Wikipedia: 见于李兆洛《纪元编》。十年（1637年），以张普薇为首，在铅山率领农民起事。改元天运。翌年二月初四日攻南丰。四月，张普薇被明军捕获杀害。',

		// 1645/6/23: 1645年夏死
		'大顺/太祖/永昌|1644/2/8~1645/6/23|:明|疑|君主名=李自成|时期=大明|据=Wikipedia|注=崇祯十七年正月在西安建国，国号「顺」。三月十九日甲申之变攻陷北京，灭明朝。四月廿九日，李闯在燕京紫禁城武英殿匆匆即位称帝，深夜便焚烧宫殿与九门城楼，向西撤退，闯军仅驻燕京四十一日。1645年夏在湖北通山县南九宫山被忠于明朝的地方武力程九伯杀死（一说李闯自杀、失踪、出家为僧等。）皇子李自敬未称帝。擎天王宫文彩的年号也是永昌',
		// 1644/8/2: 七月初一
		'大西/西王/大顺|1644/8/2~1647/2/4|7=:明|疑|君主=大西皇帝|君主名=张献忠|君主字=秉吾|君主号=敬轩|时期=大明|据=Wikipedia|注=祟祯十六年据武昌，称大西王。1644/8/16登基成为大西皇帝，改元大顺。以成都为「西京」。',

		'后金/太祖/天命|1616/2/17~|4ei 5e1 3swk4a8 5ax 324y3oq 4mga591 4gi 4so6|朝代=清|时期=大清|注=1616年努尔哈赤在今中国东北地区建国称汗，建立「后金」',
		'/太宗/天聪|1627/2/16~|5ep 4aa 3b503q2 3a2342z 42t 3z2w4h0 5es',
		'清/太宗/崇德|1636/5/15~|/4/11=5es 3t6s4ac 47u 3mox4yz 3pnv5s9|时期=大清|生=1592年11月28日申时 (万历二十年十月廿五申时 1592年11月28日)|卒=1643年9月21日亥时 (崇德八年八月初九亥时)|在位=1626年10月20日~1643年9月21日|注=清史稿/卷3: 崇德元年夏四月乙酉，祭告天地，行受尊号礼，定有天下之号曰大清，改元崇德',
		'/世祖/顺治|1644/2/8~|4i0 4t8m5ew 52s 4g9g3mi 4zx 3qk247d 40124i9 3u1 3a913p1 3mi 4mg3591 3sd3|谥=体天隆运统建极英睿钦文显武大德弘功至仁纯孝章皇帝|君主名=爱新觉罗福临|生=崇德三年正月三十 1638年3月15日|卒=1661年2月5日 (顺治十八年正月初七)|在位=1643年10月8日~1661年2月5日|注=清入关(1644)后颁《万年书》(清木刻大本 御定万年书)，回溯至1624年。清于1645年颁行《时宪历》。',
		// 康煕: see 中山世谱
		'/圣祖/康熙|1662/2/18~|49u 4ia 3rd248a 439 3mms46i 59h 3sr649w 4pl35as 50s 4c6d505 46i 4rkz5e1 3swo4a9 3q1 32523ot 3md 4fv858y 5e9 3t434aa 3b5z44a 3ot 39h142t 59e 4soz5es 3t6v4ac 47u 3mp24z1 46d 4oes4i0 5ew 4igz52s 4g9j3mi 579 3qk547l 4i9 3eoj3u1 3a943p1 3oq 4mg6591|谥=合天弘运文武睿哲恭俭宽裕孝敬诚信功德大成仁皇帝|君主名=爱新觉罗玄烨|生=顺治十一年三月十八巳时 1654年5月4日|卒=康熙六十一年十一月十三 1722年12月20日|在位=1661年2月5日~1722年12月20日|纪年=康熈;康煕|注=孝庄太后对少年康熙的谋策颇有指点，对康熙帝起极大之启蒙作用。',
		'/世宗/雍正|1723/2/5~|49e 4pic5aq 48a 3a8z439 3mmv46i 59h 3sr949w 5as 3rlw|谥=敬天昌运建中表正文武英明宽仁信毅睿圣大孝至诚宪皇帝|君主名=爱新觉罗胤祯;爱新觉罗胤禛|生=康熙十七年十月三十 1678年12月13日|卒=雍正十三年八月廿三 1735年10月8日|在位=1722年12月27日~1735年10月8日',
		'/高宗/乾隆|1736/2/12~|50s 4g5l505 47e 4rl25e1 4a0 4q383qh 3fw 4g5v3md 4m6v58y 5e9 3t454b6 3qi 3a1w431 39i146d 59e 55c65gk 4b8 3o7948a 431 3mj646h 4oev5ag 5go 4j9h5as 50q 4fc3579 3ql649e 5e9 3swm4a1 3px 32393oq 579 3qkz49e 4so75ec 48i 3b1h445 42y 4o105d1 4gy 4sqq|谥=法天隆运至诚先觉体元立极敷文奋武钦明孝慈神圣纯皇帝|君主名=爱新觉罗弘历|生=康熙五十年八月十三日子时 1711年9月25日|卒=嘉庆四年正月初三辰刻 1799年2月7日|在位=1735年10月18日~1796年2月9日',
		'/仁宗/嘉庆|1796/2/9~|5es 3rly52s 506 3mms4zu 5s5 3z4i4i0 4q3a3qh 3hw 4g5x3me 56y 55435sh 4b5 3bj63u2 3a92431 42e 4nys59e|谥=受天兴运敷化绥猷崇文经武孝恭勤俭端敏英哲睿皇帝|君主名=爱新觉罗颙琰;爱新觉罗永琰;爱新觉罗颙琰|生=乾隆二十五年十月初六 1760年11月13日|卒=嘉庆二十五年七月廿五 1820年9月2日|在位=1796年2月9日~1820年9月2日|注=嘉庆二十五年八月二十七日，皇次子登极。明年改元为道光。',
		'/宣宗/道光|1821/2/3~|5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plv3px 323b3oq 579 3qs54gy 5e9 3sxw4aa|谥=效天符运立中体正至文圣武智仁慈俭勤孝敏宽定成皇帝|君主名=爱新觉罗旻静;爱新觉罗绵宁;爱新觉罗旻宁|生=乾隆四十七年八月十日 1782年9月16日|卒=道光三十年正月十四 1850年2月25日|在位=1820年10月3日~1850年2月25日',
		'/文宗/咸丰|1851/2/1~|3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506|谥=协天翊运执中垂谟懋德振武圣孝渊恭端仁宽敏显皇帝|君主名=爱新觉罗奕詝|生=道光十一年六月初九 1831年7月17日|卒=咸丰十一年七月十七 1861年8月22日|在位=1850年3月9日~1861年8月22日',
		'/穆宗/同治|1862/1/30~|3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh|谥=继天开运受中居正保大定功圣智诚孝信敏恭宽毅皇帝|年号=祺祥|生=1856年4月27日 (咸丰 (年号))|卒=同治十三年腊月初五 1875年1月12日|在位=1861年11月11日~1875年1月12日|注=1861年8月22日，咸丰帝（清文宗）在热河承德去世，儿子载淳在以肃顺为首的8位顾命大臣的辅佐下登基，9月3日改元祺祥。11月2日辛酉政变发生，八大臣被慈禧一派夺权。朝廷在11月7日下诏翌年改年号为同治，弃祺祥。|注=清史稿穆宗本纪一.乙卯，定年号祺祥。..庚申，诏改祺祥为同治。..甲子，上御太和殿即皇帝位，受朝。颁诏天下，以明年为同治元年。|君主名=爱新觉罗载淳',
		'/德宗/光绪|1875/2/6~|4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4of659g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4g4k591 4eq|谥=同天崇运大中至正经文纬武仁孝睿智端俭宽勤景皇帝|君主名=爱新觉罗载湉|生=同治十年六月廿八 1871年8月14日|卒=光绪三十四年十月廿一 1908年11月14日|在位=1875年2月25日~1908年11月14日',
		// 光绪二十五年十二月二十四日（1900年1月24日），溥俊受诏入宫，封为大阿哥，并以崇绮为师傅，命在弘德殿读书。年号保庆，史称保庆帝，[来源请求]但外国公使均不承认，慈禧被迫停止废立计划。
		'/逊帝/宣统|1909/1/22~|4so25e9 3t52|君主名=爱新觉罗溥仪;溥仪|君主=末帝|生=1906年2月7日|卒=1967年10月17日|注=宣统三年十二月二十五日《宣统帝退位诏书》|注=1917/7/1~12 张勋复辟。',

		// `中历`未受中国任何纪年参照，加`|参照用`会使 CeL.era.中历() 出错。
		'中历|1912/2/18~'
				+ CeL.era.pass_on.last_day
				+ '|1912/=4aa 3q2 3a0542z 3o5 3yoi4h0 4t535es 4ac 3nt150a 4yz 3pno5s9 4h4 4t8i5ew 4ihi3p1 3fe 4f39576 5s9 400j4i9 3ep33u2 3p1 380m42y 591 3qro5uq 4ia 3epu48a 3mw74z9 42y 4of95d1 49w 4pkz5as 3rdk3fu 505 3psm47e 5e1 3swk4a0 5ax 324z3my 4mg7591 4gi 4so55ea 4aa 3b503q2 3a2042z 42d 3yom4h0 5es 3t6s4ac 3nt650a 4yz 3po647d 4h4 4t8l5ew 52s 4g9f3fe 4fxk577 47d 40114i9 3u1 3a903p1 3mi 4mg2591 3qrr5uq 4ia 3epx48a 439 3mms46i 4ofd5dx 49w 4pl25as 48c 4c6c505 46i 4rky5e1 3swm4a9 3q1 32513os 579 4fv74gi 4sob5ea 4aa 3b5y3q2 3ot 37w542t 58y 4soy5es 3t6v4ac 47u 3mp14z1 46d 4oer4i0 4t8o5ew 52s 4g9i3fe 4zx 3qk447l 4i9 3eoj3u1 3a933p1 3mi 4mg5591 49e 4pic5aq 3rd448a 439 3mmu46i 59h 3sr849w 5as 3rer50s 4czr505 46i 4rl15e1 4a0 4pp03q1 32543ot 3md 4fva58y 5e9 3t444aa 3qi 38gy3os|纪年=农历;阴历;旧历;夏历|注=中国传统历法暂时名称。又称夏历、黄历、皇历、汉历、农历、阴历、旧历等。|注=罗尔纲《不应称旧历为农历》（1992，上海《文汇报》） 罗先生说，辛亥革命以后，一般是把旧历（阴阳历）叫做「夏历」。',

		// 清朝统治地区其他势力年号
		'清/蔡牵/光明|1805/1/31~1810/2/3|:清|疑|时期=大清|君主名=蔡牵;蔡骞|君主=大出海;镇海威武王;镇海王|生=1761年|卒=1809年|据=吴建升. 嘉庆十年(1805)海盗蔡牵攻台行动之研究|注=郑兼才，《六亭文选》〈山海贼总论〉，页 52: 自称镇海威武王光明元年。不过据大陆学者季士家所撰〈蔡牵研究九题〉，作者利用军机处奏折录副资料考证，认为「建元光明」是对蔡牵所刻之「王印正大光明」的误解，又镇海威武王之「威武」二字亦系后人所杜撰。季士家〈蔡牵研究九题〉，《历史档案》1992 年第 1 期(总 45 期)，（北京：历史档案杂志社，1992），页 97。',

		// 台湾清治时期三大民变
		// 台湾年号列表
		// https://zh.wikipedia.org/wiki/%E5%8F%B0%E7%81%A3%E5%B9%B4%E8%99%9F%E5%88%97%E8%A1%A8
		'大明/中兴王/永和|1721/5/1~8/22|:清|疑|国号=大明|时期=大清|君主名=朱一贵|君主=义王;德宗;鸭母王|生=康熙29年|卒=康熙61年2月22日|据=Wikipedia|注=Wikipedia: 台湾清治时期三大民变之朱一贵事件。举事期间，定国号为「大明」，建元永和，并受众人拥戴为中兴王，自称义王。攻下台湾府城后，众将拥立朱一贵为「中兴王」，于今台南大天后宫登基。朱一贵尊明为正朔，承袭明朝的制度，国号大明，年号永和，废薙发令，封诸将为官，布告天下。|注=闰6月5日仅余千余人进入沟尾庄（今嘉义县太保市）。漳州人王仁和密谋杨旭、杨雄，联合六庄乡丁设计擒朱一贵等解赴清军。大明永和至此结束。朱一贵和直到九月投降清军的杜君英俱于十月解送北京。',

		// https://tw.knowledge.yahoo.com/question/question?qid=1608122606011
		// 李崇智. 中国历代年号考. 否定了台湾起义者与"天地会"有直接关系的考证
		// http://blog.xuite.net/ccy1217/Formosa/205622681-%E6%9E%97%E7%88%BD%E6%96%87%E4%BA%8B%E4%BB%B6
		'清/林爽文/天运|1787/1/16~|:清|疑|君主名=林爽文|君主=盟主大元帅|生=1756年|卒=1788年|据=Wikipedia|注=乾隆51年冬11月27日夜，会匪林爽文作乱。乾隆五十一年十一月廿九日攻下彰化，自称「盟主大元帅」。',
		// 1787/1/27: 未确认，应于乾隆51年12月6日~30日间。
		// 但有"天运丙午年十二月初八日，顺天大盟主林爽文告示", "顺天丁未年三月" 《奉天承运VS.顺天行道 --林爽文事件研究》
		// http://wtfm.exblog.jp/19062163/
		// 林爽文年号「天运」，后来的要推翻满清的孙中山革命时在其债券、银票也曾使用过「天运」年号。
		// http://blog.xuite.net/ccy1217/Formosa/205622681-%E6%9E%97%E7%88%BD%E6%96%87%E4%BA%8B%E4%BB%B6
		// 12月庚子朔，贼陷淡水，护淡水同知台湾县知县程峻自杀。
		// 护同知程峻，同守备董得魁，先在中港守御，贼党盘山逾岭而入，纠结月眉庄李同、猫里社黄阿宁、何添等，直至新庄，所过附逆者甚众。护同知程，闻彰化城陷，退回堑城，而贼首王作、李同等，分伙伏匿；程轻贼少，迳渡直攻，行至山颇，伏贼尽起，程自杀。诸贼乘机抢掠，堑城遂陷。程长子必大，怀印信从八里坌内渡。贼众共推林爽文为盟主，伪号顺天。时爽文以县署为盟主府，本县胥吏刘怀清为伪彰化县知县，刘士贤为伪北路海防厅，王作为伪征北大元帅，王芬为伪平海大将军。是日大宴群贼，爽文以乌缎为冠，蟠金龙二，黄线结蕤，自顶垂背，掠取官幕袍服衣之。其众悉以乌布帕头。
		// 六日乙巳，贼陷诸罗。
		'/顺天|1787/1/27~1788/2/10|:清|疑|注=乾隆五十一年十二月初一北路的王作、李同也率众响应，杀淡水同知程峻。又向北攻下新竹竹堑城。林爽文建号「顺天」|注=53年春正月四日丁卯，获贼首林爽文于老衢崎，槛送京师伏诛。北路平。 福康安令人说服当地居民于老衢崎（今苗栗县竹南镇崎顶里一带）生擒林爽文。之后爽文被凌迟斩首',

		'/陈周全/天运|1795/4/19~5/6|:清|疑|君主名=陈周全|卒=1795年|据=Wikipedia|注=Wikipedia: 三月，陈周全结合三千余人趁机起事。三月十日，主要成员为天地会会员的该武装部队攻占鹿港，杀死驻守鹿港的清军水师游击曾绍龙、同知朱慧昌。|注=三月十八日台湾道观察使杨廷理带兵前往斗六，顺利解除斗六的围城危机，随后杨廷理攻下彰化与鹿港两地。陈周全亦在这场战役中被捕，不久即遭清朝处死。',

		// 1862/4/18: 未确认，应于台湾通史/卷33:
		// 同治元年三月初九日，按察使衔台湾兵备道员孔昭慈抵达彰化 ~
		// 十九日夜半"...党人既入城，鼓吹以迎潮春。潮春冠黄巾，穿黄马褂，健卒数十人前后拥，骑马入城，出示安民，令蓄发遵明制。自称大元帅"间。
		'清/戴潮春|1862/4/18~1864/1/29|:清|疑|君主名=戴潮春;戴万生|卒=1864/1/29|据=Wikipedia|注=Wikipedia: 表字万生。4月16日率八卦会党人围攻彰化县城，并从八卦山以大砲轰城。|注=(同治二年十二月二十一日)乘轿至北斗，曰健讯以作乱之故，对曰：“此皆本藩之事，毋与百姓。”曰健怒，命陈捷元推出斩之。',

		'天运/张丙/天运|1832/11/22~1833/2/19|:清|疑|时期=大清|君主名=张丙|君主=开国大元帅|卒=道光13年6月|据=Wikipedia|注=台湾通纪: 道光十二年闰九月，张丙倡乱嘉义，戕知县、知府，围嘉义城，困总兵匝月，破盐水港，劫军火器械于曾文溪，彰化黄城陷斗六门，是为北路贼。……张丙乃遍约所交游，伪称开国大元帅，年号天运，以戕杀秽官为名。|注=张丙用天运年号，其余用奉天、大明主各年号，俱系各自争强，并未互相关会。|注=周凯，《内自讼斋文集》，<记台湾张丙之乱>，页33。道光十二年闰九月十日，阿凛率众焚陈辨屋，又牵他人牛。陈辨约张丙与之鬬。丙…聚众三百人，与陈辨、陈连（按：？－1833）攻双溪口，不胜，反为所伤。闻总兵刘公廷斌出巡，张丙与众潜回店仔口。陈辨、陈连焚掠附近交平诸粤庄，张阿凛焚陈连庄。二十五日，陈辨抢大埔汛防器械；总兵刘公至东势湖（按：今民雄乡东湖村），戮抢猪者二人。北路协副将叶长春与邵令（按：即邵用之？－1832）亦至，夹击陈辨于红山仔。辨走，与王奉合，复攻埔姜仑庄。官兵猝至，斩其党王兴、王泉。辨、奉具窜店仔口（按：今台南县白河镇），白张丙。丙触前忿，谓专杀闽人偏袒；遂与詹通谋反，竖旗起事。」|注=Wikipedia: 攻占台湾县大部分地区与云林斗六门（今斗六）一带',

		{
			// 太平天囯（其中「天」字的两横上长下短；「囯」字内为「王」字）
			data : '太平天囯|1851/2/1~|:清|朝代=太平天国;太平天国|历法=清时宪历|时期=大清|君主=洪秀全|注=太平天历是到壬子二年正月初一日才颁行的。（罗尔纲，太平天国史卷三十二 志第十一 天历 四 天历与夏历阳历对照及简表）没有闰月，惟辛开元年有「又八月初七日」|注=太平天国将地支「丑」、「卯」、「亥」改为「好」、「荣」、「开」。',
			// 干支内名号，因以声音不雅，故为改之。
			fix_太平天囯干支 : function(干支) {
				return 干支.replace(/[丑卯亥]/g, function($0) {
					return {
						丑 : '好',
						卯 : '荣',
						亥 : '开'
					}[$0];
				});
			},
			fix : function(date) {
				var convert = this.fix_太平天囯干支;
				date.岁次 = convert(date.岁次);
				date.月干支 = convert(date.月干支);
				date.日干支 = convert(CeL.to_stem_branch(CeL
						.stem_branch_index(date)));
				date.时干支 = convert(CeL.to_stem_branch(CeL.stem_branch_index(
						date, {
							hour : true
						})));
			}
		},
		{
			data : '太平天囯|1852/2/3~1869/5/28|2/='
					// 18年，每年6循环。每循环单月31天，双月30天。
					+ new Array(18 + 1).join(
							'\t' + new Array(6 + 1).join(';31;30').slice(1))
							.slice(1)
					+ '|朝代=太平天国;太平天国|历法=太平天历|君主=洪秀全|大月=31|注=太平天国纪元根据现存记载应该断到己巳十九年四月十一日（清同治八年四月十七日，一八六九年五月二十八日）陕西保安县老岩窑陷落为止。（罗尔纲，太平天国史卷三十二 志第十一 天历 四 天历与夏历阳历对照及简表）|注=太平天国将地支「丑」、「卯」、「亥」改为「好」、「荣」、「开」。|注=洪秀全（1814年1月1日－1864年6月1日），清末革命领袖，建立太平天国，称天王。原名洪仁坤，小名火秀，又名洪日。1851年建立太平天国时，立洪天贵福为幼主。洪天贵福在1864年（同治三年）6月6日在天京（今江苏南京）即位，成为「幼天王」。',
			fix_太平天囯干支 : function(干支) {
				return 干支.replace(/[丑卯亥]/g, function($0) {
					return {
						丑 : '好',
						卯 : '荣',
						亥 : '开'
					}[$0];
				});
			},
			fix : function(date) {
				var convert = this.fix_太平天囯干支;
				date.岁次 = convert(date.岁次);
				date.月干支 = convert(date.月干支);
				// 吴善中。太平天国天历干支、礼拜提前一天原因考
				date.日干支 = convert(CeL.to_stem_branch(CeL
						.stem_branch_index(date) + 1));
				date.时干支 = convert(CeL.to_stem_branch(CeL.stem_branch_index(
						date, {
							hour : true
						})));

				date.getDay = new Function('return '
						+ ((date.getDay() + 1) % 7));
				// TODO: .getUTCDay()
			}
		},

		'刘明/刘丽川/天运|1853/9/7~1855/3/17|:清|疑|国号=大明|时期=大清|君主名=刘丽川|君主=大明统领政教招讨大元帅|据=Wikipedia|注=Wikipedia: 上海抗清组织「小刀会」首脑。咸丰三年八月初五上午10时，于上海县城北门外，...刘自称「大明国统领政教招讨大元帅」...咸丰五年正月初一日清军自此缺口涌入城内，与小刀会展开巷战，逮捕小刀会头目谢安邦、陈芝，惟存刘丽川率死党奋力逃出上海县，虎嵩林领军追之，至虹桥追至刘予以格毙。',

		// 中华民国成立以后中国君主制政权年号
		'大清/察都/通志|1915/3/16~1916/2/2|:中历|时期=民国|君主名=察都|生=1864年|卒=1915年|疑|据=Wikipedia|注=Wikipedia: 1915年二月，攻占成都驱逐了北洋政府四川都督胡景伊，自立为帝。年号通志，奉大清为宗主国，建都成都。十个月后，北洋政府上将蔡锷攻下成都，枪毙察都，通志政权灭亡，历时一年。',

		// 洪宪帝制
		'中华帝国/袁世凯|1915/12/12~|:CE|时期=民国|君主名=袁世凯;袁项城|表字=慰廷;慰庭;慰亭|君主号=容庵|生=1859年9月16日|卒=1916年6月6日|据=Wikipedia|注=Wikipedia: 民国4年12月12日中华民国大总统袁世凯称帝，预改国号为「中华帝国」，隔年建元「洪宪」；民国5年3月22日取消称帝，恢复民国',
		'/=/洪宪|1916/1/1~3/22|:CE|据=Wikipedia|注=Wikipedia: 1916年3月22日宣布《撤销帝制令》取消帝制。直至袁世凯对内宣布取消帝制都未正式登基，年号洪宪仅在内部流传，对外仍称民国，故袁世凯仍是民国大总统',

		'大清/溥仪/宣统|1917/6/30~7/12|9/=:中历|时期=民国|君主名=爱新觉罗溥仪;溥仪|据=Wikipedia|注=Wikipedia: 民国六年6月30日（宣统九年五月十二日），张勋与陈宝琛等召开「御前会议」，密谋复辟。当天深夜，派兵占据火车站、邮局等要地，并派人劝黎元洪「奉还大政」。宣统九年五月十三日~廿四日 张勋复辟，亦称丁巳复辟。',

		// http://ja.wikipedia.org/wiki/%E5%A4%A7%E5%90%8C_(%E6%BA%80%E5%B7%9E)
		'满洲国/满洲国执政/大同|1932/3/1~|:CE|时期=民国|注=元年3月1日：満洲国建国。満洲国政府布告二で、年号を大同と定める。(満州国建国宣言@国立公文书馆 アジア歴史资料センター)|注=Wikipedia: 元年3月9日：溥仪就任满洲国执政。|注=3年3月1日：満洲国执政・溥仪の満洲国皇帝即位に伴い、康徳と改元。',
		// http://ja.wikipedia.org/wiki/%E5%BA%B7%E5%BE%B3
		// 元年3月1日：溥仪在首都新京南郊杏花村举行登基典礼，改「满洲国」为「大满洲帝国」，改元康德。
		// 12年8月18日：溥仪の退位宣言。満洲国崩壊。
		// この元号に関连して当时の満洲国皇帝（爱新覚罗溥仪）を康徳帝と称すことがある。当初は启运を予定していたが、直前で康徳に変更されている。
		'满洲帝国/康德帝/康德|1934/3/1~1945/8/18|:CE|政权=大满洲帝国;满洲帝国;满洲国|君主名=爱新觉罗溥仪;溥仪|时期=民国|生=1906年2月7日|卒=1967年10月17日|据=Wikipedia|注=Wikipedia: 1934年3月1日，爱新觉罗·溥仪在新京南郊杏花村举行登基典礼，改「满洲国」为「满洲帝国 」，溥仪称帝，改年号「康德」。',

		// 以领导人作为历史分期
		// [[中华民国历史]]
		'中华民国|1912/1/1~' + CeL.era.pass_on.last_day + '|:CE|纪年=民国|时期=民国|参照用',
		'/军政府鄂军都督府/黎元洪|1911/10/10~|:CE|据=Wikipedia|注=武昌起义胜利后第二天即1911年10月11日，革命党即在武昌组建了中华民国军政府鄂军都督府。',
		'/临时政府/孙文|1912/1/1~|:CE|君主=孙中山|君主号=逸仙;日新|据=Wikipedia|注=清朝宣统三年八月十九，革命党人成功发动辛亥革命。隔年阳历元旦，中华民国临时政府在南京成立|注=1911年12月29日，各省都督府代表联合会代表在南京召开中华民国临时大总统选举会，选举孙文为中华民国临时大总统。1912年1月1日，孙文在南京就任临时大总统。|注=中华民国建国时官方认定黄帝纪元，清末辛亥年（孔子纪元2462年，西元1911年）为黄帝纪元4609年。|注=民国纪年采公元纪月日。',
		'/临时政府/袁世凯|1912/3/10~|:CE|据=Wikipedia|注=2月13日，袁世凯通电共和，根据南方独立各省及部分革命党人的意愿，孙文提出辞职咨文，准备将大总统一职让位给袁世凯。2月15日，在临时大总统选举中，南京临时参议院选举袁世凯为临时大总统，袁世凯于3月10日在北京宣誓就职',
		'=/北洋政府|1913/10/6~|:CE|据=Wikipedia|注=北洋政府于1913年10月6日袁世凯当选为首任中华民国大总统后正式形成',
		'/国民政府|1928/12/29~|:CE|据=Wikipedia|注=1928年12月29日，奉系领袖张学良除下五色旗、改挂青天白日满地红，并通电南京，表示接受国民政府管辖，史称东北易帜。|注=1947年12月25日行宪，《中华民国宪法》生效，废除国民政府主席一职，以总统取代|注=1948年5月20日，中华民国国民大会依循《中华民国宪法》间接选举选出的第一任总统、副总统正式就职，国民政府即改组为中华民国政府',
		// [[台湾战后时期]], [[中华民国在台湾]]
		'/蒋中正|1948/5/20~|:CE|据=Wikipedia|君主字=介石|生=1887年10月31日|卒=1975年4月5日|注=蒋介石幼名瑞元，谱名周泰，学名志清',
		// [[中华民国总统]], [[1949年#12月]]
		'/李宗仁|1949/1/21~|:CE|据=Wikipedia|君主字=德邻|生=1891年8月13日|卒=1969年1月30日|注=1948年年底，国共内战国军节节败退，各方逼迫蒋下野之声不断。1949年1月19日，蒋约见李宗仁商谈时局，表示引退。1月21日，李宗仁宣布就代总统职代行职权，声明愿就毛泽东所提八项条件即行开始商谈；旋即下令撤销总动员令，停止戒严法之实施，改各剿匪总司令部为长官公署，并释放政治犯。|注=1949年12月7日，中国人民解放军彭德怀、徐向前等部入四川北部，会合林彪、刘伯承等部，对成都采取大包围形势。成都外围展开激战。蒋介石指示阎锡山作好当晚离开成都之准备。蒋立即决定中华民国政府迁移台北，指示行政院召开紧急会议。是晚8时，行政院举行会议，通过国府迁设台北，随即发布「总统令」：「政府迁设台北，并在西昌设大本营，统率陆海空军在大陆指挥作战。此令。」成都设置防卫司令部。胡宗南接防成都市区。12月10日蒋中正带著儿子蒋经国，从成都凤凰山机场起飞往台湾，下午飞返台北，从此台海两岸分治，蒋中正再也没回到中国。|注=中华民国台湾省政府主席兼台湾省警备总司令陈诚于1949年5月19日颁布的戒严令，内容为宣告自同年5月20日零时（中原标准时间）起在台湾省全境实施戒严|注=国共战争国民党战败后，1949年11月20日李宗仁以治病为由，宣布中枢军政由行政院院长阎锡山负责，12月5日到美国治病，代行总统职权止于1950年3月1日总统蒋中正复行视事。',
		'/蒋中正|1950/3/1~|:CE|据=Wikipedia|注=蒋中正复行视事后，李宗仁并未就职副总统，并指蒋复职为违宪，后1954年3月10日由国大代表弹劾李宗仁去职。',
		'/严家淦|1975/4/6~|:CE|据=Wikipedia|君主字=静波|生=1905年10月23日|卒=1993年12月24日|注=1975年4月5日，蒋中正病逝，依中华民国宪法规定，由副总统严家淦继任总统。4月6日上午11时，严家淦宣誓就任总统。',
		// [[解严纪念日]], [[民主化时期]]
		'/蒋经国|1978/5/20~|:CE|据=Wikipedia|君主字=建丰|生=1910年4月27日|卒=1988年1月13日|注=1987年7月15日中华民国政府解除「台湾省戒严令」。该戒严令自1949年5月19日颁布，次日开始行使',
		'/李登辉|1988/1/13~|:CE|生=1923年1月15日',
		'/陈水扁|2000/5/20~|:CE|生=1950年10月12日',
		'/马英九|2008/5/20~|:CE|生=1950年7月13日',
		'/蔡英文|2016/5/20~2024/5/19|:CE|生=1956年8月31日',

		// [[中华人民共和国历史]]
		// 中央领导集体的核心
		'中华人民共和国/毛泽东|1949/9/21~|:CE|生=1893年12月26日|卒=1976年9月9日|君主字=润之|据=Wikipedia|注=1949年9月21日，中国人民政治协商会议第一届全体会议正式宣布成立中华人民共和国。「中华人民共和国的纪年采用公元，今年为一九四九年」|注=1949年10月1日，在北京天安门广场举行开国大典',
		'/邓小平|1978/12/18~|:CE|生=1904年8月22日|卒=1997年2月19日在北京病逝|君主名=邓先圣;邓希贤|据=Wikipedia|注=中国共产党第十一届中央委员会第三次全体会议，简称中共十一届三中全会，于1978年12月18日至12月22日在北京举行。',
		'/江泽民|1997/3/27~|:CE|生=1926年8月17日',
		'/胡锦涛|2002/11/15~|:CE|生=1942年12月25|注=江泽民等人在中共十六大上退出中央政治局和中央委员会，2002年11月让位给由新任总书记胡锦涛率领年轻的“第四代”领导集体。不过，江泽民依然在发挥影响力，并直到2004年底才辞去中央军委主席，交出军权。',
		'/习近平|2012/11/15~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|生=1953年6月15日|注=2012年11月中共十八届一中全会上当选中国共产党中央委员会总书记及中国共产党中央军事委员会主席。中共第十七届和第十八届中央政治局常务委员会委员、第十七届中央书记处书记。2013年3月第十二届全国人民代表大会第一次全体会议上当选中华人民共和国主席及中华人民共和国中央军事委员会主席。'

]).minute_offset = 8 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"ryukyu"}
(CeL.era.pass_on.countries["琉球"] = [
		// 御主加那志、御主加那志前(御主/ウス)是琉球国中山王在国内的称号。
		// 外交文件《历代宝案》, 正史《中山世鉴》, 蔡温本《中山世谱》, 《球阳记事》

		// 据=中山世谱/卷03
		// http://archive.library.pref.okinawa.jp/?type=book&articleId=50435
		'舜天王朝/舜天|1187/2/10~|:南宋|精=年|传说|国名=流虬;流求;琉球;琉球国;琉球王国;冲縄;冲绳|据=中山世谱/卷03|朝代=舜天王统|神号=尊敦|生=宋乾道二年|卒=宋嘉煕元年|注=南宋淳煕年间，天孙氏二十五纪之裔孙徳微政衰，其臣利勇专权没，遂自弑君簒位。(球阳记事/卷之一:宋淳煕七年 权臣利勇专权，遂自弑君篡位)\n时浦添按司尊敦，倡义起兵，以讨利勇。国人推戴尊敦，以就大位，是为舜天王。|注=球阳记事/卷之一: 本国用夏正，自舜天王而然也欤。故《世谱》云：舜天王乾道二年丙戌降诞，淳熙十四年丁未即位。俗说徃右，以建未用为正。盖谷能养人，此月旧谷已遂，新谷和登，由是本国以六月为正月云尔。由是考之，本国用夏正自此而始',
		'/舜马顺熙|1238/1/18~|:南宋|精=年|传说|君主=舜马顺煕;舜马顺熈|神号=其益美|生=宋淳煕十二年|卒=宋淳祐八年',
		'/义本|1249/1/16~|:南宋|精=年|传说|生=宋开禧二年',

		'英祖王朝/英祖|1260/2/13~|:中国|精=年|疑|国名=瑠求|朝代=英祖王统|神号=英祖日子|生=宋绍定二年|卒=元大徳三年八月初五',
		'/大成|1300/1/23~|:中国|精=年|疑|生=南宋淳祐七年|卒=元至大元年十二月初八日',
		'/英慈|1309/2/11~|:中国|精=年|疑|生=南宋成淳四年|卒=元皇庆二年九月二十日',
		'/玉城|1314/1/17~|:中国|精=年|疑|生=元元贞二年|卒=元顺帝至元二年三月十一日',
		'/西威|1337/2/1~|:中国|精=年|疑|生=元致和元年|卒=元至正九年四月十三日|注=《中山世鉴》西威在位十四年\n中山世谱/卷03 西威在位十三年，寿二十二。',

		'中山王国/察度|1350/2/7~|:中国|精=年|疑|时期=三山时代|朝代=中山王国;察度王朝;察度王统|神号=大真物;大真物|生=元至治元年|卒=明洪武二十八年十月初五日',
		'/武宁|1396/2/10~1406/1/19|:中国|精=年|疑|神号=中之真物|生=元至正十六年',

		// 据=中山世谱/卷04;Wikipedia
		'山北王国/怕尼芝|1322/1/18~|:中国|精=年|疑|时期=三山时代|朝代=北山王国;北山王国;怕尼芝王朝;怕尼芝王统|注=前一代山北王: 今归仁|注=「おもろさうし」によれば、従兄弟の子で山北王である今帰仁按司を讨ち、自ら山北王となったと言われている。\n文献では帕尼芝の在位は1322年から1392年もしくは1395年まで70年以上に渡るとされ、実际は亲子数代で同じ名を使っていたのではと考察されている。名の由来が羽地按司であれば、その称号を使い続けたと考えられる。|注=1322年宣布脱离中山的统治，自称北山王，割据冲绳本岛北部自立。|注=中山世谱/卷04: 起元延祐年间，尽明永乐四年(14年?)丙戌。凡四主，歴九十余年。',
		'/珉|1396/2/10~|:中国|精=年|疑|注=中山世谱/卷04: 珉【在位五年】|注=中山世谱: 明洪武二十九年丙子 山北王珉薨 其子攀安知立 (山北王怕尼芝薨 其子珉立??) 受封于朝 遣使入贡',
		'/攀安知|1401/1/15~1417/1/17|:中国|精=年|疑|注=攀安知や怕尼芝は、个人名ではなくいずれも王统名「羽地」の汉字音訳。|注=明永乐十四年，尚思绍王在羽地按司的劝说下，派世子巴志攻击北山国。|注=中山世谱/卷04: 攀安知【在位二十一年】\n起元延祐年间，尽明永乐四年(14年?)丙戌。凡四主，歴九十余年。',

		'山南王国/承察度|1337/2/1~|:中国|精=年|疑|时期=三山时代|朝代=南山王国;南山王国;大里王朝;大里王统|注=承察度は、大里（うふさと）の当て字と考えられている。北山王国の怕尼芝と同様、亲子数代で同じ名を袭名したと考えられる。|注=前一代山南王: 大里|注=中山世谱/卷04: 十五年丁酉，王及世子尚巴志并山南王他鲁毎\n起元延祐年间，尽明宣徳四年己酉。凡四主，歴一百余年。',
		'/汪英紫|1398/1/19~|:中国|精=年|疑|生=元至正十六年|注=1397年，汪英紫与丰见城按司汪应祖（汪英紫的次子）、佐敷按司巴志合谋，围攻南山国的都城岛尻大里城（今冲绳县今糸满市北部）。承察度兵败出奔。\n汪英紫本人并未称王。但是承察度战败出奔之后，山南国出现了一段王位空缺时期。',
		'/汪应祖|1403/1/23~|:中国|精=年|疑',
		'/达勃期|1414/1/22~|:中国|精=年|疑|注=中山世谱/卷04: 永乐十二年，谋弑应祖纂位。【汪应祖在位十一年】各寨官并诸按司合兵诛达勃期，推应祖之长子他鲁毎摄国事。',
		'/他鲁每|1415/2/10~1430/1/23|:中国|精=年|疑|君主=他鲁毎|注=名の他鲁毎は、琉球名「太郎思い（たるもい）」の当て字と考えられている。|注=中山世谱/卷04: 他鲁毎【在位二十五年】|注=他鲁每于1429年发兵讨伐中山。尚巴志将其击败，并乘胜攻占他鲁每的居城岛尻大里城，他鲁每被俘处死，南山王国也同时灭亡。',

		// 据=中山世谱/卷04
		// 《中山世鉴》洪武十六年、更流求曰琉球、赐以金符印、宠以章服。
		'第一尚氏王朝/尚思绍|1406/1/20~|:明|精=年|疑|神号=君志真物|朝代=第一尚氏王统|卒=明永乐十九年',
		'/尚巴志|1422/1/23~1440/2/2|:明|疑|神号=势治高真物;势治高真物|生=明洪武五年|卒=明正统四年四月二十日薨',
		// 据=中山世谱/卷05
		'/尚忠|1440/2/3~|:明|疑|生=明洪武二十四年|卒=明正统九年十月二十四日',
		'/尚思达|1445/2/7~|:明|疑|神号=君日|生=永乐六年|卒=明正统十四年十月十三日',
		'/尚金福|1450/1/14~|:明|疑|神号=君志|生=明洪武三十一年|卒=明景泰四年四月十八日',
		'/尚泰久|1454/1/29~|:明|疑|神号=那之志与茂伊|君主=大世主|生=明永乐十三年|卒=明天顺四年六月初五日',
		'/尚德|1461/2/10~|:明|疑|神号=八幡之按司|君主=世高王|生=明正统六年|卒=明成化五年四月二十二日',

		// 据=中山世谱/卷06
		'第二尚氏王朝/尚圆|1470/2/1~|:中国|疑|朝代=第二尚氏王统|君主=金丸|神号=金丸按司添末续之王仁子|童名=思徳金;忠徳金|生=明永乐十三年|卒=明成化十二年七月二十八日|注=父尚稷王、明宣徳九年卒。母瑞云|注=中山世谱/卷06: 尚稷王 妃：瑞云【童名不传。洪武二十九年丙子生，宣徳九年甲寅二月初二日卒。葬于叶壁陵】\n康煕三十八年二月初七日，以正统王祖之重，追尊称王，奉祀于圆覚寺宗庙。|注=天保3年11月 源直温 改编本 中山世谱: 童名：忠徳金',
		'/尚宣威|1477/1/15~|:明|疑|谥=义忠|神号=西之世主|生=明宣徳五年|卒=明成化十三年八月初四日|注=在位六个月，退隐于越来。',
		'/尚真|1477/8/9~|:明|疑|童名=真加戸樽金|神号=于义也嘉茂慧|生=成化元年|卒=明嘉靖五年十二月十一日|注=尚宣威王在位六个月退隐',
		// 据=中山世谱/卷07;天保3年11月 源直温 改编本 中山世谱
		'/尚清|1527/2/1~|:明|疑|童名=真仁尭樽金|神号=天续之按司添|生=明弘治十年|卒=明嘉靖三十四年六月二十五日',
		'/尚元|1556/2/11~|:明|疑|君主=久米中城王子|神号=日始按司添|生=明嘉靖七年|卒=明隆庆六年四月初一日',
		'/尚永|1573/2/2~|:明|疑|君主=日丰操王;阿应理屋恵王子|神号=英祖仁耶添按司添|生=嘉靖三十八年|卒=明万暦十六年十一月二十五日|注=尚懿生尚宁王。【称浦添王子】其母乃尚永王之妹，名称首星大君加那志，号一枝【详载附巻】时尚永王无嗣，故尚宁王奉命，入继大统。',
		// 此后之月日部分应该参照日本的历法？
		'/尚寜|1589/2/15~|:明|疑|童名=思徳金|神号=日贺末按司添|生=嘉靖四十三年|卒=明万暦四十八年九月十九日|注=天保3年11月 源直温 改编本 中山世谱: 童名：思徳金|注=庆长己酉，萨州太守家久公，遣桦山权左卫门尉、平田太郎左卫门尉，率兵征伐琉球，而擒国王返。',
		// 据=中山世谱/卷08;天保3年11月 源直温 改编本 中山世谱
		'/尚丰|1621/1/22~|:明|疑|童名=思五郎金|神号=天喜也未按司添|生=万暦十八年庚寅十一月十三日|卒=明崇祯十三年五月初四日',
		'/尚贤|1641/2/10~|:明|疑|童名=思松金|生=明天启五年九月十五日|卒=顺冶四年九月二十二日',
		'/尚质|1648/1/25~|:中国|疑|童名=思徳金|生=崇祯二年己巳八月十五日|卒=康煕七年十一月十七日',
		'/尚贞|1669/2/1~|:中国|疑|童名=思五郎金|生=顺治二年乙酉十二月初六日|卒=康煕四十八年己丑七月十三日|注=尚纯王以世子薨，未及即位。止以正统之重，追尊称王。故王统图中，不敢称王\n世子 童名：思徳金 顺治十七年庚子正月初五日降诞。',
		// 据=中山世谱/卷09
		'/尚益|1710/1/30~|:清|疑|童名=思五郎金|生=康煕十七年戊午十月二十五日|卒=大清康煕五十一年七月十五日|注=康熙己丑十一月十八日，尚益王即位。',
		'/尚敬|1713/1/26~|:清|疑|童名=思徳金|生=康煕三十九年庚辰六月十九日|卒=乾隆十六年正月二十九日',
		// 据=中山世谱/卷10
		'/尚穆|1752/2/15~|:清|准=2日|童名=思五郎金|生=乾隆四年己未三月二十六日|卒=乾隆五十九年甲寅四月初八日|注=尚哲王以世子薨，未及即位。止以正统之重，追尊称王。故王统图中不敢称王\n世子 童名：恩徳金。乾隆二十四年己卯五月初六日降诞。',
		'/尚温|1795/1/21~|:清|准=2日|童名=恩五郎金|生=乾隆四十九年甲辰二月初一日|卒=嘉庆七年七月十一日',
		'/尚成|1803/1/23~|:清|准=2日|童名=思徳金|生=嘉庆五年庚申十月十八日|卒=嘉庆八年十二月二十六日',
		// 据=中山世谱/卷11
		'/尚灏|1804/2/11~|:清|准=2日|童名=思次良金|生=乾隆五十二年丁未五月二十九日|卒=道光十四年甲午五月二十九日',
		// 据=中山世谱/卷12
		'/尚育|1835/1/29~|:清|准=2日|童名=思真蒲戸金;思徳金|生=嘉庆十八年癸酉七月二十四日|卒=大清道光二十六年九月十七日|注=大清道光八年戊子，因尚灏王染病，世子尚育摄位。十五年乙未即位。',
		// 据=中山世谱/卷13
		'/尚泰|1848/2/5~1879/4/4|:清|准=2日|童名=思次良金|生=道光二十三年癸卯七月初八日|卒=明治34年8月19日因急性黏膜炎死于东京|注=世子尚典童名：思徳金。同治三年甲子八月初二日降诞。|注=自1876年起，琉球国废除清朝年号，改用日本年号。|注=元来、琉球は萨摩藩の附庸国かつ清の朝贡国として一定の独自性を保っていたが、他府県の廃藩置県も済んだ翌年の1872年（同治11年、明治5年）に、日本は琉球国王尚泰を琉球藩王に封じて华族とし、东京に藩邸を与えた。そうして1879年（光绪5年、明治12年）の琉球処分により琉球藩に冲縄県が设置されると、藩王の地位は无くなり居城の首里城も出ることとなり、琉球藩は消灭した。尚泰たちは琉球王家の屋敷の一つ中城御殿に移ったが、明治政府より东京移住を命令され、华族として东京へ居を移した。|1879年4月4日日本在琉球设立冲绳县，以锅岛直彬为第一任知事，史称第二次琉球处分。尚泰被迁出首里城，迁往中城御殿暂时居住。日本要求旧琉球藩王尚泰前往东京，但尚泰称病不往。5月27日，尚泰亦乘坐「明治丸」号自那霸港出发，经鹿儿岛、神户、横滨，于6月9日至东京，会见明治天皇。',

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"japan"}
(CeL.era.pass_on.countries["日本"] = [
		// Japan: 中国农历日期和韩国农历日期也不一致。日本从1685年开始，就自行编制农历，一直到明治六年。

		'日本书纪|-660/2/18~|-660/=46i 59l 3qub505 3psr47m 59m 4g4o579 47m 4ok43oq 579 3qs147p 39zu42y 59h 3que47p 42y 4of659m 3quj579 47e 4ojs59m 579 3ql047o 4okc42y 591 3qu147p 42y 4o1359l 47p 3mmr46i 4oiz59m 505 3pso47m 59m 4g4l579 47m 4ok13oq 4mg959h 47p 39zq42y 59h 3qub47p 3mn047e 59m 3qug505 47e 4ojo59m 505 3qkx47o 4oka3oq 591 3qty47p 3oq 4o0y59l 3quj47p 46i 4oiw59m 47p 3psk47m 59m 3qu9579 3qsa47o 59m 4mg759h 47o 4ok342y 4off59l 47p 3mmw47e 59l 3qud505 47e 4oip59m 4g4p591 47m 4ok63oq 591 3qs347p 39zw46i 59h 3qug47p 46i 4of859m 47p 3psh47e 4oju59m 579 3qs647o 59m 4mg259h 3qu447p 42y 4ofd59l 47p 3mmt47e 59l 3qu9505 3ql647m 59m 4g4n591 47m 4ok33oq 4o1759h 47p 39zs46i 59h 3qud47p 46i 4of559m 3quh579 47e 4ojq59m 579 3qkz47o 4okc42y 591 3qu047p 42y 4o1059l 47p 3mmp46i 4oiy59m 505 3psm47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojn59m 4g4r591 47o 4ok83oq 591 3qtx47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs847o 59m 4mg559h 47p 39zm42y 4ofe59m 47p 3mmu47e 59m 3qub505 3ql847o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu46i 59l 3quf47p 46i 4oir59m 3quj579 47m 4ojs59m 579 3qs547o 59m 4mg259h 3qu247p 42y 4ofa59l 47p 3mms47e 4oj059m 505 3ql447m 59m 4g4l591 47m 4ok23oq 4o1659h 47p 39zq46i 59h 3qub47p 3pss47e 59m 3quh579 47e 4ojp59m 579 3qkx47o 4oka42y 591 3qtz47p 42y 4o0z59l 3quj505 46i 4oiw59m 505 3psm47m 59m 4g4i579 3qsa47p 3oq 4mg759h 47p 39zo42y 4ofg59m 47p 3pso47e 59m 3qud579 47e 4ojm59m 4mgb591 47o 4ok742y 591 3qtv47p 3mn046i 59l 3quh505 46i 4oit59m 505 3psh47m 4oka3oq 579 3qs747p 3oq 4mg359h 3quj47p 42y 4ofd59m 47p 3mmu47e 59m 3qua505 3ql647o 59m 4g4n591 47o 4ok43oq 4o1859l 47p 39zs46i 59l 3qud47p 46i 4oiq59m 3quj579 47m 4ojr59m 579 3qs347o 4okc42y 59h 3qu147p 42y 4of959l 47p 3mmp47e 4oiz59m 505 3ql447m 59m 4g4k591 3qsc47p 3oq 4o1559h 47p 39zq46i 59h 3qua47p 3psq47e 59m 3quf579 47m 4ojo59m 4mgc59h 47o 4ok842y 59h 3qtx47p 42y 4of659l 3quj505 47e 4oiv59m 505 3qkz47m 4okc3oq 591 3qs947p 3oq 4o1159h 47p 39zm46i 4off59m 47p 3pso47e 59m 3quc579 3ql847o 59m 4mg9591 47o 4ok642y 591 3qtu47p 3mmy46i 59l 3quf505 46i 4ois59m 4g4s579 47m 4ok93oq 579 3qs547p 3oq 4mg259h 3quj47p 42y 4ofb59m 47p 3mms47e 59m 3qu9505 3ql547o 59m 4g4l591 47o 4ok23oq 4o1759l 47p 39zs46i 59l 3quc47p 3pss47m 59m 3quh579 47m 4ojq59m 579 3qs247p 39zu42y 59h 3quf47p 42y 4of859m 47p 3mmp47e 4ojt59m 505 3ql147o 59m 4g4j591 3qu347p 3oq 4o1359l 47p 39zo46i 59l 3qu947p 3psp47m 59m 3qud579 47m 4ojm59m 4mgb59h 47o 4ok842y 59h 3qtw47p 3mn047e 59l 3quh505 47e 4oiu59m 505 3qky47m 4oka3oq 591 3qs747p 3oq 4o1059h 47p 39zl46i 4ofd59m 47p 3psm47e 59m 3qub579 3ql747o 59m 4mg7591 47o 4ok442y 591 3qtt47p 3mmy46i 59l 3que505 46i 4oiq59m 4g4r579 47m 4ok83oq 579 3qs447n 39zw42y 59h 3quh47p 46i 4ofa59m 47p 3psi47e 4oju59m 579 3ql447o 59m 4mg5591 47o 4ok142y 4o1559l 47p 3mmu46i 59l 3qub505 3psr47m 59m 4g4n579 47m 4ok43oq 579 3qs147p 39zu42y 59h 3que47p 42y 4of659m 3quj505 47e 4ojs59m 505 3ql047o 4okc3oq 591 3qu147p 3oq 4o1259l 47p 39zn46i 4oiz59m 47p 3pso47m 59m 3qud579 47m 4ojl59m 4mg959h 47o 4ok642y 59h 3qtv47p 3mmz47e 59l 3quf505 47e 4ois59m 505 3qkx47m 4oka3oq 591 3qs647p 3oq 4o0y59h 3quj47p 46i 4ofc59m 47p 3psk47m 59m 3qu9579 3qsa47o 59m 4mg759h 47o 4ok342y 4off59l 47p 3mmw47e 59l 3qud505 47e 4oip59m 4g4p591 47m 4ok63oq 591 3qs347p 39zv46i 59h 3quf47p 46i 4of859m 47p 3psh47e 4oju59m 579 3ql247o 59m 4mg2591 3qu447p 42y 4o1459l 47p 3mms46i 59l 3qu9505 3psq47m 59m 4g4n579 47m 4ok33oq 4mgb59h 47p 39zs42y 59h 3qud47p 42y 4of559m 3quh505 47e 4ojq59m 505 3qkz47o 4okc3oq 591 3qu047p 3oq 4o1059l 47p 39zm46i 4oiy59m 47p 3psm47m 59m 3qub579 3qsc47p 3oq 4mg859h 47p 39zo42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojn59m 4g4r591 47o 4ok83oq 591 3qtx47p 3oq 4o0x59l 3quh47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs847o 59m 4mg559h 47o 4ok242y 4ofe59l 47p 3mmu47e 59l 3qub505 3ql847m 59m 4g4o591 47m 4ok53oq 591 3qs147p 39zu46i 59h 3quf47p 46i 4of759m 3quj579 47e 4ojs59m 579 3ql147o 59m 4mg1591 3qu147p 42y 4o1359l 47p 3mms46i 4oj059m 505 3pso47m 59m 4g4l579 47m 4ok23oq 4mga59h 47p 39zq46i 59h 3qub47p 3pss47e 59m 3quh579 47e 4ojp59m 579 3qkx47o 4oka42y 591 3qtz47p 42y 4o0z59l 3quj505 46i 4oiw59m 505 3psl47m 59m 4g4h579 3qsa47p 3oq 4mg759h 47p 39zo42y 4ofg59m 47p 3mmw47e 59m 3qud505 47e 4ojm59m 4g4q591 47o 4ok63oq 591 3qtv47p 39zw46i 59l 3quh47p 46i 4oit59m 47p 3psh47m 4oju59m 579 3qs747o 59m 4mg359h 3qu447p 42y 4ofd59l 47p 3mmu47e 59l 3qua505 3ql647m 59m 4g4n591 47m 4ok43oq 4o1859h 47p 39zs46i 59h 3qud47p 42y 4of659m 3qui505 47e 4ojq59m 505 3qkz47o 4okc42y 591 3qu147p 42y 4o1159l 47p 3mmp46i 4oiz59m 505 3psn47m 59m 4g4j579 3qsc47p 3oq 4mg959h 47p 39zp42y 59h 3qu947p 3mmy47e 59m 3quf505 47e 4ojo59m 4g4s591 47o 4ok83oq 591 3qtx47p 3oq 4o0y59l 3qui47p 46i 4oiu59m 47p 3psj47m 4ojw59m 579 3qs947p 3oq 4mg559h 47p 39zm42y 4off59m 47p 3mmv47e 59m 3qub505 3ql847o 59m 4g4p591 47o 4ok53oq 591 3qtt47p 39zu46i 59l 3quf47p 46i 4ois59m 3quk579 47m 4ojs59m 579 3qs547o 59m 4mg259h 3qu247p 42y 4ofa59l 47p 3mms47e 4oj059m 505 3ql447m 59m 4g4l591 47o 4ok23oq 4o1759l 47p 39zr46i 59l 3qub47p 3pss47m|传说|参照用|注=base: 日本书纪暦日原典 (内田正男)',
		// 旧暦 1947闰月: HuTime != こよみのページ.
		// http://www.hutime.jp/basicdata/calendar/calendars/OldJapanese.html
		// HuTime: 神宫司厅 『神宫暦』（小暦）
		// （昭和24年～）昭和22年は、新暦4月21日同日に朔（13时19分）、中気（谷雨）（7时40分）があります。通常、朔と中気が同日の场合は时刻の前后にかかわらず新たな朔望月に中気が入れられるため、2月、闰2月の顺で、新暦4月21日からの朔望月は3月となります。しかしながら、この年は例外的に中気（谷雨）を前の朔望月に入れ、2月、3月の顺で、新暦4月21日からの朔望月を闰3月としています（大暦、小暦とも同じ）。通常とは异なりますが、『神宫暦』の表记に従います。
		'旧暦|593/2/7~2071/1/30|593/=59m 3quh579 47m 4ojp59m 579 3qs147o 4oka42y 59h 3qtz47p 42y 4of759l 3quj505 47e 4oiw59m 505 3ql147m 59m 4g4i591 3qsa47p 3oq 4o1359h 47p 39zo46i 4ofg59m 47p 3pso47e 59m 3qud579 47e 4ojm59m 4mgb59h 47o 4ok742y 59h 3qtv47p 3mn047e 59l 3quh505 47e 4oit59m 505 3qkx47m 4oka3oq 591 3qs747p 3oq 4o0z59h 3quj47p 46i 4ofd59m 47p 3psm47e 59m 3qua579 3ql647o 59m 4mg7591 47o 4ok442y 4o1859l 47p 3mmw46i 59l 3qv9505 46i 4oiq59l 4mu44h0 5es 3t6v52s 506 3pt04zu 5s9 3z4h4i0 4t943u1 3p1 31li3me 576 55425sh 408b4ia 3u2 3a93439 42u 4nys59g 5uq 408x4i4 3rd550q 46t 3mmu47e 5d0 4uqb4a0 4pln3px 3fu 4g4n579 47e 4sgz5e9 49w 4ppd3q1 38ex42y 591 3x3p4gy 5ea 3t4z4aa 3b6247u 42y 4o145r9 4h0 4t505ed 33x83hw 50a 4f3e4zu 5s9 3z864i8 5ew 4ihf3p0 4mh7592 56y 55485eq 44x 3bid5ew 59x 380h3o6 4o0p59e 5t0 3tz95as 48a 3a1v4vp 3d1747e 5e0 57d35uw 5as 3ret50q 505 3qkx4ei 4sh65e9 4a8 4pom5at 3n0 4mg258z 3yos4gy 5ea 3t534ac 449 3mn842y 59h 3fpt4h0 43ux5es 52s 3qzb3fe 4zu 42ar5s9 3xng4i0 4mg 4ihj3p0 57e 4m7958y 5s9 400h4i9 3ep53u1 3p1 37x342t 58y 55b75uq 40984ic 48a 3mw84z9 46g 5dp05dw 5us 40aq5as 3rca50q 46l 3mly47d 4h0 4upv5go 4ja43p0 50a 4g4o578 5s8 5elg4lt 3vt 3b1e3px 38ey42y 591 3qs749u 5ea 3rcz48i 3b1n47p 46i 4oft3t0 5us 4pl15es 48k 3npd505 3psq47e 5s9 3swm4aw 5bc 4gwj3os 4mho3o5 58y 55bc5e9 4b5 3bj93u2 3ot 37wy42t 4nyy59g 5gi 3txi4b8 48a 3mw44z9 3prw47d 5ac 4uq05go 5as 4gnp3fu 505 3psh47e 4shn3tf 3hl 3b1j3px 3my 4mgz591 3sd84gy 5ea 3t534aa 449 3mmt42y 59h 3z2p4h0 4t555es 4ac 3qyv506 46i 54835s9 3z8c4i9 3u0 4ihk3p0 57a 4fv958y 5sh 400i4i9 3ep648i 3p1 380n42t 58y 55c35uq 40985as 48a 3mw8505 46i 4oet5dw 5us 40aq5as 4gnu3oq 505 3ql34ga 5e1 3swj4a1 3b4s3q1 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0 5es 3t504ac 3qz0506 46i 54895s9 4h4 4t515ew 52s 4g8y57a 4fve58y 5sh 400m4i9 3u1 33xg3p1 39lo42t 590 55c95uq 4ia 3rd148a 439 3mmp46i 4oga5dw 5us 4pl35as 50q 4fc3505 3ql847e 5e1 3swo4a1 3px 32513oq 579 3qkx4gi 4sp65ea 4aa 3b53449 42y 4o105np 3z304h0 5es 3t6w52s 44a 3mna4zu 5r9 3z4i4i0 4t963u0 52s 4g9j3mi 577 3qk347l 4i9 3eoh3u1 3a953p1 3oa 4mg5590 5ua 40824ia 3rd648a 439 3mmv46i 59g 57b75uw 5as 3rcx50q 4g4p579 47e 4sdh5e1 4a0 4poy3q1 32563oq 579 3qs74gi 5e9 3t444aa 3b5847u 42z 39h546d 4gy 4sp15es 4ac 3nsy50a 3mp64zv 46h 3z4m4i0 5ew 4ih059w 4g9o3mi 577 3ql547l 4i9 3eol3u1 3p1 380i3oq 4o2259g 5ua 40874ic 48a 3a90445 3mn046i 59h 3st54a0 5as 3rd250q 505 3psi47e 4si25e1 4a0 4pp33qh 3ho 4g4k579 3wws4gi 5e9 3t484b6 3q1 3a1y431 3o5 4nyq4gy 4t3e5gk 4b8 3nt350a 431 3mic47d 4h0 4t4x5go 4ih559w 50a 4f52577 47d 400i4i9 3eq2489 3p1 380n3oq 591 3qs349u 4i9 3rcx48a 3a95445 42y 4o125d1 49w 4pky5as 3rm252k 505 3pzr47e 5e1 3swk4a0 4q3g3qh 3os 4g5l591 576 4sh15e9 4b5 3bj73qh 3a2y431 3o5 4nyv59e 5eq 3txg4b8 48a 3mox46l 3mjd47d 59g 4upx5go 53o 3rcz50a 4g5m579 47d 4pav4lt 3vs 4plg3px 38f042y 591 3qsa49u 4lt 3sxy48i 3px 39zm42y 4o225d1 4h0 4pl35b8 48k 3npg505 3pss47e 5s9 3z9k4aw 5bc 4ihi3os 506 4fv758y 558q47l 4b5 3bjb3u1 3p1 37x142t 58y 55c15gi 3txl4b8 48a 3mw646l 46h 4oeq59g 4uru4a0 5as 3rk750q 505 3psk47d 5e1 3g9e4a0 4pll3px 3my 4mg6591 49e 4so25e9 3t564aa 3q1 3a6v42y 59h 3yok4h0 5ec 3t4x4ac 3nt5506 46i 54865s9 4h4 4t4z5ew 4iiy438 506 4g2f58y 5s9 400k4i9 3u1 3a8x3p1 37x542t 58y 55c55uq 4b6 3epv48a 3mx6505 46i 4opz5ac 5us 40as5as 50q 3mw1505 3psq47e 5e1 3swm4a0 5as 4gnn3oq 4mh6591 4gi 4so75e9 4aa 3b51449 3oq 4o0x59h 3z2y4h0 5es 3t524ac 47u 3mn746i 548b5s9 4h4 4t933u0 52s 4g9157a 4zu 55415sh 40214i9 3u1 3a923p1 3mi 4mdu58y 55fu49u 4ia 3eq048a 439 3mms46i 59g 57b55us 40ax5as 50q 4c6e505 47e 4of65e1 3sy24a0 5ax 32543oq 56d 3ql14gi 5e9 3swx4aa 3b61449 42y 4o135np 4gy 4soz5es 3t574ac 47u 3mnc46i 5r9 3z4k4i0 5ew 3t6q52s 4g9m3mi 4zv 3qjq5sh 4i0 4t8z3u1 3a973p1 3oa 4mg8590 5ua 40844ia 48a 3a8y439 3mmy46i 59g 57ba5us 5as 3rcz50q 4g4r505 47e 4rl55e1 4a0 4plh3q1 3fw 4g4h579 3ql64gi 5e9 3sx24aa 3q1 3a1f42z 39gr5r9 4gy 4sp35es 4ac 3nt147u 431 3mi946d 3z624i0 5ew 3t6u59w 50a 4f4z577 3qjw5sh 4i8 4t943u1 3p1 31p13oq 579 3qkh5ua 408b4ia 48a 3a93439 42y 4o0z59h 49u 408x5as 3rd450q 505 3psl47e 5dx 3ssx4a0 4pp53q1 3ho 4g4n579 47e 4sgz5e9 3t4b4b6 3q1 3a20431 3o5 4nys4gy 5ea 3txe4b8 3nt647u 431 3mie46h 4h0 4t4z5go 4ih859w 50a 4f54577 47d 400k4i9 3u0 4osy3p1 31p63oq 591 3qrr5ua 4i9 3eoz48a 3a97445 42y 4o155d1 49u 4pj95as 48i 3noh505 3psq47e 5e1 3st24a0 5bc 4gwk3ho 4g5o579 4ei 4sh45e9 4b5 3bj93qh 3ot 37wy3o5 4nyy59e 5eq 3txi4b8 48a 3mp0431 3mik47d 59g 4uq05go 53o 3rd150a 579 3qkz4gi 5e9 3swh4aa 3b5444a 3ot 37w542t 4gi 4soy5es 3t6x4ac 47u 3mp44yz 46d 3z4k4i0 5ew 3t6p52s 4g9k3fe 4zv 3qjp5s9 4i0 4t8y3u1 3a963p1 3mi 4mg7591 49e 40844ia 48a 3a8x439 3mmx46i 59h 3sr949w 5as 3rcz50s 4c6j505 46i 4rl35e1 4a0 4pok5ax 32583os 579 4fve4gi 5e9 3sx24aa 3q1 38gy3ot 39h742t 4gy 4sp35es 4ac 3b5w47u 3mp84yz 46d 4oex4i0 5ew 3t6u59w 50a 4f4z505 3qkc47l 4i9 3eon3u1 3p1 31p13oq 579 3qkx49e 4pii4ia 48a 3a92439 42y 4o0y59h 3srf49w 5as 3rlz50s 4wm 3mms47e 5dx 3ssx4a0 4q3c3qh 3fw 4g5y3md 56y 55425e9 3twr4b6 3qi 3a20431 3o6 4nys59e 5ea 3txd4b8 3eq047u 431 3mja46h 59g 55s35go 3tzf5as 50q 4fc7579 47e 4pb85e9 3vs 4pld3px 323d3oq 579 3ql149e 5e9 3sx04a2 3px 38eq42y 4o135d1 4gy 4sp15es 4ac 3nsz506 3mmw4zu 5s5 3z4l4aw 5bc 4ihg3hw 4g623me 56y 55465sh 4b5 3bj93u2 3p1 37wz3o6 4nyv59e 5sy 3txh4b8 48a 3a90439 3mn046h 59g 57d25uw 5as 3rd150q 4z9 3psj47e 4sh45e9 4a0 4plh3px 3fu 4g4k579 47m 4sgy5e9 3t464aa 3q2 38f942y 591 3yoi4gy 4sp35es 4ac 3nt1506 46j 3mhw5s9 4h0 4t4y5ew 4ihi3hx 3fe 4f3956y 5s9 3z834i9 3ep33u2 3p1 380m42e 58y 55c45uq 4ia 3epv48a 3a93439 42y 4o115d0 5us 40ar5as 3rd450q 505 3psm47e 5e1 3swk4a0 5aw 4gpf3my 4g4n591 4eq 4so55e9 4a9 3b503q2 3a0842z 3o5 3yom4h0 5es 3t504ac 3nt650a 4yz 3mhy5s9 4h0 4t515ew 52s 4g9f3fe 4f3c576 5s9 400l4i9 3u1 33xg3p1 3mi 4mg258z 3qrr5uq 4ia 3epx48a 439 3knn42y 4ofd5dx 49w 4pl15as 48a 3mw4505 46i 4of65e1 3swm4a0 5aw 4gph3n0 579 3qkz4gi 4sob5e9 4aa 3b523q2 3ot 37w542d 4gi 4soy5es 3t6v4ac 44a 3mp14yz 46d 3z4j4h4 4t545ew 52s 4g9i3fe 4zx 3pro47d 4i0 4t8z3u1 3a933p1 3mi 4mg5591 47m 40844ia|参照用|注=和暦(邦暦):旧暦+新暦。和暦(わごよみ)は、明治5年12月2日以前は旧暦、明治6年1月1日以降は新暦です。|注=base: 日本暦日原典 (内田正男)',

		// 日本史时代区分表

		// http://www.kunaicho.go.jp/ryobo/successive_list.html

		// 正字体
		// 読み: よみがな
		'縄文时代/神武天皇|日本书纪-660~|:日本书纪|传说|时期=神话时代|読み=じんむてんのう|谥=神武天皇|生=庚午年1月1日 (-711/2/13, 平朔仪凤暦, 鲁桓公1年2月1日)|注=辛酉年春正月庚辰朔。天皇即帝位于橿原宫。...七十有六年春三月甲午朔甲辰。天皇崩于橿原宫。',
		'/绥靖天皇|日本书纪-581~|:日本书纪|传说|読み=すいぜいてんのう|谥=绥靖天皇',
		'/安宁天皇|日本书纪-548~|:日本书纪|传说|読み=あんねいてんのう',
		'/懿德天皇|日本书纪-510~|:日本书纪|传说|読み=いとくてんのう|谥=懿徳天皇',
		'弥生时代/孝昭天皇|日本书纪-475~|:日本书纪|传说|时期=神话时代|読み=こうしょうてんのう',
		'/孝安天皇|日本书纪-392~|:日本书纪|传说|読み=こうあんてんのう',
		'/孝灵天皇|日本书纪-290~|:日本书纪|传说|読み=こうれいてんのう|谥=孝霊天皇',
		'/孝元天皇|日本书纪-214~|:日本书纪|传说|読み=こうげんてんのう',
		'/开化天皇|日本书纪-157~|:日本书纪|传说|読み=かいかてんのう',
		'/崇神天皇|日本书纪-97~|:日本书纪|传说|読み=すじんてんのう|谥=崇神天皇',
		'/垂仁天皇|日本书纪-29~|:日本书纪|传说|読み=すいにんてんのう',
		'/景行天皇|日本书纪71~|:日本书纪|传说|読み=けいこうてんのう',
		'/成务天皇|日本书纪131~|:日本书纪|传说|読み=せいむてんのう',
		'/仲哀天皇|日本书纪192~|:日本书纪|传说|読み=ちゅうあいてんのう',
		'/神功皇后|日本书纪201~|:日本书纪|传说|君主性别=女|読み=じんぐうこうごう|谥=神功皇后|君主性别=女|注=日本书纪: 神功皇后摂政(じんぐうこうごうせっしょう)',
		// 大和时代は古坟时代と飞鸟时代を合わせた时代と言い换えることもできる。厳密には大和时代は弥生时代末期を含み、また飞鸟时代は古坟时代末期でもある。
		'古坟时代/应神天皇|日本书纪270~|:日本书纪|传说|时期=大和时代|読み=おうじんてんのう|谥=応神天皇;应神天皇',
		'/仁德天皇|日本书纪313~|:日本书纪|传说|読み=にんとくてんのう;仁徳天皇',
		'/履中天皇|日本书纪400~|:日本书纪|传说|読み=りちゅうてんのう',
		'/反正天皇|日本书纪406~|:日本书纪|传说|読み=はんぜいてんのう',
		'/允恭天皇|日本书纪412~|:日本书纪|传说|読み=いんぎょうてんのう',
		'/安康天皇|日本书纪454~|:日本书纪|传说|読み=あんこうてんのう',
		// 雄畧天皇: 本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/雄畧天皇|日本书纪457~|:日本书纪|传说|読み=ゆうりゃくてんのう|君主=雄略天皇',
		'/清宁天皇|日本书纪480~|:日本书纪|传说|読み=せいねいてんのう|谥=淸宁天皇|注=在清宁天皇崩御后，饭丰青皇女曾短暂执政，被称为忍海饭丰青尊，但她并没有被列为正式的天皇。饭豊天皇とも呼ばれる。『日本书纪』によれば、执政期间は短くわずか10个月余りで、清宁天皇5年11月に薨去',
		// 顕宗天皇: 本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/顕宗天皇|日本书纪485~|:日本书纪|传说|読み=けんぞうてんのう|谥=显宗天皇',
		'/仁贤天皇|日本书纪488~|:日本书纪|传说|読み=にんけんてんのう',
		'/武烈天皇|日本书纪499~|:日本书纪|传说|読み=ぶれつてんのう',

		// <a
		// href="https://ja.wikipedia.org/wiki/%E5%9B%BD%E5%8F%B7#.E6.97.A5.E6.9C.AC.E3.81.AE.E5.9B.BD.E5.8F.B7"
		// accessdate="2013/4/1 23:41">日本の国号</a>
		// 継体天皇: 本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/継体天皇|日本书纪507~|:日本书纪|読み=けいたいてんのう|君主=继体天皇|谥=継体天皇|国号=日本国;日本国',
		'/安闲天皇|日本书纪534~|:日本书纪|注=在位：531年3月10日?〈継体天皇25年2月7日〉 - 536年1月25日?〈安闲天皇2年12月17日〉',
		'/宣化天皇|日本书纪536~|:日本书纪',
		'/钦明天皇|日本书纪540~|:日本书纪',
		'/敏达天皇|日本书纪572~|:日本书纪|谥=敏达天皇',
		'/用明天皇|日本书纪586~|:日本书纪',
		'/崇峻天皇|日本书纪588~|:日本书纪',
		'飞鸟时代/崇峻天皇|日本书纪592~|5/=:日本书纪|时期=大和时代|注=飞鸟时代は崇峻天皇5年（592年）から和铜3年（710年）の118年间にかけて飞鸟に宫・都が置かれていた时代を指す。',

		'/推古天皇|旧暦593~|:旧暦|君主性别=女|注=在位：593/1/15~628/4/15',
		'/舒明天皇|旧暦629~|:旧暦|注=在位：629/2/2~641/11/17',
		'/皇极天皇|旧暦642~|:旧暦|君主性别=女|注=在位：642/2/19~645/7/12|讳=宝女王;宝皇女|注=皇极天皇、重祚して斉明天皇',
		'/孝德天皇|645/7/12~|:旧暦|谥=孝徳天皇',
		'/=/大化|645/7/17~|:旧暦|読み=たいか|注=654年10月10日～686年7月20日、686年9月9日～701年3月21日：元号は定められませんでした。',
		'/白雉|650/3/22~|:旧暦|読み=はくち',
		'=/齐明天皇|旧暦655~|:旧暦|君主性别=女|谥=斉明天皇|注=在位：655/2/14~661/8/24|注=皇极天皇、重祚して斉明天皇',
		'/天智天皇|旧暦662~|:旧暦|注=在位：668/2/20~672/1/7|注=斉明天皇崩御（661年）后に即日中大兄皇子は称制して暦が分かりにくくなっているが、日本书纪では越年称元（越年改元とも言う）年代での记述を采用しているため、崩御翌年（662年）が天智天皇元年に相当する。',
		'/弘文天皇|旧暦672~|:旧暦|注=在位：672/1/9-672/8/21|君主=大友皇子',
		'/天武天皇|672/8/21~|:旧暦|注=在位：673/3/20-686/10/1',
		'/=/朱鸟|686/8/14~|:旧暦|読み=しゅちょう、すちょう、あかみとり',
		'=/=|686/10/2~|15/=:旧暦|注=在位：673/3/20-686/10/1',
		'/持统天皇|旧暦687~|:旧暦|君主性别=女|注=在位：690/2/14-697/8/22',
		'/文武天皇|697/8/22~|:旧暦|注=在位：697/8/22-707/7/18',
		'/=/大宝|701/5/3~|:旧暦|元号=大宝|読み=たいほう、だいほう',
		'/庆云|704/6/16~|:旧暦|読み=けいうん、きょううん',
		'=/元明天皇/=|旧暦707~|4/=:旧暦|君主性别=女|読み=げんめい|注=在位：707/8/18-715/10月3日',
		'/和铜|708/2/7~|:旧暦|読み=わどう',

		'奈良时代/=/=|710/4/13~|3/=:旧暦|朝代=平城时代|注=710年（和铜3年）3月10日 (旧暦)に迁都',
		'/元正天皇/灵龟|715/10/3~|:旧暦|君主性别=女|元号=霊亀',
		'/养老|717/12/24~|:旧暦|注=[http://www.u4ren6.com/Moritsune/Moritsune.html 古代の暦]: 养老7年7月之 续日本纪 记载朔闰或早实历1日，例如载甲子朔，实历为乙丑朔；造成记载7月7日，实为7月6日。甚且这种前后差一日恐非偶发现象(安万侣墓碑「养老七年十二月十五日乙巳」と建碑)，而是当时常发生之问题。是以史书不能确信为实历。',
		'/圣武天皇/神龟|724/3/3~|:旧暦|元号=神亀',
		'/天平|729/9/2~|:旧暦',
		'/天平感宝|749/5/4~|:旧暦|元号=天平感宝',
		// TODO: 在本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		// 中为 A03873-002 @
		// https://dict.variants.moe.edu.tw/variants/rbt/word_attribute.rbt?quote_code=QTAzODcz
		// @see https://zi-hi.com/sp/uni/2E639
		'/孝谦天皇/天平胜宝|749/8/19~|:旧暦|君主性别=女|元号=天平胜宝',
		'/=|755/2/19~|7/1/4=:旧暦|元号=天平胜宝|年名=歳|注=天平胜宝7年1月4日(755/2/19)、勅命により「年」が「歳」に改められた。このため以后は、天平胜宝七歳・天平胜宝八歳・天平胜宝九歳と表记されたが、天平宝字へ改元した际に「歳」を「年」へ复している。',
		'/天平宝字|757/9/6~|:旧暦|元号=天平宝字',
		'/淳仁天皇/=|758/9/7~|2/=:旧暦',
		'/称德天皇/=|764/11/6~|8/=:旧暦|君主性别=女|谥=称徳天皇|注=孝谦天皇（こうけんてんのう）、重祚して称徳天皇（しょうとくてんのう；称德天皇）',
		'/天平神护|765/2/1~|:旧暦|注=称徳天皇重祚による改元',
		// HuTime != 上纲秀治
		'/神护景云|767/9/13~|:旧暦|注=一说神护景云二年四月乙亥朔。(上纲秀治)|注=除上纲秀治の月の大小、[http://miko.org/~uraki/kuon/furu/text/syokki/syokki29.htm#skk29_02 新编 续日本纪 卷廿九　称德天皇 高野天皇] "夏四月,乙亥朔戊寅"；余皆为甲戌朔。如: [http://www.j-texts.com/jodai/shokuall.html 昭和15年朝日新闻社発行『増补　六国史』]；[http://dl.ndl.go.jp/info:ndljp/pid/991092 経済雑志社 编	国史大系. 第２巻　続日本纪(1897-1901)]。',
		'/光仁天皇/宝龟|770/10/23~|:旧暦|元号=宝亀',
		'/天应|781/1/30~|:旧暦|元号=天応',
		'/桓武天皇/=|781/4/30~|:旧暦|注=在位:781/4/30-806/4/9',
		// HuTime != 上纲秀治
		'/延暦|782/9/30~|:旧暦|注=桓武天皇践祚による改元|注=一说桓武天皇延暦十三年五月癸酉朔。(HuTime)|注=[http://www.j-texts.com/chuko/koukiall.html 『日本后纪』朝日新闻本]\n《卷二逸文（『类聚国史』七三五月五日）延暦十三年（七九四）五月丁丑【六】》○五月丁丑。停马射。以发大军也。宴侍臣赐禄。\n《卷二逸文（『类聚国史』一六五乌）延暦十三年（七九四）五月乙未【廿四】》○乙未。甲斐国献白乌二。\n《卷二逸文（『日本纪略』）延暦十三年（七九四）五月己亥【廿七】》○己亥。皇太子妃讳带子、忽有病。移木莲子院、顿逝。|注=[http://miko.org/~uraki/kuon/furu/text/kouki/kouki02.htm#kou02_05 新编 日本后纪卷第二　桓武天皇　日本根子皇统弥照天皇《逸文》]\n五月,壬申朔丁丑,停马射.以发大军也.宴侍臣,赐禄. 类聚国史73五月五日',

		'平安前期/=/=|794/11/19~|13/=:旧暦|时期=平安时代|注=十三年十月廿三日。天皇自南京、迁北京。',
		'/平城天皇/=|806/4/9~|25/=:旧暦|注=在位:806/4/9-809/5/18',
		'/大同|806/6/8~|:旧暦',
		'/嵯峨天皇/=|809/5/18~|4/=:旧暦|注=在位:809/5/18-823/5/29',
		'/弘仁|810/10/20~|:旧暦',
		'/淳和天皇/=|823/6/9~|14/=:旧暦|注=在位:823/6/9-833/3/22',
		'/天长|824/2/8~|:旧暦',
		'/仁明天皇/=|833/3/30~|10/=:旧暦|注=在位:833/3/30-850/5/4',
		'/承和|834/2/14~|:旧暦',
		'/嘉祥|848/7/16~|:旧暦',
		'/文德天皇/=|850/5/31~|3/=:旧暦|谥=文徳天皇|注=在位:850/5/31-858/10/7',
		'/仁寿|851/6/1~|:旧暦|元号=仁寿',
		'/齐衡|854/12/23~|:旧暦|元号=斉衡',
		'/天安|857/3/20~|:旧暦',
		'/清和天皇/=|858/12/15~|2/=:旧暦|谥=淸和天皇|注=在位:858/12/15-876/12/18',
		'/贞观|859/5/20~|:旧暦|元号=贞観',
		'/阳成天皇/=|876/12/18~|18/=:旧暦|注=在位:876/12/18-884/3/4',
		'/元庆|877/6/1~|:旧暦',
		'/光孝天皇/=|884/3/23~|8/=:旧暦|注=在位:884/3/23-887/9/17',
		'/仁和|885/3/11~|:旧暦',
		'/宇多天皇/=|887/9/17~|3/=:旧暦|注=在位:887/9/17-897/8/4',
		'/宽平|889/5/30~|:旧暦|元号=寛平',
		'/醍醐天皇/=|897/8/14~|9/=:旧暦|注=在位:897/8/14-930/10/16',
		'/昌泰|898/5/20~|:旧暦|注=4月16日（5月10日）、8月16日（9月5日）の说もある。',
		'/延喜|901/8/31~|:旧暦',
		'平安中期/=/延长|923/5/29~|:旧暦|时期=平安时代',
		'/朱雀天皇/=|930/12/14~|8/=:旧暦|注=在位:930/12/14-946/5/16',
		'/承平|931/5/16~|:旧暦',
		'/天庆|938/6/22~|:旧暦',
		'/村上天皇/=|946/5/31~|9/=:旧暦|注=在位:946/5/31-967/7/5',
		'/天暦|947/5/15~|:旧暦',
		'/天徳|957/11/21~|:旧暦',
		'/应和|961/3/5~|:旧暦',
		'/康保|964/8/19~|:旧暦',
		'/冷泉天皇/=|967/11/15~|4/=:旧暦|注=在位:967/11/15-969/9/27',
		'/安和|968/9/8~|:旧暦',
		'/圆融天皇/=|969/11/5~|2/=:旧暦|谥=円融天皇|注=在位:969/11/5-984/9/24',
		'/天禄|970/5/3~|:旧暦|元号=天禄',
		'/天延|974/1/16~|:旧暦',
		'/贞元|976/8/11~|:旧暦',
		'/天元|978/12/31~|:旧暦',
		'/永观|983/5/29~|:旧暦|元号=永観',
		'/花山天皇/=|984/11/5~|2/=:旧暦|注=在位:984/11/5-986/8/1',
		'/宽和|985/5/19~|:旧暦|元号=寛和',
		// http://www.kunaicho.go.jp/ryobo/guide/066/
		'/一条天皇/=|986/8/1~|2/=:旧暦|読み=いちじょうてんのう|谥=一条天皇|注=在位:986/8/1-1011/7/16',
		'/永延|987/5/5~|:旧暦',
		'/永祚|989/9/10~|:旧暦',
		'/正暦|990/11/26~|:旧暦',
		'/长德|995/3/25~|:旧暦|元号=长徳',
		'/长保|999/2/1~|:旧暦',
		'/寛弘|1004/8/8~|:旧暦',
		'/三条天皇/=|1011/7/16~|8/=:旧暦|谥=三条天皇|注=在位:1011/7/16-1016/3/10',
		'/长和|1013/2/8~|:旧暦',
		'/后一条天皇/=|1016/3/18~|5/=:旧暦|谥=后一条天皇|注=在位:1016/3/18-1036/5/15',
		'/宽仁|1017/5/21~|:旧暦|元号=寛仁',
		'/治安|1021/3/17~|:旧暦',
		'/万寿|1024/8/19~|:旧暦|元号=万寿',
		'/长元|1028/8/18~|:旧暦',
		'平安后期/后朱雀天皇/=|1036/5/15~|9/=:旧暦|时期=平安时代|注=在位:1036/5/15-1045/2/5',
		'/长暦|1037/5/9~|:旧暦',
		'/长久|1040/12/16~|:旧暦',
		'/宽德|1044/12/16~|:旧暦|元号=寛徳',
		'/后冷泉天皇/=|1045/2/5~|2/=:旧暦|注=寛徳2/1/16（1045/2/5）、后一条天皇が譲位。寛徳2年（1045年）4月8日、即位。',
		'/永承|1046/5/22~|:旧暦',
		'/天喜|1053/2/2~|:旧暦',
		'/康平|1058/9/19~|:旧暦',
		'/治暦|1065/9/4~|:旧暦',
		'/后三条天皇/=|1068/5/22~|4/=:旧暦|谥=后三条天皇|注=在位:1068/5/22-1073/1/18',
		'/延久|1069/5/6~|:旧暦',
		'/白河天皇/=|1073/1/18~|4/=:旧暦|注=在位:1073/1/18-1087/1/3',
		'/承保|1074/9/16~|:旧暦',
		'/承暦|1077/12/5~|:旧暦',
		'/永保|1081/3/22~|:旧暦',
		'/应德|1084/3/15~|:旧暦|元号=应徳',
		'/堀河天皇/=|1087/1/26~|3/=:旧暦|注=在位:1087/1/3-1107/8/9',
		'/宽治|1087/5/11~|:旧暦|元号=寛治',
		'/嘉保|1095/1/23~|:旧暦',
		'/永长|1097/1/3~|:旧暦',
		'/承德|1097/12/27~|:旧暦|元号=承徳',
		'/康和|1099/9/15~|:旧暦',
		'/长治|1104/3/8~|:旧暦',
		'/嘉承|1106/5/13~|:旧暦',
		'/鸟羽天皇/=|1107/8/9~|2/=:旧暦|谥=鸟羽天皇|注=在位:嘉承2/7/19（1107/8/9）-保安4年正月28日（1123/2/25）',
		'/天仁|1108/9/9~|:旧暦',
		'/天永|1110/7/31~|:旧暦',
		'/永久|1113/8/25~|:旧暦',
		'/元永|1118/4/25~|:旧暦',
		'/保安|1120/5/9~|:旧暦',
		'/崇德天皇/=|1123/2/25~|4/=:旧暦|谥=崇徳天皇|注=在位:旧暦1123/1/28-1141/12/7',
		'/天治|1124/5/18~|:旧暦',
		'/大治|1126/2/15~|:旧暦',
		'/天承|1131/2/28~|:旧暦',
		'/长承|1132/9/21~|:旧暦',
		'/保延|1135/6/10~|:旧暦',
		'/永治|1141/8/13~|:旧暦',
		'/近衞天皇/=|1142/1/5~|:旧暦|谥=近卫天皇|注=在位:在位:永治元年12月7日（1142/1/5）-久寿2/7/23（1155/8/22）',
		'/康治|1142/5/25~|:旧暦',
		'/天养|1144/3/28~|:旧暦',
		'/久安|1145/8/12~|:旧暦',
		'/仁平|1151/2/14~|:旧暦',
		'/久寿|1154/12/4~|:旧暦|元号=久寿',
		'/后白河天皇/=|1155/8/23~|2/=:旧暦|注=在位：久寿2/7/24（1155/8/23）-保元3/8/11（1158/9/5）',
		'/保元|1156/5/18~|:旧暦',
		'/二条天皇/=|1158/9/5~|3/=:旧暦|谥=二条天皇|注=在位：保元3/8/11（1158/9/5）-永万元年6月25日（1165/8/3）',
		'/平治|1159/5/9~|:旧暦',
		'/永暦|1160/2/18~|:旧暦',
		'/应保|1161/9/24~|:旧暦',
		'/长宽|1163/5/4~|:旧暦|元号=长寛',
		'/永万|1165/7/14~|:旧暦|元号=永万',
		'/六条天皇/=|1165/8/3~|:旧暦|谥=六条天皇|注=在位:永万元年6月25日（1165/8/3）-仁安3/2/19（1168/4/9）',
		'/仁安|1166/9/23~|:旧暦',
		'/高仓天皇/=|1168/4/9~|3/=:旧暦|注=在位：仁安3/2/19（1168/4/9）-治承4/2/21（1180/3/18）',
		'/嘉应|1169/5/6~|:旧暦',
		'/承安|1171/5/27~|:旧暦',
		'/安元|1175/8/16~|:旧暦',
		'/治承|1177/8/29~|:旧暦',
		'/安德天皇/=|1180/5/18~|4/=:旧暦|谥=安徳天皇|注=在位：治承4/4/22（1180/5/18）-寿永4/3/24（1185/4/25）',
		'/养和|1181/8/25~|:旧暦|注=1182年～1184年：平氏は养和を用いましたが、源氏は治承を継続使用しました。',
		'/寿永|1182/6/29~|:旧暦|元号=寿永',
		'/后鸟羽天皇/=|1183/9/8~|2/=:旧暦|谥=后鸟羽天皇|注=在位：寿永2/8/20（1183/9/8）-建久9/1/11（1198/2/18）',
		'/元暦|1184/5/27~|:旧暦|注=1185年：源氏は元暦を用いましたが、平氏は寿永を継続使用しました。',
		'/文治|1185/9/9~|:旧暦',

		'镰仓朝廷/=/=|1185/12/21~|:旧暦|时期=镰仓时代|注=始期については诸说あるが、东国支配権の承认を得た1183年说と守护・地头设置権を认められた1185/12/21「文治の勅许」说が有力视されている。',
		'/建久|1190/5/16~|:旧暦',
		'/土御门天皇/=|1198/2/18~|9/=:旧暦|注=在位：建久9/1/11 （1198/2/18）-承元4/11/25（1210/12/12）',
		'/正治|1199/5/23~|:旧暦',
		'/建仁|1201/3/19~|:旧暦',
		'/元久|1204/3/23~|:旧暦',
		'/建永|1206/6/5~|:旧暦',
		'/承元|1207/11/16~|:旧暦',
		'/顺德天皇/=|1210/12/12~|4/=:旧暦|谥=顺徳天皇|注=在位：承元4/11/25（1210/12/12）-承久3/4/20（1221/5/13）',
		'/建暦|1211/4/23~|:旧暦',
		'/建保|1214/1/18~|:旧暦',
		'/承久|1219/5/27~|:旧暦',
		'/仲恭天皇/=|1221/5/13~|3/=:旧暦|注=在位:承久3/4/20（1221/5/13）-承久3/7/9（1221/7/29）',
		'/后堀河天皇/=|1221/7/29~|3/=:旧暦|注=在位：承久3/7/9（1221/7/29）-贞永元年10月4日（1232/11/17）',
		'/贞应|1222/5/25~|:旧暦|元号=贞応',
		'/元仁|1224/12/31~|:旧暦',
		'/嘉禄|1225/5/28~|:旧暦|元号=嘉禄',
		'/安贞|1228/1/18~|:旧暦',
		'/寛喜|1229/3/31~|:旧暦',
		'/贞永|1232/4/23~|:旧暦',
		'/四条天皇/=|1232/11/17~|:旧暦|谥=四条天皇|注=在位：贞永元年10月4日（1232/11/17）-仁治3/1/9（1242/2/10）',
		'/天福|1233/5/25~|:旧暦',
		'/文暦|1234/11/27~|:旧暦',
		'/嘉祯|1235/11/1~|:旧暦',
		'/暦仁|1238/12/30~|:旧暦',
		'/延应|1239/3/13~|:旧暦|元号=延応',
		'/仁治|1240/8/5~|:旧暦',
		'/后嵯峨天皇/=|1242/2/21~|3/=:旧暦|注=在位：仁治3/1/20（1242/2/21）-寛元4/1/29（1246/2/16）',
		'/寛元|1243/3/18~|:旧暦',
		'/后深草天皇/=|1246/2/16~|4/=:旧暦|注=在位：寛元4/1/29（1246/2/16）-正元元年11月26日（1260/1/9）',
		// http://base1.nijl.ac.jp/iview/Frame.jsp?DB_ID=G0003917KTM&C_CODE=HOKU-00434&PROC_TYPE=ON&SHOMEI=%E5%90%BE%E5%A6%BB%E9%8F%A1&REQUEST_MARK=%EF%BC%A4%EF%BC%A9%EF%BC%A7%EF%BC%8D%EF%BC%A8%EF%BC%AF%EF%BC%AB%EF%BC%B5%EF%BC%8D%EF%BC%94%EF%BC%93%EF%BC%94,%201797%E3%82%B3%E3%83%9E,%20Y&OWNER=%E5%8C%97%E5%A4%A7%E5%9B%B3&BID=100240884&IMG_NO=10
		'/寳治|1247/4/5~|:旧暦|元号=宝治;宝治',
		'/建长|1249/5/2~|:旧暦',
		'/康元|1256/10/24~|:旧暦',
		'/正嘉|1257/3/31~|:旧暦',
		'/正元|1259/4/20~|:旧暦',
		// 亀山天皇: 本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/亀山天皇/=|1260/1/9~|:旧暦|君主=龟山天皇|谥=亀山天皇|注=在位：正元元年11月26日（1260/1/9）-文永11/1/26（1274/3/6）',
		'/文应|1260/5/24~|:旧暦|元号=文応',
		'/弘长|1261/3/22~|:旧暦',
		'/文永|1264/3/27~|:旧暦',
		'/后宇多天皇/=|1274/3/6~|11/=:旧暦|注=在位：文永11/1/26（1274/3/6）-弘安10/10/21（1287/11/27 ）',
		'/建治|1275/5/22~|:旧暦',
		'/弘安|1278/3/23~|:旧暦',
		'/伏见天皇/=|1287/11/27~|10/=:旧暦|注=在位:弘安10/10/21（1287/11/27）-永仁6/7/22（1298/8/30）',
		'/正应|1288/5/29~|:旧暦|元号=正応',
		'/永仁|1293/9/6~|:旧暦',
		'/后伏见天皇/=|1298/8/30~|6/=:旧暦|注=在位：永仁6/7/22（1298/8/30）-正安3/1/21（1301/3/2）',
		'/正安|1299/5/25~|:旧暦',
		'/后二条天皇/=|1301/3/2~|3/=:旧暦|谥=后二条天皇|注=在位：正安3/1/21（1301/3/2）-徳治3/8/25（1308/9/10）',
		'/乾元|1302/12/10~|:旧暦',
		'/嘉元|1303/9/16~|:旧暦',
		'/徳治|1307/1/18~|:旧暦',
		'/延庆|1308/11/22~|:旧暦',
		'/花园天皇/=|1308/12/28~|:旧暦|注=在位：延庆元年11月16日（1308/12/28）-文保2/2/26（1318/3/29）',
		'/应长|1311/5/17~|:旧暦|元号=応长',
		'/正和|1312/4/27~|:旧暦',
		'/文保|1317/3/16~|:旧暦',
		'/后醍醐天皇/=|1318/3/29~|2/=:旧暦|注=在位：文保2/2/26（1318/3/29）-延元4年/暦応2/8/15（1339/9/18）',
		'/元应|1319/5/18~|:旧暦|元号=元応',
		'/元亨|1321/3/22~|:旧暦',
		'/正中|1324/12/25~|:旧暦',
		'/嘉暦|1326/5/28~|:旧暦',
		'/元徳|1329/9/22~|:旧暦|元徳3年（1331年）、后醍醐天皇（大覚寺统）の倒幕计画発覚后、天皇は「元弘」に改元した。しかし、镰仓幕府は改元を认めず、「元徳」を使い続けるとともに光厳天皇（持明院统）を拥立した。',

		// 南北朝时代の始期はは延元元年12月21日、建武の新政の崩壊を受けて足利尊氏が新たに光明天皇（北朝侧）を拥立したのに対抗して京都を脱出した后醍醐天皇（南朝侧）が吉野行宫に迁った时期であり、
		// 终期は明徳3年闰10月5日、南朝第4代の后亀山天皇が北朝第6代の后小松天皇に譲位するかたちで両朝が合一した时期である（明徳の和约）。
		'南朝/=/元弘|1331/9/11~|:旧暦|政权=大覚寺统|时期=室町时代',
		'/建武|1334/3/5~|:旧暦',
		'/延元|1336/4/11~|:旧暦',
		'/后村上天皇/=|1339/9/18~|4/=:旧暦|注=在位：延元4年/暦応2/8/15（1339/9/18）-正平23年/応安元年3月11日（1368/3/29）',
		'/兴国|1340/5/25~|:旧暦',
		'/正平|1347/1/20~|:旧暦|注=『七巻册子』は同年4月、『南朝编年记略』・『南朝公卿补任』は7月24日（8月11日）、『続史愚抄』などは7月4日（7月22日）とするが、全て误りである。|注=正平6年（1351年）10月、尊氏を中心とする室町幕府势力は足利直义との対抗上の必要から南朝と讲和し、结果として光厳院政及び光厳の子崇光天皇の皇位がともに廃されることとなった（正平一统）。在京であり光厳・光明・崇光の直系尊属である広义门院が上皇の代理として伝国诏宣を行う案が立てられた。6月19日にようやく承诺を取り付けるに至った。6月27日には「官位等を正平一统以前の状态に复旧する」内容の広义门院令旨（天下一同法）が発令され、この令旨により、それまで停滞していた政务・人事・仪式などが全て动き始めることとなった。弥仁王も同年8月に无事践祚を终え后光厳天皇となった。正平8年（1353年）に后光厳へ政务権を継承した后も北朝家督者として君临し続け、正平12年（1357年）に66歳で没した。',
		'/长庆天皇/=|1368/3/29~|23/=:旧暦|注=在位：正平23年/応安元年（1368年） 3月（鸭脚本『皇代记』による。ただし、日付の记录を欠いているため、3月11日（1368/3/29）の后村上天皇崩御を受けてのものか、あるいはそれに先だって行われた譲位によるものか、确认しがたい。おそらく前者であろう。しかし、近世の南朝系図は何によってか、3月9日（1368/3/27）受禅としているものが多いようである。）-弘和3年/永徳3年（1383年）冬。',
		'/建徳|1370/8/16~|:旧暦|注=『南朝编年记略』･『南朝公卿补任』によるが、鸭脚本『皇代记』は同年4月22日（5月17日）とし、『伊势之巻』は1月21日（2月17日）とする。また、村田正志は、『大徳寺文书』にある建徳元年2月5日（1370/3/3）付の畠田売券を根拠として、当日以前に改元が行われたと指摘するが、この类の文书では恣意的に日付を溯及して记す场合もしばしばあったことを勘案しておく必要があろう（服部英雄 「未来年号考」 『古文书研究』第20号 吉川弘文馆、1983年2月）。',
		'/文中|1372/4/26~|:旧暦|疑|注=建徳3年4月某日（ユリウス暦1372年5月某日）改元、灾异によるか。正确な改元日については、史料を欠くために明确にし难い。史料上の初出は、『金刚寺文书』にある文中元年4月28日（1372/5/31）付の长庆天皇纶旨であり、これ以前に改元が行われたことは确実视される。したがって、『南朝编年记略』･『続史愚抄』等が同年10月4日（10月30日）とするのは误り。『七巻册子』のみは3月22日（4月26日）とし、森本角蔵の著作『日本年号大観』もこの说を采るが、他に所见がないために确证を得ない。',
		'/天授|1375/6/26~|:旧暦|注=『南朝编年记略』・『南朝公卿补任』によるが、『七巻册子』は同年2月上旬とする。',
		'/弘和|1381/3/6~|:旧暦|注= 『南朝公卿补任』･『続史愚抄』等によるが、『南朝编年记略』は同年2月14日（3月10日）とする。なお、史料上の初出は、『金刚寺文书』『河合寺文书』にある弘和元年6月21日（1381/7/13）付の长庆天皇纶旨である。',
		// 后亀山天皇: 本朝通鉴 https://dl.ndl.go.jp/info:ndljp/pid/771553
		'/后亀山天皇/=|1383/11~|3/=:旧暦|君主=后龟山天皇|谥=后亀山天皇|注=在位：弘和3年/永徳3年（1383年）冬-元中9年/明徳3年闰10月5日（1392/11/19）',
		'/元中|1384/5/18~1392/11/18|:旧暦',

		'北朝/光严天皇/元弘|1331/10/22~|:旧暦|时期=室町时代|谥=光厳天皇|政权=持明院统|注=在位：元弘元年9月20日（1331/10/22）-元弘3年/正庆2/5/25（1333/7/7）',
		'/正庆|1332/5/23~1333/7/7|:旧暦|在位：配流先の隠岐から帰京した后醍醐天皇は、光厳天皇の即位と「正庆」の元号の无効を宣言。天皇亲政を始めた后醍醐天皇は、「建武」に改元する（建武の新政）。',

		'/光明天皇/建武|1336/9/20~|3/=:旧暦|注=在位：延元元年/建武3/8/15（1336/9/20）-正平3年/贞和4/10/27（1348/11/18）',
		'/暦应|1338/10/11~|:旧暦|元号=暦応',
		'/康永|1342/6/1~|:旧暦',
		'/贞和|1345/11/15~|:旧暦',
		'/崇光天皇/=|1348/11/18~|4/=:旧暦|注=在位：正平3年/贞和4/10/27（1348/11/18）-正平6年/观应2/11/7（1351/11/26）',
		'/观应|1350/4/4~|:旧暦|元号=観応',
		'/后光严天皇/=|1352/9/25~|3/=:旧暦|谥=后光厳天皇|注=在位：正平8年/观应3/8/17（1352/9/25）-建徳2年/応安4/3/23（1371/4/9）',
		'/文和|1352/11/4~|:旧暦',
		'/延文|1356/4/29~|:旧暦',
		'/康安|1361/5/4~|:旧暦',
		'/贞治|1362/10/11~|:旧暦',
		'/应安|1368/3/7~|:旧暦|元号=応安',
		'/后圆融天皇/=|1371/4/9~|4/=:旧暦|谥=后円融天皇|注=在位：建徳2年/応安4/3/23（1371/4/9）-弘和2年/永徳2/4/11（1382/5/24）',
		'/永和|1375/3/29~|:旧暦',
		'/康暦|1379/4/9~|:旧暦',
		'/永徳|1381/3/20~|:旧暦',
		'/后小松天皇/=|1382/5/24~|2/=:旧暦|注=在位：永徳2年/弘和2/4/11（1382/5/24）-応永19/8/29（1412/10/5）',
		'/至徳|1384/3/19~|:旧暦',
		'/嘉庆|1387/10/5~|:旧暦',
		'/康应|1389/3/7~|:旧暦|元号=康応',
		'/明徳|1390/4/12~|:旧暦',

		// 南北朝统一(合一)后
		'室町朝廷/=/=|1392/11/19~|3/=:旧暦|时期=室町时代|注=建武新政を含む最初の约60年间を南北朝时代、応仁の乱（1467年）または明応の政変（1493年）以后の时代を戦国时代と区分して、南北朝合一（1392年）から応仁の乱勃発または明応の政変までの约75～100年间を室町时代と区分する场合も多い。',
		'/应永|1394/8/2~|:旧暦|元号=応永',
		'/称光天皇/=|1412/10/5~|19/=:旧暦|谥=称光天皇|注=在位： 応永19/8/29（1412/10/5）-正长元年7月20日（1428/8/30）',
		'/正长|1428/6/10~|:旧暦',
		'/后花园天皇/=|1428/9/7~|/=:旧暦|注=在位：正长元年7月28日（1428/9/7）-寛正5/7/19（1464/8/21）',
		'/永享|1429/10/3~|:旧暦',
		'/嘉吉|1441/3/10~|:旧暦',
		'/文安|1444/2/23~|:旧暦',
		'/宝徳|1449/8/16~|:旧暦',
		'/享徳|1452/8/10~|:旧暦',
		'/康正|1455/9/6~|:旧暦',
		'/长禄|1457/10/16~|:旧暦',
		'/寛正|1461/2/1~|:旧暦',
		'/后土御门天皇/=|1464/8/21~|5/=:旧暦|注=在位:寛正5/7/19（1464/8/21）-明応9/9/28（1500/10/21）',
		'/文正|1466/3/14~|:旧暦',

		'戦国时代/=/应仁|1467/4/9~|:旧暦|时期=室町时代|元号=応仁|注=一般に1467年の応仁の乱もしくは1493年の明応の政変を始まり、1568年の织田信长入京、もしくは1573年に室町将军足利义昭が信长によって追放されたのを终わりとすることが多い。',
		'/文明|1469/6/8~|:旧暦',
		'/长享|1487/8/9~|:旧暦|注=改元后も幕府侧の准备不足の为、8月9日（8月27日）まで公家も武家も「文明」の年号を使用した。',
		'/延徳|1489/9/16~|:旧暦',
		'/明应|1492/8/12~|:旧暦|元号=明応|注=室町幕府は改元吉书始を7月28日（8月21日）に行い、この日から新元号を采用している。',
		'/后柏原天皇/=|1500/11/16~|9/=:旧暦|注=在位：明応9/10/25（1500/11/16）-大永6/4/7（1526/5/18）',
		'/文龟|1501/3/18~|:旧暦|元号=文亀',
		'/永正|1504/3/16~|:旧暦',
		'/大永|1521/9/23~|:旧暦',
		'/后奈良天皇/=|1526/6/9~|6/=:旧暦|注=在位：大永6/4/29（1526/6/9）-弘治3/9/5（1557/9/27）',
		'/享禄|1528/9/3~|:旧暦',
		'/天文|1532/8/29~|:旧暦',
		'/弘治|1555/11/7~|:旧暦',
		'/正亲町天皇/=|1557/11/17~|3/=:旧暦|注=在位：弘治3/10/27（1557/11/17）-天正14/11/7（1586/12/17）',
		'/永禄|1558/3/18~|:旧暦',
		'/元龟|1570/5/27~|:旧暦|元号=元亀',

		'安土桃山朝廷/=/天正|1573/8/25~|:旧暦|时期=安土桃山时代|注=织田信长と豊臣秀吉が中央政権を握っていた时代である。织豊时代（しょくほうじだい）ともいう。',
		'/后阳成天皇/=|1586/12/17~|14/=:旧暦|注=在位：天正14/11/7（1586/12/17）-庆长16/3/27（1611/5/9）',
		'/文禄|1593/1/10~|:旧暦|元号=文禄',
		'/庆长|1596/12/16~|:旧暦',

		'江戸朝廷/=/=|1603/3/24~|8/=:旧暦|时期=江戸时代|注=庆长8/2/12（1603/3/24）に徳川家康が征夷大将军に任命されて江戸（现在の东京）に幕府を树立してから庆応4年／明治元年4月11日（1868/5/3）に江戸城が明治政府军に明け渡されるまでの265年间を指す。',
		'/后水尾天皇/=|1611/5/9~|16/=:旧暦|注=在位：庆长16/3/27（1611/5/9）-寛永6/11/8（1629/12/22）',
		'/元和|1615/9/5~|:旧暦',
		'/寛永|1624/4/17~|:旧暦',
		'/明正天皇/=|1629/12/22~|6/=:旧暦|君主性别=女|注=在位：寛永6/11/8（1629/12/22）-寛永20/10/3（1643/11/14）',
		'/后光明天皇/=|1643/11/14~|20/=:旧暦|注=在位：寛永20/10/3（1643/11/14）-承応3/9/20（1654/10/30）',
		'/正保|1645/1/13~|:旧暦',
		'/庆安|1648/4/7~|:旧暦',
		'/承応|1652/10/20~|:旧暦',
		'/后西天皇/=|1655/1/5~|4/=:旧暦|注=在位：承応4/11/28（1655/1/5）-寛文3/1/26（1663/3/5）',
		'/明暦|1655/5/18~|:旧暦',
		'/万治|1658/8/21~|:旧暦|元号=万治',
		'/寛文|1661/5/23~|:旧暦',
		'/灵元天皇/=|1663/3/5~|3/=:旧暦|谥=霊元天皇|注=在位：寛文3/1/26（1663/3/5）-贞享4/3/21（1687/5/2）',
		'/延寳|1673/10/30~|:旧暦|元号=延宝;延宝',
		'/天和|1681/11/9~|:旧暦',
		'/贞享|1684/4/5~|:旧暦',
		'/东山天皇/=|1687/5/6~|4/=:旧暦|注=在位：贞享4/3/25（1687/5/6）-宝永6/6/21（1709/7/27）',
		'/元禄|1688/10/23~|:旧暦',
		'/宝永|1704/4/16~|:旧暦',
		'/中御门天皇/=|1709/7/27~|6/=:旧暦|注=在位:宝永6/6/21（1709/7/27）-享保20/3/21（1735/4/13）',
		'/正徳|1711/6/11~|:旧暦',
		'/享保|1716/8/9~|:旧暦',
		'/樱町天皇/=|1735/4/13~|20/=:旧暦|谥=桜町天皇|注=在位:享保20/3/21（1735/4/13）-延享4/5/2（1747/6/9）',
		'/元文|1736/6/7~|:旧暦',
		'/寛保|1741/4/12~|:旧暦',
		'/延享|1744/4/3~|:旧暦',
		'/桃园天皇/=|1747/6/9~|4/=:旧暦|注=在位：延享4/5/2（1747/6/9）-宝暦12/7/12（1762/8/31）',
		'/寛延|1748/8/5~|:旧暦',
		'/宝暦|1751/12/14~|:旧暦',
		'/后樱町天皇/=|1762/9/15~|12/=:旧暦|君主性别=女|君主=后桜町天皇|注=在位：宝暦12/7/27（1762/9/15）-明和7/4/28（1770/5/23）',
		'/明和|1764/6/30~|:旧暦|注=当初1月28日（2月29日）改元の予定であったが、朝鲜通信使の来日中の改元は事务上の问题に加えて外闻の问题も生じるとして4ヶ月延期された。',
		'/后桃园天皇/=|1770/5/23~|7/=:旧暦|注=在位：明和7/4/28（1770/5/23）-安永8/11/9（1779/12/16）',
		'/安永|1772/12/10~|:旧暦',
		'/光格天皇/=|1780/1/1~|8/=:旧暦|注=在位：安永8/11/25（1780/1/1）-文化14/3/22（1817/5/7）',
		'/天明|1781/4/25~|:旧暦',
		'/寛政|1789/2/19~|:旧暦',
		'/享和|1801/3/19~|:旧暦',
		'/文化|1804/3/22~|:旧暦',
		'/仁孝天皇/=|1817/10/31~|14/=:旧暦|注=在位：文化14/9/21（1817/10/31）-弘化3/1/26（1846/2/21）',
		'/文政|1818/5/26~|:旧暦',
		'/天保|1831/1/23~|:旧暦',
		'/弘化|1845/1/9~|:旧暦',
		'/孝明天皇/=|1846/3/10~|3/=:旧暦|注=在位:1846/3/10（弘化3/2/13）‐ 1867/1/30（庆応2/12/25）',
		'/嘉永|1848/4/1~|:旧暦',
		'/安政|1855/1/15~|:旧暦',
		'/万延|1860/4/8~|:旧暦|元号=万延',
		'/文久|1861/3/29~|:旧暦',
		'/元治|1864/3/27~|:旧暦',
		'/庆应|1865/5/1~1868/10/23|:旧暦|元号=庆応',

		// 御称号(幼名),和风谥号,别称
		'/明治天皇/明治|旧暦1868~|:旧暦|元号=㍾|称号=祐宫|讳=睦仁|生=嘉永5年9月22日|卒=明治45年7月30日午前0时43分|注=実际に改元の诏书が出されたのは庆応4/9/8（1868/10/23）で庆応4/1/1に溯って明治元年とすると定めた。改元の诏书には「改庆应四年为明治元年」（庆応4年を改めて明治元年と为す）とあり、改元が年の呼称を改めるということから、庆応4/1/1（1868/1/25）に溯って适用された。法的には庆応4/1/1より明治元年となる。',

		'明治以降/=/=|1868/5/3~|:旧暦|江戸时代（えどじだい）は、明治元年4月11日（1868/5/3）に江戸城が明治政府军に明け渡されるまでの265年间を指す。',

		// <a
		// href="http://ja.wikipedia.org/wiki/%E3%82%B0%E3%83%AC%E3%82%B4%E3%83%AA%E3%82%AA%E6%9A%A6#.E6.97.A5.E6.9C.AC.E3.81.AB.E3.81.8A.E3.81.91.E3.82.8B.E3.82.B0.E3.83.AC.E3.82.B4.E3.83.AA.E3.82.AA.E6.9A.A6.E5.B0.8E.E5.85.A5"
		// accessdate="2013/4/1 23:29">グレゴリオ暦#日本におけるグレゴリオ暦导入</a>
		// 「太阴暦ヲ廃シ太阳暦ヲ颁行ス」日本では、明治5年（1872年）に、従来の太阴太阳暦を廃して翌年から太阳暦を采用することが布告された。
		'/=|1873/1/1~|6/=:CE|注=天保暦は明治5/12/2（1872/12/31）まで使われていた。その翌日の12月3日をもって明治6年（1873年）1月1日に改められ、グレゴリオ暦（太阳暦）に改暦された。改暦は明治5/11/9（1872/12/9）に布告し、翌月に実施された。|注=大日本帝国は1889年（明治22年）の大日本帝国宪法発布时に宪法典の名称として使用されたことから権威づけられ、1947年（昭和22年）の日本国宪法施行时までの约58年间、天皇が大日本帝国宪法を通じて统治する日本として使用された国号のひとつとされる。',
		'/大正天皇/大正|1912/7/30~|:CE|元号=㍽|称号=明宫|讳=嘉仁|生=明治12年8月31日午前8时20分|卒=大正15年12月25日|注=大正改元の诏书（1912年（明治45年）7月30日）: 朕菲德ヲ以テ大统ヲ承ケ祖宗ノ威灵ニ诰ケテ万机ノ政ヲ行フ兹ニ先帝ノ定制ニ遵ヒ明治四十五年七月三十日以后ヲ改メテ大正元年ト为ス主者施行セヨ（以下略）',
		// 旧字体: 1946年に制定した当用汉字で采用された新しい字体、すなわち新字体に対してそれ以前に惯用されていた字体を指す。
		'/昭和天皇/昭和|1926/12/25~|:CE|元号=㍼|称号=迪宫|讳=裕仁|生=明治34年4月29日22时10分|卒=昭和64年1月7日午前6时33分|注=昭和改元の诏书（1926年〔大正15年〕12月25日）: 朕皇祖皇宗ノ威灵ニ赖リ大统ヲ承ケ万机ヲ总フ兹ニ定制ニ遵ヒ元号ヲ建テ大正十五年十二月二十五日以后ヲ改メテ昭和元年ト为ス（以下略）',
		'/明仁天皇/平成|1989/1/8~|:CE|元号=㍻|君主=今上天皇|称号=継宫|讳=明仁|生=昭和8年12月23日 午前6时39分|注=「元号を改める政令」（昭和64年政令第1号）は新天皇の允裁（いんさい）を受けた后、官报号外によって公布され、翌1月8日から施行された。|注=天皇陛下譲位は平成31年4月30日、改元は5月1日。天皇の譲位は光格天皇以来、约200年ぶりとなる。',
		// 第126代天皇
		// https://ja.wikisource.org/wiki/%E5%85%83%E5%8F%B7%E3%82%92%E6%94%B9%E3%82%81%E3%82%8B%E6%94%BF%E4%BB%A4_(%E5%B9%B3%E6%88%90%E4%B8%89%E5%8D%81%E4%B8%80%E5%B9%B4%E6%94%BF%E4%BB%A4%E7%AC%AC%E7%99%BE%E5%9B%9B%E5%8D%81%E4%B8%89%E5%8F%B7)
		'/徳仁天皇/令和|2019/5/1~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|元号=㋿|称号=浩宫|讳=徳仁|生=1960年2月23日|注=平成31年4月1日内阁告示第1号: 元号を改める政令（平成三十一年政令第百四十三号）の规定により定められた元号の読み方は、次のとおりである。 令和',

		// ------------------------------------------------

		// 幕府 https://ja.wikipedia.org/wiki/%E5%B9%95%E5%BA%9C
		// http://www.7key.jp/data/syougun.html
		// http://www.geocities.jp/tougoku_busyou/seii.htm
		// http://www.ne.jp/asahi/histrian/takasaki/history2.html
		// http://www.sogonenpyo.jpn.org/main-nenpyo.php

		// '征夷大将军/坂上田村麻吕|797/11/27~811/6/17|:旧暦|时期=平安时代|読み=さかのうえのたむらまろ|生=天平宝字2年|卒=弘仁2年5月23日|父=坂上苅田麻吕|注=出家。',
		// '/文室绵麻吕|813/7/1~816/12/1|:旧暦|読み=ふんやのわたまろ|生=天平神护元年|卒=弘仁14年4月24日|父=三诸大原',
		// '/藤原忠文|940/2/29~947/7/16|:旧暦|読み=ふじわらのただぶみ|生=贞観15年|卒=天暦元年6月26日|父=藤原枝良|母=息长息継の娘|注=宇治民部卿とも呼ばれる。',
		// '/源义仲|1184/2/28~1184/3/4|:旧暦|読み=みなもとのよしなか|生=久寿元年|卒=寿永3年1月20日|父=源义贤|母=小枝御前|注=讨死[宇治川の戦い]。',

		// 镰仓将军一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'镰仓幕府/源頼朝|1192/8/21~1199/2/9|:旧暦|时期=镰仓时代|読み=みなもとのよりとも|生=久安3年4月8日|卒=建久10年1月13日|父=源义朝|母=由良御前|注=出家。',
		'/源頼家|1202/8/11~|:旧暦|読み=みなもとのよりいえ|生=寿永元年8月12日|卒=元久元年7月18日|父=源頼朝|母=北条政子|注=北条氏の手兵によって杀害。',
		'/源実朝|1203/10/13~|:旧暦|読み=みなもとのさねとも|生=建久3年8月9日|卒=建保7年1月27日|父=源頼朝|母=北条政子|注=鹤冈八幡宫で公暁に袭われ落命。',
		'/北条政子|1219/2/13~1225/8/16|:旧暦|読み=ほうじょう まさこ|生=保元2年|卒=嘉禄元年7月11日|父=北条时政|注=尼将军。『吾妻镜』では実朝死去から政子死去まで、北条政子を镰仓殿と扱っている。',
		'/藤原頼经|1226/2/25~|:旧暦|君主名=藤原頼経|読み=ふじわらのよりつね|生=建保6年1月16日|卒=建长8年8月11日|父=九条道家|母=西园寺?子|注=九条頼経とも呼ばれる。出家。行贺と号す。',
		'/藤原頼嗣|1244/6/5~1252/3/31|:旧暦|読み=ふじわらのよりつぐ|生=延応元年11月21日|卒=建长8年9月25日|父=藤原頼経|母=大宫殿|注=九条頼嗣とも呼ばれる。',
		'/宗尊亲王|1252/5/10~1266/8/21|:旧暦|読み=むねたかしんのう|生=仁治3年11月22日|卒=文永11年8月1日|父=后嵯峨天皇|母=平栋子|注=二月騒动[北条教时の乱]。出家。佐渡へ配流。',
		'/惟康亲王|1266/8/25~1289/9/29|:旧暦|読み=これやすしんのう|生=文永元年4月29日|卒=嘉暦元年10月30日|父=宗尊亲王|母=近卫宰子|注=出家。',
		'/久明亲王|1289/10/24~1308/8/20|:旧暦|読み=ひさあきしんのう|生=建治2年9月11日|卒=嘉暦3年10月14日|父=后深草天皇|母=三条房子|注=出家。',
		'/守邦亲王|1308/8/26~1333/7/4|:旧暦|読み=もりくにしんのう|生=正安3年5月12日|卒=元弘3年8月16日|父=久明亲王|母=惟康亲王の娘|注=出家。',
		// '/护良亲王|1333/7/13~1335/8/12|:旧暦|読み=もりよししんのう|生=延庆元年|卒=建武2年7月23日|父=后醍醐天皇|母=源亲子|注=足利直义によって杀害。',
		// '/成良亲王|1335/1/26~1336|:旧暦|読み=なりよししんのう|生=嘉暦元年|卒=康永3年1月6日|父=后醍醐天皇|母=阿野廉子|注=毒杀。',

		// 镰仓幕府の执権一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B9%95%E5%BA%9C%E3%81%AE%E5%9F%B7%E6%A8%A9%E4%B8%80%E8%A6%A7
		// 镰仓幕府の连署一覧
		// https://ja.wikipedia.org/wiki/%E9%8E%8C%E5%80%89%E5%B9%95%E5%BA%9C%E3%81%AE%E9%80%A3%E7%BD%B2%E4%B8%80%E8%A6%A7
		'镰仓幕府执権/北条时政|1203/10/7~|:旧暦|読み=ほうじょう ときまさ|生=保延4年|卒=建保3年1月6日|时期=镰仓时代|注=牧氏事件: 元久2年闰7月20日に、遂に政子と义时は协力して时政を执権から廃して、牧の方と共に强制的に出家させた。',
		'/北条义时|1205/9/5~1224/7/1|:旧暦|読み=ほうじょう よしとき|生=长寛元年|卒=元仁元年',
		'/北条泰时|1224/7/16~|:旧暦|読み=ほうじょう やすとき|生=寿永2年|卒=仁治3年6月15日',
		'/北条経时|1242/7/14~|:旧暦|読み=ほうじょう つねとき|生=元仁元年|卒=寛元4年闰4月1日',
		'/北条时頼|1246/4/10~|:旧暦|読み=ほうじょう ときより|生=嘉禄3年5月14日|卒=弘长3年11月22日',
		'/北条长时|1256/12/10~1264/7/27|:旧暦|読み=ほうじょう ながとき|生=寛喜2年2月27日|卒=文永元年8月21日',
		'/北条政村|1264/9/2~|:旧暦|読み=ほうじょう まさむら|生=元久2年6月22日|卒=文永10年5月27日',
		'/北条时宗|1268/4/18~|:旧暦|読み=ほうじょう ときむね|生=建长3年5月15日|卒=弘安7年4月4日',
		'/北条贞时|1284/4/20~|:旧暦|読み=ほうじょう さだとき|生=文永8年12月12日|卒=応长元年10月26日',
		'/北条师时|1301/9/24~1311/11/2|:旧暦|読み=ほうじょう もろとき|生=建治元年|卒=応长元年9月22日',
		'/北条宗宣|1311/11/13~1312/7/4|:旧暦|読み=ほうじょう むねのぶ|生=正元元年|卒=正和元年6月12日',
		'/北条煕时|1312/7/6~|:旧暦|読み=ほうじょう ひろとき|生=弘安2年|卒=正和4年7月18日',
		'/北条基时|1315/8/12~1316/7/28|:旧暦|読み=ほうじょう もととき|生=弘安9年|卒=元弘3年5月22日',
		'/北条高时|1316/7/29~1326/3/17|:旧暦|読み=ほうじょう たかとき|生=嘉元3年|卒=元弘3年5月22日',
		'/北条贞顕|1326/4/19~1326/4/29|:旧暦|読み=ほうじょう さだあき|生=弘安元年|卒=元弘3年5月22日',
		'/北条守时|1326/5/26~1333/6/30|:旧暦|読み=ほうじょう もりとき|生=永仁3年|卒=元弘3年5月18日',

		// 足利将军一覧
		// https://ja.wikipedia.org/wiki/%E8%B6%B3%E5%88%A9%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'室町幕府/足利尊氏|1338/9/24~1358/6/7|:旧暦|読み=あしかがたかうじ|生=嘉元3年|卒=延文3年4月30日|父=足利贞氏|母=上杉清子|时期=室町时代',
		// '/兴良亲王|1339/2/10~1364/9/10|:旧暦|読み=おきよししんのう|生=嘉暦元年|卒=正平19年8月14日病没?',
		// '/宗良亲王|1352/1/18~1368|:旧暦|読み=むねよししんのう|生=応长元年|卒=至徳2年8月10日|父=后醍醐天皇|母=二条为子',
		'/足利义诠|1359/1/7~1367/12/28|:旧暦|読み=あしかが よしあきら|生=元徳2年6月18日|卒=贞治6年12月7日|父=后醍醐天皇|母=阿野廉子',
		'/足利义満|1369/2/7~1395/1/8|:旧暦|読み=あしかがよしみつ|生=延文3年8月22日|卒=応永15年5月6日|父=足利义诠|母=纪良子',
		// '/尹良亲王|1386/9/2~1424/9/7|:旧暦|読み=ゆきよししんのう|生=贞治3年?|卒=応永31年8月15日|父=宗良亲王|注=敌军[北朝侧]に囲まれ、自害。',
		'/足利义持|1395/1/8~|:旧暦|読み=あしかがよしもち|生=至徳3年2月12日|卒=応永35年1月18日|父=足利义満|母=藤原庆子|注=出家。',
		'/足利义量|1423/4/28~|:旧暦|読み=あしかがよしかず|生=応永14年7月24日|卒=応永32年2月27日|父=足利义持|母=日野栄子',
		'/足利义持|1425/3/17~1428/2/3|:旧暦|読み=あしかがよしもち|生=至徳3年2月12日|卒=応永35年1月18日|父=足利义満|母=义量早世に伴う将军代理|注=出家。',
		'/足利义教|1429/4/18~1441/7/12|:旧暦|読み=あしかがよしのり|生=明徳5年6月14日|卒=嘉吉元年6月24日|父=足利义満|母=藤原庆子|注=义宣→义教',
		'/足利义胜|1442/12/9~1443/8/16|:旧暦|読み=あしかがよしかつ|生=永享6年2月9日|卒=嘉吉3年7月21日|父=足利义教|母=日野重子',
		'/足利义政|1449/5/21~|:旧暦|読み=あしかがよしまさ|生=永享8年1月2日|卒=延徳2年正月7日|父=足利义教|母=日野重子|注=义成→义政',
		'/足利义尚|1474/1/7~|:旧暦|読み=あしかがよしひさ|生=寛正6年11月23日|卒=长享3年3月26日|父=足利义政|母=日野富子|注=义尚→义煕',
		'/足利义政|1489/4/26~1490/1/27|:旧暦|読み=あしかがよしまさ|生=永享8年1月2日|卒=延徳2年正月7日|父=足利义教|母=日野重子|注=义量早世に伴う将军代理',
		'/足利义材|1490/7/22~1493/8/11|:旧暦|読み=あしかがよしき|生=文正元年7月30日|卒=大永3年4月9日|父=足利义视|母=日野重政の娘|注=义材→义尹→义稙',
		'/足利义澄|1495/1/23~1508/5/15|:旧暦|読み=あしかがよしずみ|生=文明12年12月15日|卒=永正8年8月14日|父=足利政知|母=武者小路隆光の娘|注=义高→义遐→义澄',
		'/足利义稙|1508/7/28~|:旧暦|読み=あしかがよしたね|生=文正元年7月30日|卒=大永3年4月9日|父=足利义视|母=日野重政の娘|注=义材→义尹→义稙(义材再任)',
		'/足利义晴|1522/1/22~|:旧暦|読み=あしかがよしはる|生=永正8年3月5日|卒=天文19年5月4日|父=足利义澄|母=日野永俊の娘',
		'/足利义辉|1547/1/11~1565/6/17|:旧暦|読み=あしかがよしてる|生=天文5年3月10日|卒=永禄8年5月19日|父=足利义晴|母=庆寿院|注=义藤→义辉',
		'/足利义栄|1568/3/6~1568/10/20|:旧暦|読み=あしかがよしひで|生=天文7年|卒=永禄11年9月|父=足利义维|母=大内义兴の娘|注=义亲→义栄(-9月末)',
		'/足利义昭|1568/11/7~1588/2/9|:旧暦|読み=あしかがよしあき|生=天文6年11月3日|卒=庆长2年8月8日|父=足利义晴|母=庆寿院|注=义秋→义昭',

		'织田政権/织田信长|1573/8/25~1582/6/21|:旧暦|时期=安土桃山时代|生=天文3年5月12日?|卒=天正10年6月2日|注=天正10年6月2日早朝、本能寺の変。',
		'/织田秀信|1582/7/16~1583/8/17|:旧暦|时期=安土桃山时代|生=天正8年|卒=庆长10年5月27日|注=天正10年6月27日に开かれた、清洲会议|注=天正11年の6月までは「织田体制」として政権は机能していたとされている',
		'豊臣政権/丰臣秀吉|1585/1/31~|:旧暦|时期=安土桃山时代|君主=豊臣秀吉|生=天文6年2月6日?|卒=庆长3年8月18日|注=羽柴氏政権とも言われる。',
		'/丰臣秀赖|1598/9/18~|:旧暦|君主=豊臣秀頼|生=文禄2年8月3日|卒=庆长20年5月8日|注=庆长19年からの大坂の阵において、家康により灭ぼされた。',

		// 徳川将军一覧
		// https://ja.wikipedia.org/wiki/%E5%BE%B3%E5%B7%9D%E5%B0%86%E8%BB%8D%E4%B8%80%E8%A6%A7
		'江戸幕府/徳川家康|1603/3/24~|:旧暦|时期=江戸时代|読み=とくがわいえやす|生=天文11年12月26日|卒=元和2年4月17日|父=松平広忠|母=于大|注=松平元信→松平元康→徳川家康|注=庆长八年二月十二日、家康は征夷大将军の官职を获得。',
		'/徳川秀忠|1605/2/18~|:旧暦|読み=とくがわひでただ|生=天正7年4月7日|卒=寛永9年正月24日|父=徳川家康|母=西郷局',
		'/徳川家光|1623/1/31~|:旧暦|読み=とくがわいえみつ|生=庆长9年7月17日|卒=庆安4年4月20日|父=徳川秀忠|母=崇源院',
		'/徳川家纲|1651/2/20~|:旧暦|読み=とくがわいえつな|生=寛永18年8月3日|卒=延宝8年5月8日|父=徳川家光|母=宝树院',
		'/徳川纲吉|1680/2/1~|:旧暦|読み=とくがわつなよし|生=正保3年正月8日|卒=宝永6年正月10日|父=徳川家光|母=桂昌院',
		'/徳川家宣|1709/2/10~1712/2/7|:旧暦|読み=とくがわいえのぶ|生=寛文2年4月25日|卒=正徳2年10月14日|父=徳川纲重|母=长昌院|注=纲豊→家宣',
		'/徳川家継|1713/1/26~|:旧暦|読み=とくがわいえつぐ|生=宝永6年7月3日|卒=正徳6年4月30日|父=徳川家宣|母=月光院',
		'/徳川吉宗|1716/8/9~|:旧暦|読み=とくがわよしむね|生=贞享元年6月20日|卒=寛延4年6月20日|父=徳川光贞|母=浄円院|注=松平頼方→徳川吉宗',
		'/徳川家重|1745/2/1~|:旧暦|読み=とくがわいえしげ|生=正徳元年12月21日|卒=宝暦11年6月12日|父=徳川吉宗|母=深徳院',
		'/徳川家治|1760/2/17~1786/1/30|:旧暦|読み=とくがわいえはる|生=元文2年5月22日|卒=天明6年8月25日|父=徳川家重|母=至心院',
		'/徳川家斉|1787/2/18~|:旧暦|読み=とくがわいえなり|生=安永2年10月5日|卒=仁孝天皇天保12年闰正月30日|父=徳川治済|母=慈徳院',
		'/徳川家庆|1837/2/5~|:旧暦|読み=とくがわいえよし|生=寛政5年5月14日|卒=嘉永6年6月22日|父=徳川家斉|母=香琳院',
		'/徳川家定|1853/2/8~|:旧暦|読み=とくがわいえさだ|生=文政7年4月8日|卒=安政5年7月6日|父=徳川家庆|母=本寿院|注=家祥→家定',
		'/徳川家茂|1858/2/14~1866/2/15|:旧暦|読み=とくがわいえもち|生=弘化3年闰5月24日|卒=庆応2年7月20日|父=徳川斉顺|母=実成院|注=庆福→家茂',
		'/徳川庆喜|1867/1/10~1868/1/3|:旧暦|読み=とくがわよしのぶ|生=仁孝天皇天保8年9月29日|卒=大正2年11月22日|父=徳川斉昭|母=吉子女王|注=昭致→庆喜',

		// ------------------------------------------------

		// 台湾日治时期 武装反抗日本对台湾殖民统治发动起义而建立的政权
		'台湾民主国/唐景崧/永清|1895/5/25~|:清|疑|时期=日治台湾|总统=唐景崧|注=台湾通史/卷4:光绪二十一年夏五月朔，台湾人民自立为民主国，奉巡抚唐景崧为大总统。...初二日，绅士邱逢甲率人民等公上大总统之章。景崧受之，建元永清，旗用蓝地黄虎。|注=1895年5月25日，大总统唐景崧于《台湾民主国独立宣言》中，首度公布并使用此年号。|注=1895年5月8日马关条约生效。1895年6月17日，首任台湾总督桦山资纪在原布政使司衙门宣布在台湾「始政」。|注=1895年6月6日唐景崧和陈季同搭乘德国 Arthur 号内渡',
		'/刘永福/=|1895/6/26~10/21|:清|疑|时期=日治台湾|总统=刘永福|据=Wikipedia|注=Wikipedia: 1895年6月26日，余众在台南拥立民主国大将军刘永福为第二任大总统。|注=Wikipedia: 1895年10月19日刘永福兵败逃离，10月21日日军攻入台南，10月23日控制全台湾，台湾民主国灭亡，国祚150天。|注=台湾通史/卷4:十三日，日军以一大队迫狮球岭。台人请景崧驻八堵，为死守计，不从。...景崧既入，携巡抚印奔沪尾，乘德商轮船逃。...十四日夜半至城外，城兵犹守战。黎明乃陷。十五日，川村景明入台北，以骑兵略淡水。十八日，能久亲王至。二十一日，总督桦山资纪亦至，遂开府于此，以理军民之政。...台南既闻台北之报，议奉永福为大总统。不从。请移驻郡治，强之乃许。...六月二十日，日军攻头份，新楚军副将杨紫云战殁，维义败回。日军攻苗栗，前敌诸军请济师，永福苦无以应。...初四日辰刻，日军入城，海军亦至安平，遗兵二十余人被杀，而台湾民主国亡。',

		'铁国山/九千岁/天运|1896/6/14~|:清|疑|时期=日治台湾|君主名=简义;简宜;简精华|表字=精华|生=1835年|卒=1898年|据=Wikipedia|注=Wikipedia: 明治29年2月（1896年）于古坑大坪顶铁国山自立为王...刘永福旧属简义为首领，称「九千岁」...1896年6月14日，简义于铁国山大会群雄，丰备牲礼，祭告天地，称「天运」元年...1896年10月05日，简义独自一人下山归顺投降日本。',
		'/霸王/=|1896/10/6~12/14|:清|疑|时期=日治台湾|君主名=柯铁;柯铁虎|君主号=铁虎|生=1876年|卒=1900年|据=Wikipedia|注=Wikipedia: 简义叛离后，刘得杓、黄才、张吕赤、赖福来等首领，共举柯铁为铁国山「总统」，称「霸王」。...1899年放弃抵抗，归顺日本官方，于1900年病逝，而柯铁虎义军旋即遭总督府派兵全数歼灭。',

		// 大靖政权
		'大靖/黄国镇/大靖|1897~1899/3|:CE|疑|时期=日治台湾|君主名=黄国镇|据=Wikipedia|注=Wikipedia: 1897年1月至1898年11月25日止，台湾抗日义军首领黄国镇在近两年内控制嘉义东堡（山地）49个庄，组织联庄自卫，并自称皇帝，定年号为「大靖」。',

		'大明慈悲国/余清芳|1915/7/6~|:CE|疑|时期=日治台湾|据=Wikipedia|注=Wikipedia: 西来庵事件 1915年7月6日，在遭公家通缉下，以「大明慈悲国奉旨平台征伐天下大元帅余」名义发表了《大元帅余告示文》，发动起事',
		'/江定|1915/8/22~1916/416|:CE|疑|据=Wikipedia|注=Wikipedia: 1915年8月22日，余清芳在王莱庄（今台南市楠西区），乡人设宴款待，却在酒酣耳热之际，将余清芳绑缚，送交日军。9月被处决。江定1916年4月16日出山接受招安。日人于五月十八日将其逮捕，并判处死刑；9月13日行刑。'

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"korea"}
(CeL.era.pass_on.countries["한국"] = [
		// Korean

		'卫满朝鲜/卫满|-194~-161||疑|国名=卫氏朝鲜|注=第二代王卫满儿子，史失其名',
		'/右渠王|-129~-108||疑|君主=卫右渠|注=卫满的孙子。前109年，卫右渠与西汉发生冲突，致使汉武帝派兵侵略朝鲜。翌年，卫右渠被属下暗杀，随后卫氏朝鲜为西汉所灭，设置汉四郡。',

		// 朝鲜三国时代

		'新罗/赫居世居西干|-57/6/8~|/4/28=:中国|疑|朝代=신라;斯罗;斯卢;驷卢;사라;사로|君主=혁거세거서간;赫居世居瑟邯;혁거세거슬한|据=时间规范资料库',
		'/南解次次雄|4/5/8~|4=:中国|疑|君主=남해차차웅;南解慈充',
		'/儒理尼师今|24/11/20~|10=:中国|疑|君主=유리이사금;弩尼叱今;弩礼尼师今;儒理尼叱今;弩礼尼叱今',
		'/脱解尼师今|57/11/16~|10=:中国|疑|君主=탈해이사금;吐解尼师今;脱解尼叱今;吐解尼叱今',
		'/婆娑尼师今|80/10/3~|9=:中国|疑|君主=파사이사금;婆娑尼叱今',
		'/祇摩尼师今|112/12/7~|11=:中国|疑|君主=지마이사금;祇味尼师今;祇摩尼叱今;祇味尼叱今;祇磨尼师今;祇磨尼叱今',
		'/逸圣尼师今|134/10/6~|9=:中国|疑|君主=일성이사금;逸圣尼叱今',
		'/阿达罗尼师今|154/4/1~|3=:中国|疑|君主=아달라이사금;阿达罗尼叱今',
		'/伐休尼师今|184/4/28~|4=:中国|疑|君主=벌휴이사금;发晖尼师今;발휘이사금;伐休尼叱今;发晖尼叱今',
		'/奈解尼师今|196/6/14~|5=:中国|疑|君主=나해이사금;奈解尼叱今',
		'/助贲尼师今|230/4/30~|4=:中国|疑|君主=조분이사금;诸贵尼师今;助贲尼叱今;诸贵尼叱今',
		'/沾解尼师今|247/7/20~|6=:中国|疑|君主=첨해이사금;沾解尼叱今;理解尼师今;理解尼叱今;𧮪解尼师今;𧮪解尼叱今',
		'/味邹尼师今|262/2/6~|:中国|疑|君主=미추이사금;味照尼师今;味邹尼叱今;味照尼叱今;未邹尼师今;未邹尼叱今;未召尼师今;未召尼叱今;味炤尼师今;味炤尼叱今;未祖尼师今;未祖尼叱今',
		'/儒礼尼师今|284/11/25~|11=:中国|疑|君主=유례이사금;儒礼尼叱今;儒理尼叱今;世里智王',
		'/基臨尼师今|299/1/19~|12=:中国|疑|君主=기림이사금;基立尼师今;基立尼叱今;基臨尼叱今',
		'/讫解尼师今|310/8/12~|7=:中国|疑|君主=흘해이사금;讫解尼叱今;乞解尼师今;乞解尼叱今',
		'/奈勿尼师今|356/6/15~|5=:中国|疑|君主=나물이사금;那密尼师今;나밀이사금;奈勿尼叱今;那密尼叱今;奈勿麻立干',
		'/实圣尼师今|402/4/18~|3=:中国|疑|君主=실성이사금;实圣尼叱今;实圣麻立干;实主王;宝金王',
		'/讷祇麻立干|417/6/30~|6=:中国|疑|君主=눌지마립간;讷祗麻立干;内只王',
		'/慈悲麻立干|458/9/24~|9=:中国|疑|君主=자비마립간',
		'/炤知麻立干|479/4/8~|3=:中国|疑|君主=소지마립간;毗处麻立干;비처마립간;知王',
		'/智证麻立干|501/1/5~|12=:中国|疑|君主=지증마립간;智订麻立干;智哲麻立干;智度路王',
		'/法兴王|514/9/5~|8=:中国|疑|君主=법흥왕',
		'/法兴王/建元|536/2/8~|:中国|疑|年号=건원',
		'/真兴王/=|540/9/17~|5/8/=:中国|疑|君主=진흥왕',
		'/开国|551/1/23~|:中国|疑|君主=진흥왕|年号=개국',
		'/大昌|568/2/14~|:中国|疑|君主=진흥왕|年号=태창',
		'/鸿济|572/1/31~|:中国|疑|君主=진흥왕|年号=홍제',
		'=/真智王|576/10/8~|9=:中国|疑|君主=진지왕;舍轮王;真智王;사륜왕',
		'/真平王|579/8/24~|/7/17=:中国|疑|君主=진평왕;白净王;真平王;백정왕',
		'/=/建福|584/3/17~|2=:中国|疑|君主=진평왕;白净王;백정왕|年号=건복',
		'/善德王/=|632/2/26~|49/2/=:中国|疑|君主=선덕왕;善德女王;선덕여왕|君主性别=女',
		'/=/仁平|634/2/4~|:中国|疑|年号=인평',
		'/真德王/=|647/2/17~|14/1/8=:中国|疑|君主=진덕왕;真德女王|君主性别=女',
		'/真德王/太和|647/8/6~|7=:中国|疑|年号=태화',
		'=/武烈王|654/4/22~|4=:中国|疑|君主=태종무열왕|谥=武烈|庙号=太宗',
		'/文武王|661/8/1~|7=:中国|疑|君主=문무왕;文虎王',
		'/神文王|681/7/21~|7=:中国|疑|君主=신문왕',
		'/孝昭王|692/9/16~|8=:中国|疑|君主=효소왕',
		// 应付久视元年十月甲寅恢复寅正。
		'/=|700/5/23~|9/5/=:唐|疑',
		'/圣德王|702/8/28~|8=:中国|疑|君主=성덕왕',
		'/孝成王|737/4/5~|3=:中国|疑|君主=효성왕',
		'/景德王|742/7/7~|6=:中国|疑|君主=경덕왕',
		'/惠恭王|765/7/23~|7=:中国|疑|君主=혜공왕',
		'/宣德王|780/6/7~|5=:中国|疑|君主=선덕왕',
		'/元圣王|785/2/27~|/1/14=:中国|疑|君主=원성왕',
		'/昭圣王|799/2/10~|:中国|疑|君主=소성왕;昭成王',
		'/哀庄王|800/7/25~|7=:中国|疑|君主=애장왕',
		'/宪德王|809/9/13~|8=:中国|疑|君主=헌덕왕',
		'/兴德王|826/12/3~|11=:中国|疑|君主=흥덕왕',
		'/僖康王|837/1/11~|12=:中国|疑|君主=희강왕',
		'/闵哀王|838/2/28~|2=:中国|疑|君主=민애왕;敏哀王',
		'/神武王|839/3/9~|/闰1/20=:中国|疑|君主=신무왕;神虎王',
		'/文圣王|839/9/4~|/7/23=:中国|疑|君主=문성왕',
		'/宪安王|857/10/22~|10=:中国|疑|君主=헌안왕',
		'/景文王|861/3/15~|2=:中国|疑|君主=경문왕',
		'/宪康王|875/8/13~|/7/9=:中国|疑|君主=헌강왕',
		'/定康王|886/8/9~|/7/6=:中国|疑|君主=정강왕',
		'/真圣王|887/7/29~|/7/6=:中国|疑|君主=진성왕;真圣女王|君主性别=女',
		'/孝恭王|898/1/1~|/12/5=:中国|疑|君主=효공왕',
		'/神德王|912/5/20~|5=:中国|疑|君主=신덕왕',
		'/景明王|917/8/21~|8=:中国|疑|君主=경명왕',
		'/景哀王|924/10/2~|9=:中国|疑|君主=경애왕',
		'/敬顺王|927/11/27~935/12/28|11=:中国|疑|君主=경순왕',

		'高句丽/东明圣王|-37/2/2~|:中国|疑|朝代=고구려;高勾丽|君主=동명성왕|据=时间规范资料库',
		'/琉璃明王|-19/11/5~|10=:中国|疑|君主=유리명왕;琉璃王;瑠璃王;累利王',
		'/大武神王|18/10/29~|11=:中国|疑|君主=대무신왕;大解朱留王;大虎神王',
		'/闵中王|44/11/9~|10=:中国|疑|君主=민중왕',
		'/慕本王|48/8/28~|8=:中国|疑|君主=모본왕',
		'/太祖王|53/12/29~|12=:中国|准=2年|君主=大祖大王;태조대왕;国祖王',
		'/次大王|147/1/20~|12=:中国|疑|君主=차대왕',
		'/新大王|165/12/21~|11=:中国|疑|君主=신대왕',
		'/故国川王|179/11/17~|10=:中国|疑|君主=고국천왕;故国坏王',
		'/山上王|197/7/3~|6=:中国|疑|君主=산상왕',
		'/东川王|227/7/2~|6=:中国|疑|君主=동천왕;东襄王',
		'/中川王|248/11/3~|10=:中国|疑|君主=중천왕;中壤王',
		'/西川王|270/11/30~|11=:中国|疑|君主=서천왕;西壤王',
		'/烽上王|292/4/4~|3=:中国|疑|君主=봉상왕;雉葛王',
		'/美川王|300/9/30~|9=:中国|疑|君主=미천왕;好壤王;妙禳王',
		'/故国原王|331/4/24~|3=:中国|疑|君主=고국원왕;国罡上王;冈上王',
		'/小兽林王|371/11/17~|/10/24=:中国|疑|君主=소수림왕;小解朱留王',
		'/故国壤王|384/12/29~|12=:中国|疑|君主=고국양왕',
		'/广开土王/永乐|391/7/18~|6=:中国|疑|君主=광개토왕|年号=영락',
		'=/长寿王|413/2/17~|:中国|疑|君主=장수왕',
		'/=/延寿|451/2/17~|:中国|疑|年号=연수',
		'=/文咨王|492/2/14~|:中国|疑|君主=文咨明王;문자명왕;明治好王',
		'/安臧王|520/1/6~|12=:中国|疑|君主=안장왕;安藏王',
		'/安原王|531/6/30~|6=:中国|疑|君主=안원왕',
		'/阳原王|545/4/27~|4=:中国|疑|君主=양원왕;阳岗上好王',
		'/平原王|559/4/23~|4=:中国|疑|君主=평원왕;平岗上好王;平冈王',
		'/婴阳王|590/12/3~|11=:中国|疑|君主=영양왕;平阳王',
		'/荣留王|618/10/24~|10=:中国|疑|君主=영류왕',
		'/宝臧王|642/11/28~668/12/8|11=:中国|疑|君主=보장왕',

		'百济/温祚王|-18/2/2~|:中国|疑|朝代=백제|君主=온조왕|据=时间规范资料库',
		'/多娄王|28/4/14~|3=:中国|疑|君主=다루왕',
		'/己娄王|77/11/5~|10=:中国|疑|君主=기루왕',
		'/盖娄王|129/1/8~|12=:中国|疑|君主=개루왕',
		'/肖古王|166/8/14~|7=:中国|疑|君主=초고왕;素古王',
		'/仇首王|214/12/20~|11=:中国|疑|君主=구수왕;贵须王',
		'/古尒王|234/8/13~|7=:中国|疑|君主=고이왕',
		'/责稽王|287/1/2~|12=:中国|疑|君主=책계왕;靑稽王',
		'/汾西王|298/11/21~|10=:中国|疑|君主=분서왕',
		'/比流王|304/12/14~|11=:中国|疑|君主=비류왕',
		'/契王|344/12/21~|11=:中国|疑|君主=계왕',
		'/近肖古王|346/10/31~|10=:中国|疑|君主=근초고왕',
		'/近仇首王|376/1/8~|12=:中国|疑|君主=근구수왕;讳须王',
		'/枕流王|384/6/5~|5=:中国|疑|君主=침류왕',
		'/辰斯王|386/1/17~|12=:中国|疑|君主=진사왕',
		'/阿莘王|392/12/30~|12=:中国|疑|君主=아신왕;阿芳王;河芳王',
		'/腆支王|405/11/8~|10=:中国|疑|君主=전지왕;直支王;真支王',
		'/久尒辛王|420/4/29~|4=:中国|疑|君主=구이신왕',
		'/毗有王|428/1/3~|12=:中国|疑|君主=비유왕',
		'/盖卤王|455/10/27~|10=:中国|疑|君主=개로왕;近盖娄王',
		'/文周王|475/11/14~|10=:中国|疑|君主=문주왕;汶洲王;文明王',
		'/三斤王|477/10/23~|10=:中国|疑|君主=삼근왕;壬乞王;三乞王',
		'/东城王|479/12/29~|12=:中国|疑|君主=동성왕',
		'/武宁王|501/12/26~|12=:中国|疑|君主=무령왕;虎宁王',
		'/圣王|523/6/29~|6=:中国|疑|君主=성왕',
		'/威德王|554/9/13~|8=:中国|疑|君主=위덕왕',
		'/惠王|599/1/2~|12=:中国|疑|君主=혜왕;献王',
		'/法王|599/7/28~|7=:中国|疑|君主=법왕',
		'/武王|600/7/16~|6=:中国|疑|君主=무왕;武康王;武广王;虎王',
		'/义慈王|641/5/15~660/8/11|4=:中国|疑|君主=의자왕',

		// 后三国时代

		'后百济/甄萱/正开|901/1/23~936/10/17|:中国|疑|朝代=후백제|君主=견훤|年号=정개|据=时间规范资料库',

		'摩震/弓裔|901/1/23~|:中国|疑|国号=마진;后高句丽;후가우리|君主=궁예|君主名=金弓裔|注=后高句丽(高丽)904年建国号摩震。911年又改国号为泰封。918年被部将王建的高丽所灭。《资治通鉴》中作「大封国」。|据=时间规范资料库',
		'/=/武泰|904/1/21~|:中国|疑|年号=虎泰;무태',
		'/圣册|905/2/7~|:中国|疑|年号=성책',
		'泰封/=/水德万岁|911/2/2~|:中国|疑|国号=태봉;摩震|年号=수덕만세',
		'/政开|914/4/28~|4=:中国|疑|年号=정개',

		// 음력(阴历)
		'음력|917/1/26~2051/2/10|917/=4nyy59g 5gi 3txi4b8 48a 3mw44z1 3prw47d 59g 4uq05go 5as 4gnp3fu 505 3psh47e 4pbv3tf 3hl 3b1j3px 3my 4mg3591 3sd84gy 5ea 3t534aa 449 3mmt42y 59h 3z2p4h0 4sqx5es 4ac 3qvb505 46i 4rkz5s9 3z8c4aw 5bc 4ihk3p0 57a 4fv958y 5sh 400i4b5 3ep648a 3p1 37x342t 58y 55c35uq 40984ic 48a 3mw946t 46i 4oet5dw 5us 40aq5as 4gne57u 505 3ql347d 5e1 3swj4a0 4plo3px 3oq 4mg9591 4gi 4so55ea 4aa 3b4y449 3mmy46i 5np 3z2u4h0 5es 3t504ac 3qz0505 46i 54895sa 4h4 4t913u0 52s 4g9e3me 4fve51u 5u9 400m4i9 3u1 3a903p1 39i442v 3o4 56x55uq 4ic 3rd148a 439 3mm95re 4oez5dw 5us 4pl35as 50q 4g4j505 3qks5u2 5e1 3swo4a1 3q1 32513oq 579 3qkx4gi 4sob5eq 4aa 3b5347t 42y 4o105np 4gy 4se95gk 3t6x52s 47u 3mna4zu 5r9 3z4i4i0 4t983u0 52s 4g9k3mi 56z 3qjo5sh 3ha 3eoi3u1 3a953p1 3oa 4mg659e 5ua 40824ic 3rd648a 439 3mmw46i 59g 57d05go 5as 3rcx50q 4cyx579 47e 4sh15e1 4a0 4poz3q1 32573oq 579 3wwo4gi 5e9 3t444aa 3q2 38gy42z 39gq5r9 4gy 4sp25es 4ac 3nt050a 3mp74zv 47d 3z4o4fc 5ew 4ih059w 4g9o3mi 577 3qju5u9 4i9 3eom3u1 3p1 380i3oq 4o1759g 5uq 40874ig 48a 3a91439 42y 4o0x5d0 57dl4a0 5as 3rd250q 505 3psj47e 4sh75e9 4a0 4pp33q1 3fw 4g4l579 4ei 4sgy5e9 3t4a4aa 3q1 3a1y431 3o5 4nyq4gy 4t3g5es 4ac 3qyw50a 42z 3mic47d 4h0 4t4y5ew 4ih559w 50a 4f53577 47d 400j4i9 3eos3u1 3p1 380o42y 591 3qrp5uq 4i9 3epu48a 3a95445 42y 4o135d1 49w 4pl05as 3rf050s 505 3pso462 5e1 3swk4a0 5aw 4gpe3ho 4fd6579 576 4sh25e9 4a9 3b503q1 3a23431 42d 4nyx59k 5eq 3t514ac 47u 3mox431 3mij47d 4h0 4t525ew 52s 4g8z50a 4fxn577 47d 55bc5ep 4aa 3b5x44a 431 2yfm42t 3z2y4h0 5es 3t6u4ac 47u 3mp04yz 3prw47d 4i0 4t8o5ew 52s 4g9h3mi 579 3qk149d 408b4i9 3u1 3a933p1 3oq 4mg3591 49e 40814ic 3sy048a 445 3mmt46i 5d1 3sr54a0 4pl55aw 50s 4g5j505 47e 4sdf5e1 3sik4b5 3qh 32543p1 3md 4m6t58y 5e9 3twi4b6 3bka47u 431 39h346d 59e 4t375gk 4b8 3bk147u 3mp54zx 46h 4oet4i0 5go 3tz75as 3qze3my 579 3qk749d 5ap 3g9f4a1 3b1n3px 3oq 4mg9591 49e 4pid5as 48i 3b1e445 3mmy46i 5d1 3sra4a0 5b8 3rlw52k 4g5o579 47e 550p5s9 3wo 4q393u1 3hw 4g5v3md 4m6z58y 5sh 3twn4b6 3qi 3a90431 3m5846d 59e 57bd5gk 4b8 3rd148a 431 3mmp47d 4of05e0 5go 4pl35as 50q 4fc4579 3wws49d 5e9 3swo4a1 3px 323a3oq 591 3qs24gx 4sob5es 4aa 3b4n445 42y 4o105r9 4h0 4sqp5es 3t6x52s 506 3psm4zu 5s9 3z824i0 4t973u1 3hw 4g5z3md 576 55435u9 4i9 3eoy3u2 3a95439 42e 4nyu59g 5uq 408y4ic 3rd650q 4vp 3mmw47d 5ac 57d05uw 5as 3rcx50q 4g4p579 47e 4sh15e9 4a0 4poz3px 38ez42y 591 3yon4gy 5e9 3t504aa 3q2 39zl42y 4o155r9 4h0 4t515ew 4ac 3nt0506 3pss56y 5s9 3z884i8 5ew 4ihg3p1 31p83o6 58y 554a5u9 5ap 3ep23u2 3p1 380i42u 4nz059g 5uq 40934ic 48a 3mw54z9 46i 4oep5dw 57d55uw 5as 3rdi3fu 505 3psj47e 4sh75e9 4a0 4ppj3q1 3my 4mg5591 4gi 4so25e9 3t564aa 3q2 3a0642y 5np 3z2q4h0 4t585ew 4ac 3nt450a 4yz 3pno5s9 4i0 4t8i5ew 4ihl3p1 3fe 4fvq58y 5s9 407n4i9 3ep748a 3p1 380o436 590 56x05uq 4ia 3ema48a 3mw9505 46i 4ofa5dw 5us 4pkz5as 3rdn3fu 505 3pso4ei 5e1 3swk4a8 5ax 324y3oq 4mga591 4gi 4so65ep 4aa 3b503q2 3a2342z 42t 3z2w4h0 5es 3t6s4ac 47u 3mox4yz 3pnv5s9 4i0 4t8m5ew 52s 4g9f3mi 4fvv58y 5s5 407r4i9 3u1 3a913p1 3mi 4mg3591 3sd349u 4ia 3rd248a 439 3mms46i 59h 3sr649w 4pl35as 50s 4c6d505 46e 4rkz5e1 3swo4a9 3q1 32523ot 3md 4fv858y 5e9 3twj4aa 3b5z4ey 3ot 39h142t 59e 4soz5eq 3t6v4ac 47u 3mp24z1 46d 4oes4i0 5ew 4igz4aa 4g9j3mi 579 3qk547l 4i9 3eoj3u1 3a943p1 3oq 4mg6591 49e 4pic5aq 48a 33xf439 3mmv4dm 59h 3sr949w 5as 3rlw50s 4g5l505 47e 4rl25e1 4a0 4q383qh 3fw 4g5v3md 4m6v58y 5e9 3t514b6 3qi 3a1w431 39i146d 59e 55c65gk 4b8 3o7948a 431 3mj646h 4oev5ag 5go 4j9h5as 50q 4fc3579 3ql649e 5e9 3z864a1 3px 32393oq 579 3qkz49e 4so75ec 48i 3b1h445 42y 4o105d1 4gy 4sqq5es 3rly52s 506 3mms4zu 5s5 3z4i4i0 4q3a3qh 3hw 4g5x3me 56y 55435sh 4b5 3bj63u2 3a92431 42e 4nys59e 5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plf3px 323b3oq 579 3qs559e 5e9 3sxw4aa 3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506 3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh 4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4o0y59g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4g4k591 4eq 4so25e9 3t464aa 3q2 38f942y 591 3yoi4gy 4sp35es 4ac 3nt1506 46j 3mhw5s9 4h0 4t4y5ew 4ihi3hx 3fe 4f3956y 5s9 3z834i9 3ep33u2 3p1 380m42e 58y 55c45uq 4ia 3epu48a 3a93439 42y 4o115d0 5us 40ar5as 3rd450q 505 3psm47e 5e1 3swk4a0 5aw 4gpf3my 4g4n591 4eq 4so55e9 4a9 3b503q2 3a0842z 3o5 3yom4h0 5es 3t504ac 3nt650a 4yz 3mhy5s9 4h0 4t515ew 52s 4g9f3fe 4f3c576 5s9 400l4i9 3u1 33xg3p1 3mi 4mg258z 3qrr5uq 4ia 3epx48a 439 3knn42y 4ofd5dx 49w 4pl15as 48a 3mw4505 46i 4of65e1 3swm4a0 5aw 4gph3n0 579 3qkz4gi 4sob5e9 4aa 3b523q2 3ot 37w542d 4gi 4soy5es 3t6v4ac 44a 3mp14yz 46d 3z4j|参照用|据=한국표준연력',

		'泰封/弓裔/政开|917/1/26~|4/=:음력',

		'高丽/太祖/天授|918/7/25~|:음력|注=高丽史1卷-世家1-太祖1-01-01-0918: (戊寅)元年夏六月丙辰，即位于布政殿，国号高丽，改元天授。',
		// TODO: 16/=:后唐
		'=/=|933/4/2~|16/=:음력|注=高丽史2卷-世家2-太祖2-16-01-0933: 十六年春三月辛巳唐遣王琼杨昭业来册王..又赐历日自是除天授年号行后唐年号',
		'=/惠宗|음력944~|:음력|注=高丽史2卷-世家2-惠宗-00-01-0000: (943年)二十六年五月丙午太祖薨奉遗命即位.',
		'/定宗|음력946~|:음력|注=高丽史2卷-世家2-定宗-00-01-0000: (945年)惠宗二年九月戊申群臣奉王即位.949年三月丙辰逝世。',
		'/光宗|음력:950~975|:음력|注=高丽史2卷-世家2-光宗-00-01-0000: (949年)定宗四年三月丙辰受内禅即位.',
		'/=/光德|949/4/13~951/12/30|:음력|注=《고려사》에서는 950년을 광종 1년으로 잡고 있지만, 그때는 조선과는 달리 유년칭원법(逾年称元法)을 쓰지 않았기 때문에 각종 금석문의 자료에서 나타나는 것처럼 949년을 광종 1년 즉 광덕 원년으로 보는 것이 타당하다.;高丽史2卷-世家2-光宗-02-02-0951: 冬十二月始行后周年号.;2年（951年） - 后周の年号の使用开始（『高丽史』光宗世家）。ただし、今西龙によると、光徳は4年まで続き、953年に后周の册封を受けて広顺の年号を使用したという。',
		'/峻丰|960/1/31~963/11/18|:음력|注=高丽光宗的峻丰年号，其实就是建隆年号，只是使用避讳代字。建隆的建避太祖王建的建改为峻，建隆的隆避世祖王隆的隆改为丰。',
		'=/景宗|음력976~|:음력',
		'/成宗|982/1/28~|:음력',
		'/穆宗|998/1/31~|:음력',
		'/显宗|1010/1/18~|:음력',
		'/德宗|1032/2/14~|:음력',
		'/靖宗|1035/2/11~|:음력',
		// 遼史/第44卷/志14/历象志下
		// 宋元丰元年十二月，诏司天监考辽及高丽、日本国历与《奉元历》同异。辽己未岁气朔与《宣明历》合，日本戊午岁与辽历相近，高丽戊午年朔与《奉元历》合，气有不同。
		'/文宗|1047/1/29~|:음력',
		'/顺宗|1083/1/21~|:음력',
		'/宣宗|1084/2/9~|:음력',
		'/献宗|1095/2/8~|:음력',
		'/肃宗|1096/1/28~|:음력',
		'/睿宗|1106/2/6~|:음력',
		'/仁宗|1123/1/29~|:음력',
		'/毅宗|1147/2/2~|:음력',
		'/明宗|1171/2/7~|:음력',
		'/神宗|1198/2/8~|:음력',
		'/熙宗|1205/1/22~|:음력',
		'/康宗|1212/2/5~|:음력',
		'/高宗|1214/2/12~|:음력',
		'/元宗|1260/2/13~|:음력',
		'/忠烈王|1275/1/29~|:음력',
		'/忠宣王|1309/2/11~|:음력',
		'/忠肃王|1314/1/17~|:음력',
		'/忠惠王|1331/2/8~|:음력',
		'/忠肃王/后|1332/2/27~|:음력|注=高丽史35卷-世家35-忠肃王2-17-02-1330: (十七年)秋闰七月甲申王如元.[王传国后至复位凡二十四月在忠惠世家.]|注=高丽史36卷-世家36-忠惠王-02-01-1332: (壬申)二年[二月以后,入忠肃后元年]|注=高丽史35卷-世家35-忠肃王2-후8-01-1339: 八年春三月癸未王薨于寝. 在位前后二十五年寿四十六',
		'/忠惠王/后|1340/1/29~|:음력',
		'=/忠穆王|1345/2/3~|:음력',
		'/忠定王|1349/1/19~|:음력',
		'/恭愍王|1352/1/18~|:음력|注=Wikipedia: 高丽王朝自1370年起始行大明年号，朝鲜王朝1392年建立后沿用大明年号',
		'/禑王|1375/2/1~|:음력',
		'/昌王|1388/2/8~|:음력',
		'/恭让王|1389/1/28~|:음력',

		'大为国/妙清/天开|음력1135~1136/3/23|:음력|注=高丽史16卷-世家16-仁宗2-12-57-1134: (高丽仁宗12年)十二月戊寅右正言黄周瞻希妙淸郑知常意奏请称帝建元不报(高丽仁宗14年2月)丁巳金富轼会诸军攻西京城陷赵匡自焚死|注=高丽史16卷-世家16-仁宗2-13-17-1135: 以天开表其年元以忠义号其军额',

		// 李氏朝鲜
		'朝鲜/太祖|1392/8/5~|:음력|国号=大朝鲜国;朝鲜国|注=朝鲜王朝实录/太祖康献大王实录/元年 洪武二十五年 七月十七日丙申, 太祖即位于寿昌宫。|注=Wikipedia: 朝鲜沿用大明年号',
		'/正宗|1399/2/6~|:음력',
		'/太宗|1401/1/15~|:음력',
		'/世宗|1419/1/26~|:음력',
		'/文宗|1451/2/2~|:음력',
		'/端宗|1453/2/9~|:음력',
		'/世祖|1455/1/18~|:음력',
		'/睿宗|1469/1/13~|:음력',
		'/成宗|1470/2/1~|:음력',
		'/燕山君|1495/1/26~|:음력',
		'/中宗|1506/1/24~|:음력',
		'/仁宗|1545/1/13~|:음력',
		'/明宗|1546/2/1~|:음력',
		'/宣祖|1568/1/29~|:음력',
		'/光海君|1609/2/5~|:음력',
		'/仁祖|1623/1/31~|:음력',
		'/孝宗|1650/2/1~|:음력',
		'/显宗|1660/2/11~|:음력',
		'/肃宗|1675/1/26~|:음력',
		'/景宗|1721/1/28~|:음력',
		'/英祖|1725/2/13~|:음력',
		'/正祖|1777/2/8~|:음력',
		'/纯祖|1801/2/13~|:음력',
		'/宪宗|1835/1/29~|:음력',
		'/哲宗|1850/2/12~|:음력',
		'/高宗|1864/2/8~|:음력|君主名=李载晃;이재황;李㷩;이희|注=高宗接管大权后，经常需要明成皇后闵妃帮忙打理国内外事务。',
		'/=/开国|1894/7/27~|503/=:음력|注=以朝鲜王朝开国之年（1392年）为元年，金弘集进行甲午改革，1894年7月27日采用。',
		'/建阳|1896~|:CE|注=1896年采用西历，同时改元建阳。',
		'/光武|1897/8/16~|:CE|注=1897年8月16日改元光武，10月12日高宗称帝，改国号大韩帝国',
		'大韩帝国/=/=|1897/10/12~|:CE|注=国号:大韩帝国',
		'/纯宗/隆熙|1907/8/2~|:CE|注=1907年7月20日–1910年8月22日期间在位。1910年8月29日日韩并合，废除隆熙年号。',

		'일제 강점기/明治天皇/明治|1910/8/29~|43/=:CE|注="日帝强占期"应从日本年号。|注=일제시대(日帝时代), 일본 통치기(日本统治期), 왜정 시대(倭政时代), 왜치 시대(倭治时代), 일정 시대(日政时代)',
		'/大正天皇/大正|1912/7/30~|:CE|注="日帝强占期"应从日本年号。',
		'/昭和天皇/昭和|1926/12/25~1945/8/15|:CE|注="日帝强占期"应从日本年号。',

		'大金/大金皇帝|음력1453~1453/10/20|:음력|君主名=李澄玉|生=1399年|卒=1453/10/20年|注=武臣李澄玉叛乱朝鲜朝廷，因为咸吉道是女真人居住区，是金国故地，于是李澄玉自称大金皇帝',

		'대한민국/대한민국/대한민국|1919/3/1~|:CE|纪年=大韩民国|注=대한민국 임시 정부는 1919년 4월 11일, 날짜를 "대한민국 원년 4월 11일"로 표기한 대한민국 임시헌장을 제정·공포하면서부터 이 연호를 공식적인 기년법(纪年法)으로 채택하여 입법, 재정, 외교, 군사문서는 물론 한인애국단, 한국광복군 등 산하기관의 서류를 포함한 모든 공문서에 사용하였다.',
		'/단군기원|1948/9/25~|4281/=:CE|纪年=檀君纪元;단기;檀纪|注=이가 단군(檀君)이며 국호(国号)는 조선(朝鲜)이었는데, 바로 당요(唐尧) 무진년(戊辰年: 기원전 2333년)이었다.',
		'/서력기원|1962~' + CeL.era.pass_on.last_day
				+ '|1962/=:CE|纪年=西历纪元;약칭 서기;西纪',

		// 主体年号 e.g., "主体107年" http://www.rodong.rep.kp/cn/
		'조선//주체연호|1912~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|纪年=主体;주체;主体|政权=朝鲜;공화국;조선민주주의인민공화국;朝鲜民主主义人民共和国|注=주체력(主体历)|注=朝鲜民主主义人民共和国成立以来一直以西历纪元。1997年7月8日，朝鲜开始实行主体年号。追尊主体思想创立人及朝鲜建国者金日成的出生年1912年为主体元年。'

]).minute_offset = 9 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"vietnam"}
(CeL.era.pass_on.countries['Việt Nam'] = [

		// https://vi.wikipedia.org/wiki/Ni%C3%AAn_bi%E1%BB%83u_l%E1%BB%8Bch_s%E1%BB%AD_Vi%E1%BB%87t_Nam

		'蜀/安阳王|-257~||精=年|君主名=蜀泮',

		// Bắc thuộc, Thời kỳ phong kiến phương Bắc đô hộ, 北属时期, 北属期
		// Thời phong kiến phương Bắc đô hộ
		// gettext_config:{"id":"chinese-domination-of-vietnam","mark_type":"part_of_string"}
		'南越/武帝|-208/11/25~|:中国|准=年|朝代=赵朝|君主名=赵佗|时期=Bắc thuộc|注=《钦定越史通鉴纲目·卷之一》67页：「甲午赵武王元年秦二世三年」。该年当系赵佗成为南海郡太守的年份。|注=约前203年，赵佗以番禺为都城在岭南地区建立南越国，自称「南越武王」。|注=目前越南大部分学者亦不承认赵朝，仅有少数人坚持认为赵朝是越南的一个朝代。',
		'/文王|-137~|:中国|准=年|君主名=赵眜;赵胡|注=「赵胡」系《史记》所载南越文王之名。据1983年发现的南越王墓中所发掘的文物，文王的真实名字应是「赵眜」。',
		'/明王|-125~|:中国|准=年|君主名=赵婴齐',
		'/哀王|-113~|:中国|准=年|君主名=赵兴',
		'/术阳侯|-112~-111|:中国|准=年|君主名=赵建德|君主=高昌侯',

		'征/征女王|40/2/2~43/7/25|:中国|准=年|君主名=征侧;征贰;𠄩婆征;二征夫人;征氏姐妹|时期=Bắc thuộc|君主性别=女',

		'士/士王|187/1/27~|:中国|准=年|君主名=士燮;士爕|时期=Bắc thuộc|注=钦定越史通鉴纲目:士爕',
		'/士徽|226/2/16~227/2/3|:中国|准=年|注=226年，士燮病逝，年90岁。儿子士徽背叛吴国而自立，最终为东吴攻灭。|注=为使"士王40年"存，稍改本条起始日。',
		// 赵妪;赵氏贞;赵贞娘，225年－248年 248年孙吴起义领袖，被越南人视为民族英雄。尚有待考证。

		'前李/南帝|542/1/2~|:中国|准=年|君主=李南帝|君主名=李贲|时期=Bắc thuộc|注=李贲于541年十二月集合交州数州人士起兵。',
		'/=/天德|544/2/9~|:中国|准=年|君主=南越帝|国号=万春|年号=大德|注=大越史记全书:甲子天德元年梁大同十年春正月，帝因胜敌，自称南越帝，即位建元，置百官，建国号曰万春，望社稷至万世也。|注=邓洪波 东亚历史年表: 正月，李贲称帝，国号为万春国，建元大德，是为南帝。',
		'=/赵越王|548/4/13~571/2/10|:中国|准=年|君主名=赵光复|注=大越史记全书外纪卷之四: 春三月辛亥，南帝在屈獠洞中，日久，肙瘴病薨。',
		'/桃郎王|549/2/13~|:中国|准=年|君主名=李天宝|国号=野能',
		'/李佛子|555/2/7~|:中国|准=年',
		'/后李南帝|571/2/11~603/2/15|:中国|准=年|君主名=李佛子|朝代=后李',

		'梅/黑帝|722/9/2~12/31|:中国|准=年|君主名=梅叔鸾|时期=Bắc thuộc|注=新唐书:（玄宗开元）十年..七月..丙戌，安南人梅叔鸾反，伏诛。',

		// Thời kỳ độc lập, 独立时期, 独立王朝时代

		// gettext_config:{"id":"late-dynastic-epoch","mark_type":"part_of_string"}
		'吴/前吴王|939/1/23~|:中国|准=年|君主名=吴权|时期=Thời kỳ độc lập',
		'/杨三哥|945/2/15~|:中国|准=年|君主=杨平王|君主名=杨绍洪',
		'/天策王|951/2/9~954|:中国|准=年|君主名=吴昌岌|注=与弟共治',
		'/后吴王|951/2/9~|:中国|准=年|君主名=吴昌文|注=与兄吴昌岌共治',
		'/吴使君|966/1/25~|:中国|准=年|君主名=吴昌炽',

		'丁/先皇帝/太平|968/2/2~|:中国|准=年|国号=大瞿越|君主名=丁部领|时期=Thời kỳ độc lập',
		'/=/太平|970/2/9~|:中国|准=年',
		'/废帝/=|979/10/24~|:中国|准=年',

		'前黎/太祖/天福|980/8/14~|:中国|准=年|君主名=黎桓|君主=黎大行|时期=Thời kỳ độc lập|注=大越史记全书本纪卷之一: 庚辰十一年废帝仍太平年号，七月以后，黎大行天福元年。',
		'/兴统|989/2/9~|:中国|准=年',
		'/应天|994/2/13~|:中国|准=年',
		'/中宗/=|1005/11/5~|12/=:中国|准=年|讳=龙钺|注=大行皇帝崩后，帝与东城、中国二王，及同母弟开明王争立，相持八月，中国无主。冬十月，东城王败奔莒隆，帝追捕之，又奔占城，未至，为石河州人杀于机罗海口今奇罗是也。时国人亦奔附御北王于扶兰寨。帝郎位三日，为龙铤所杀，群臣皆奔亡，惟殿前军李公蕴抱尸而哭。龙铤立，追谥帝曰中宗皇帝，拜公蕴四厢军副指挥使。',
		'/庄宗/=|1005/12/4~|12/=:中国|准=年|君主名=黎至忠|讳=龙铤',
		'/景瑞|1008/2/10~|:中国|准=年|注=冬十月辛亥，帝崩于寝殿，号卧朝..是月癸丑日，李公蕴自立为帝。',

		'后李/太祖/=|1009/11/21~|2/=:中国|准=年|君主名=李公蕴|时期=Thời kỳ độc lập',
		'/顺天|1010/1/18~|:中国|准=年',
		'/太宗/天成|1028/4/1~|:中国|准=年|君主名=李德政|注=顺天..十九年..三月..己亥，太子佛玛即位于柩前。尊母黎氏曰灵显太后。大赦，改元天成元年。',
		'/通瑞|1034/4/21~|:中国|准=年|注=四月..是月改元通瑞元年',
		'/干符有道|1039/6/25~|:中国|准=年|注=六月，群臣请改元曰干符有道，及增尊号曰金涌银生侬平藩伏八字。',
		'/明道|1042/12/15~|:中国|准=年|注=冬十月..诏改元明道元年',
		'/天感圣武|1044/11/23~|:中国|准=年|注=冬十一月，赐伐占城有功者，六品以上锦袍，七品以下罗衣。群臣请改元曰天感圣武，增号曰圣德天感宣威圣武八字。',
		'/崇兴大宝|1049/4/5~|:中国|准=年|注=己丑六年 三月以后崇兴大宝元年，宋皇祐元年 春二月，改元崇兴大寳元年。',
		'/圣宗/龙瑞太平|1054/11/3~|:中国|准=年|君主名=李日尊|注=冬十月一日，帝崩于长春殿。太子即位于柩前，改元龙瑞太平元年。追尊大行皇帝，谥庙号太宗，母枚氏为金天皇太后。建国号曰大越。',
		'/彰圣嘉庆|1059/2/15~|:中国|准=年',
		'/龙章天嗣|1066/2/24~|:中国|准=年|注=春正月二十五日亥时，皇子干德生。后日立为皇太子，改元大赦',
		'/天贶寳象|1068/3/7~|:中国|准=年|年号=天贶宝象|注=二月以后天贶寳象元年，宋神宗熙宁元年。按清化珉升平塔记，以是年为神武元年也。..真登州献白象二，因此改元天贶寳象元年。',
		'/神武|1069/7/21~|:中国|准=年|注=秋七月，帝还自占城，献俘于太庙，改元神武元年。',
		'/仁宗/太宁|1072/2/1~|:中国|准=年|君主名=李乾德|注=春正月庚寅，帝崩于会僊殿。..皇太子干德即位于柩前，改元太寕元年。时方七岁',
		'/英武昭胜|1076/5/6~|:中国|准=年|注=夏四月，赦改元英武昭胜元年。',
		'/广祐|1085/1/29~|:中国|准=年',
		'/会豊|1092/9/5~|:中国|准=年|年号=会丰|注=秋八月，改元会豊元年。',
		'/龙符|1101/1/31~|:中国|准=年|注=春正月，改元',
		'/会祥大庆|1110/1/22~|:中国|准=年',
		'/天符睿武|1120/2/1~|:中国|准=年|注=春正月，朔，群臣上表劝加上尊号，仍请改元。',
		'/天符庆寿|1127/2/13~|:中国|准=年|注=丁未天符庆寿元年宋靖康二年，五月以后高宗构建炎元年。',
		'/神宗/=|1128/1/15~|:中国|准=年|君主名=李阳焕|注=十二月..丁卯，帝崩于永光殿。..皇太子即位于柩前',
		'/天顺|1128/2/3~|:中国|准=年|注=春正月丙戌，朔，改元大赦。',
		'/天彰宝嗣|1133/2/7~|:中国|准=年',
		'/英宗/=|1138/10/31~|6/=:中国|准=年|君主名=李天祚|注=九月..二十六日，帝崩于永光殿殡于殿之西陛。群臣上尊号曰广仁崇孝文武皇帝，庙号神宗。',
		'/绍明|1138/11/5~|:中国|准=年|注=冬十月，朔，皇太子天祚即位于柩前，年方三岁，改元绍明元年。',
		'/大定|1140/2/20~|:中国|准=年|注=二月，改元大定元年',
		'/政隆寳应|1163/2/5~|:中国|准=年|年号=政隆宝应|注=政隆寳应元年..宋封帝为安南国王，改交趾为安南国。',
		'/天感至寳|1174/3/5~|:中国|准=年|年号=天感至宝|注=二月，改元天感至寳元年。',
		'/高宗/=|1175/8/14~|2/=:中国|准=年|君主名=李龙𣉙;李龙翰|注=秋七月，乙巳，帝崩于瑞光殿。..太子龙𣉙即位于柩前',
		'/贞符|1176/2/13~|:中国|准=年|注=春正月，改元大赦。',
		'/天资嘉瑞|1186/7/18~|:中国|准=年|注=秋七月，获白象，赐名天资，诏改元天资嘉瑞元年。',
		'/天嘉寳祐|1202/8/19~|:中国|准=年|年号=天嘉宝祐|注=秋八月，皇次子忱生，改元天嘉寳祐元年。',
		'/治平龙应|1205/3/22~|:中国|准=年|注=大越史记全书:春三月，改元治平龙应元年。|注=越史略:九月壬辰(1205/10/22)，改元为平治龙应元年。',
		'/惠宗/=|1210/11/15~|:中国|准=年|君主名=李旵|注=大越史记全书:庚午六年宋嘉定三年..冬十月，帝弗豫，召杜敬修受顾托命。二十八日(27?)壬午，帝崩于圣寿宫。|注=越史略:冬十月，王不豫。壬午，王寝疾，忽见二青衣执杖立座侧，王问执杖者为谁，左右曰：“无所见。”是夜，王薨于胜夀殿，年三十七。',
		'/建嘉|1211/1/17~|:中国|准=年|注=春正月，改元。',
		'/昭皇/天彰有道|1224/11/13~|:中国|准=年|君主名=李佛金;李天馨|君主性别=女|注=大越史记全书:冬十月，诏昭圣公主为皇太子以传位，帝出家，居大内真教禅寺。昭圣即位，改元天彰有道元年，尊号曰昭皇。|注=越史略:乙酉建嘉十五年..六月，王逊位于第二昭圣公主，谥昭王。尊王为太上王。改元天彰有道。',

		'陈/太宗/建中|1226/1/10~|:中国|准=年|君主名=陈日煚;陈煚|时期=Thời kỳ độc lập|注=大越史记全书:本月二十一日(戊寅)，群臣进朝拜贺。..十二月十一日戊寅(丁酉?)，昭皇设大会于天安殿御寳床，百官朝服，进朝拜于庭下。昭皇乃降服，劝进陈煚即皇帝位。改元建中元年|注=越史略:乙酉建嘉十五年..十二月初一日受禅，即位于天安殿，尊顺贞皇后为太后，降昭王为昭圣王后，改元建中。',
		'/天应政平|1232/8/10~|:中国|准=年|注=秋七月二十二日，改元天应政平元年。',
		'/元豊|1251/2/22~|:中国|准=年|年号=元丰|注=春二月改元元豊元年。',
		'/圣宗/绍隆|1258/3/30~|:中国|准=年|君主名=陈光昺|注=戊午八年..二月二十四日，帝传位于皇太子晃，逊居北宫。|注=陈氏家法..子既长，即使承正位，而父退居圣慈官，以上皇称，同听政，其实但传大器，以定后事，备仓卒尔，事皆取决于上皇，嗣主无异于皇太子也。',
		'/宝符|1273/1/21~|:中国|准=年|注=春正月朔，改元。',
		'/仁宗/绍宝|1278/11/8~|:中国|准=年|君主名=陈日烜|注=宝符六年..冬十月二十二日，帝禅位于皇太子昑。',
		'/重兴|1285/9/30~|:中国|准=年|注=九月，改元重兴元年。大赦。',
		'/英宗/兴隆|1293/4/16~|:中国|准=年|君主名=陈烇|注=春三月九日，帝禅位于皇太子烇即皇帝位。改元兴隆元年，大赦。',
		'/明宗/大庆|1314/4/3~|:中国|准=年|君主名=陈奣|注=春三月，𠡠中书颁本朝名讳，增入寕皇及宣慈保慈二太后讳。十八日，帝禅位于皇太子奣。奣即皇帝位，改元大庆元年。大赦，称寕皇。',
		'/开泰|1324/1/27~|:中国|准=年|注=春正月朔，改元。',
		'/宪宗/开祐|1329/3/7~|:中国|准=年|君主名=陈旺|注=春二月七日，册东宫太子旺为皇太子。十五日，禅位。旺即皇帝位，改元开祐元年，大赦。称哲皇。',
		'/裕宗/绍丰|1341/10/2~|:中国|准=年|君主名=陈日煃|注=秋八月二十一日，上皇迎皇子暭即皇帝位，改元绍豊元年，大赦，称裕皇。',
		'/大治|1358/2/9~|:中国|准=年|注=春正月朔，改元。',
		'/昏德公/大定|1369/7/18~|:中国|准=年|君主名=陈日礼;杨日礼|注=夏五月..二十五日，帝崩于正寝，庙号裕宗。|注=六月..十五日，宪慈皇太后使人迎故恭肃大王昱庶子日礼即位，改元大定元年。',
		'/艺宗/绍庆|1370/12/3~|:中国|准=年|君主名=陈暊|注=十一月，帝及恭宣、天寕俱领军回京。十三日至建兴府旧名显庆，下令废日礼为昏德公。十五日，即皇帝位，改元大赦，称义皇。',
		'/睿宗/隆庆|1373/1/24~|:中国|准=年|君主名=陈曔|注=十一月九日，帝禅位于皇太子曔，曔即皇帝位，大赦，称钦皇。..春正月，朔，改元。',
		'/废帝/昌符|1377/6/19~|:中国|准=年|君主名=陈晛|注=夏五月十三日，上皇以帝当国难崩，立帝长子建德大王暊为嗣，即皇帝位。称简皇，改元昌符元年，大赦。|注=《明史》作陈日炜',
		'/顺宗/光泰|1389/1/24~|:中国|准=年|君主名=陈颙|注=十二月..二十七日，上皇立少子昭定王颙为皇帝。颙即位改元光泰元年，大赦，称元皇。',
		'/少帝/建新|1398/4/2~|:中国|准=年|君主名=陈𤇼|注=春三月十五日，黎季牦逼帝禅位于皇太子𤇼(上安/下火)。',

		'胡/国祖/圣元|1400/3/26~|:中国|准=年|君主名=胡一元;黎季牦|注=原名黎季牦|国号=大虞|谥=章皇帝|时期=Thời kỳ độc lập|注=建新二年..夏四月，季牦逼令帝出家..六月，季牦自称国祖章皇..庚辰三年 是岁陈亡。三月以后季牦篡国，称圣元元年..二月二十八日，黎季牦逼帝禅位，及劫宗室群臣三上表劝进，伪为固辞曰：「大地有期，将何面目见先帝于地下乎。」已而，自为帝，建元圣元，国号大虞，改姓胡。',
		'/胡汉仓/绍成|1401/1/15~|:中国|准=年|君主名=胡𡗨|注=庚辰三年..冬十二月..季牦以位与其子汉苍，自称太上皇，同听政。|注=《明实录》和《明史》称之为胡𡗨|注=绍成元年..春二月..汉苍改陈氏协纪历，行顺天历。',
		'/开大|1403/1/23~|:中国|准=年|注=开大四年..十二月..十二日..明人入东都',

		'后陈/简定帝/兴庆|1407/11/1~|:中国|准=年|君主名=陈頠|时期=Thời kỳ độc lập|注=冬十月初二日，简定帝即位于长安州谟渡，建元兴庆。',
		'/重光帝/重光|1409/4/2~1413/12/22|:中国|准=年|君主名=陈季扩|注=三月十七日，帝御位于支罗，改元重光|注=癸巳五年..十一月..帝奔老挝..陈遂亡。',

		// 初黎朝, Nhà Lê sơ
		'初黎/太祖/顺天|1428/1/17~|:中国|准=年|君主名=黎利|国号=大越|朝代=后黎|时期=Thời kỳ độc lập|注=春正月，明人既还国，帝遂混一天下，以是年为大定之年。',
		'/太宗/=|1433/10/20~|6/=:中国|准=年|君主名=黎元龙|注=秋九月八日，太子元龙即皇帝位，大赦改元，以明年为绍平元年。',
		'/绍平|1434/2/9~|:中国|准=年',
		'/大宝|1440/2/3~|:中国|准=年|注=十一月，大赦改元。期以明年正月改大宝初年，大赦天下。',
		'/仁宗/=|1442/9/15~|:中国|准=年|君主名=黎邦基|在位=1442年8月(1442/9/4)-1459年10月(1459/11/25)|注=壬戌三年..八月四日，帝至嘉定县茘枝园，遽得虐疾崩。..十二日大臣郑可、阮炽、黎受等受遗命，与黎列、黎杯等奉皇太子邦基即位。年方二岁，以明年为大和元年。',
		'/大和|1443/1/31~|:中国|准=年',
		'/延宁|1454/1/29~|:中国|准=年|注=癸酉十一年..冬十一月..二十一日，帝初亲政，改元大赦，以明年正月为延宁元年。',
		'/前废帝/天兴|1459/11/1~|:中国|准=年|君主名=黎宜民|注=己卯六年 明天顺三年 冬十月三日，谅山王宜民夜作梯，分三道上东门城，盗入宫禁。帝及宣慈皇太后俱遇害。..初七日，谅山王宜民自立即皇帝位，大赦，改元天兴 十月三日以前著延宁六年七日，以后著宜民天兴元年。..迺于今年十月初七日即位，改号天兴。',
		'/圣宗/光顺|1460/6/26~|:中国|准=年|君主名=黎灏|注=光顺元年 六月以前宜民僣称天兴二年..六月..初八日帝即位于祥光殿改元光顺元年大赦天下',
		'/洪德|1470/2/1~|:中国|准=年|注=己丑十年..冬十一月十六日大赦改元以明年为洪德元年',
		'/宪宗/=|1497/3/9~|:中国|准=年|君主名=黎晖|注=丁巳二十八年..春正月..三十日壬子帝崩于宝光殿..至今年春正月三十日辰时崩于宝光宫..二月..初六日戊寅太保平凉侯黎志兵部上书定功伯郑公旦西军都督府左都督崇溪伯黎永就弘文殿奉迎皇太子即位以明年改为景统元年',
		'/景统|1498/1/22~|:中国|准=年',
		'/肃宗/泰贞|1504/7/17~|:中国|准=年|君主名=黎敬甫|注=甲子七年..五月..二十四日帝崩于图治殿..六月初六日中军都督府左都督屏山侯黎广度南军都督府左都督驸马都尉临淮伯黎达昭暨驸马五府六部东阁翰林院六寺科台等官诣皇极殿奉皇太子㵮即位 大赦 改元以是年为泰贞元年',
		'/威穆帝/=|1505/1/22~|:中国|准=年|君主名=黎濬|注=十二月..八日甲子崩于皇极殿..十八日甲戌中军都督府左都督屏山侯黎广度宗人令叙恩使黎能让暨公侯伯驸马都尉五府六部御史台东阁翰林六寺六科提刑十三道等官诣兴明殿奉迎宪宗第二子濬即皇帝位 大赦改元以明年为端庆元年',
		'/端庆|1505/2/4~|:中国|准=年',
		'/襄翼帝/洪顺|1510/1/10~|:中国|准=年|君主名=黎潆',
		'/昭宗/光绍|1516/5/2~|:中国|准=年|君主名=黎椅',
		'/黎榜/大德|1518/2/10~|:中国|准=年',
		'/黎槱/天宪|1518/2/10~|:中国|准=年',
		'/恭帝/统元|1522/8/21~|:中国|准=年|君主名=黎椿|在位=1522年7月(1522/7/23)-1527年6月(1527/7/28)',
		//
		'莫/太祖/明德|1527/6/28~|:中国|准=年|君主名=莫登庸|时期=Thời kỳ độc lập',
		'/太宗/大正|1530/1/29~|:中国|准=年|君主名=莫登瀛',
		'/宪宗/广和|1541/1/27~|:中国|准=年|君主名=莫福海|在位=1540年1月(1540/2/8)-1546年5月(1546/6/28)',
		'/宣宗/永定|1547/1/22~|:中国|准=年|君主名=莫福源|在位=1546年5月(1546/5/29)-1561年12月(1562/2/4)',
		'/景历|1548/2/10~|:中国|准=年',
		'/茂洽/淳福|1562/2/4~|:中国|准=年|在位=1561年12月(1562/1/5)-1592年1月(1592/3/14)',
		'/崇康|1566/1/21~|:中国|准=年',
		'/延成|1578/2/7~|:中国|准=年',
		'/端泰|1586/2/18~|:中国|准=年',
		'/兴治|1588/1/28~|:中国|准=年',
		'/洪宁|1591/1/25~|:中国|准=年',
		'/景宗/武安|1592/2/13~|:中国|准=年|君主名=莫敬邦',
		'/闵宗/宝定|1593/1/3~|:中国|准=年|君主名=莫敬止',
		'/康佑|1593/2/1~|:中国|准=年',
		'/代宗/干统|1593/3/3~1625/2/6|:中国|准=年|君主名=莫敬恭',
		'/光祖/隆泰|1618/1/26	~|:中国|精=年|准=年|君主名=莫敬宽|《钦定越史通鉴纲目》莫敬宽于1618年建元隆泰，之后与父亲莫敬恭分据高平。',
		'/永祚|1625/2/7~|:中国|精=年|准=年|注=1625年，后黎朝讨灭莫敬恭，莫敬宽投降，被封为太尉通国公，以后莫朝开始使用后黎朝的年号，直到1638年，改元顺德。',
		'/明宗/顺德|1638/2/14~1678/1/22|:中国|精=年|准=年|君主名=莫敬宇|注=1638年莫敬宽死后继位，改年号为顺德（Thuận Đức）。1677年，郑柞借黎熙宗的名义，以丁文左、阮有登等为将，再次讨伐盘踞高平的莫氏。莫敬宇兵败，逃往中国广西的龙州。',
		// 中兴黎朝, Nhà Lê trung hưng 国号:大越国
		'后黎/庄宗/元和|1533/1/25~|:中国|准=年|君主名=黎宁|时期=Thời kỳ độc lập',
		'/中宗/顺平|1549/1/29~|:中国|准=年|君主名=黎暄|在位=1548年1月(1548/2/10)-1556年(1557/1/30)',
		'/英宗/天祐|1557/1/30~|:中国|准=年|君主名=黎维邦|在位=1556年(1556/2/11)-1572年(1573/2/2)',
		'/正治|1558/1/20~|:中国|准=年',
		'/世宗/洪福|1572/1/15~|:中国|准=年|君主名=黎维禫',
		'/嘉泰|1573/2/2~|:中国|准=年',
		'/光兴|1578/2/7~|:中国|准=年',
		'/敬宗/慎德|1600/2/14~|:中国|准=年|君主名=黎维新|在位=1599年7月(1599/8/21)-1619年5月(1619/7/11)',
		'/弘定|1600/12/6~|:中国|准=年',
		'/神宗/永祚|1619/7/11~|:中国|准=年|君主名=黎维祺',
		'/德隆|1629/4/23~|:中国|准=年',
		'/阳和|1635/11/10~|:中国|准=年',
		'/真宗/福泰|1643/11/11~|:中国|准=年|君主名=黎维祐;黎维禔|注=1643年，郑梉胁迫黎神宗禅位给儿子黎维祐。1648年，郑梉挟持黎真宗南下讨伐阮主，在长德大败，御林军（郑军）损失惨重。此时黎真宗死去（有些人认为黎真宗之死是这场战役所导致的），黎神宗复位。',
		'/神宗/庆德|1649/11/4~|:中国|准=年|注=1648年，郑阮战争后，黎真宗死去，黎神宗复位。',
		'/盛德|1653/2/28~|:中国|准=年',
		'/永寿|1658/3/4~|:中国|准=年',
		'/万庆|1662/10/12~|:中国|准=年',
		'/玄宗/景治|1663/2/8~|:中国|准=年|君主名=黎维禑|在位=1662年11月(1662/12/11)-1671年10月(1671/12/1)',
		'/嘉宗/阳德|1672/1/30~|:中国|准=年|君主名=黎维禬|在位=1671年10月(1671/11/2)-1675年4月(1675/5/25)',
		'/熙宗/永治|1676/2/14~|:中国|准=年|君主名=黎维祫|在位=1675年4月(1675/4/25)-1705年4月(1705/5/23)',
		'/正和|1680/11/21~|:中国|准=年',
		'/裕宗/永盛|1705/1/25~|:中国|准=年|君主名=黎维禟|在位=1705年4月(1705/4/23)-1729年(1730/2/17)',
		'/保泰|1720/2/8~|:中国|准=年',
		'/后废帝/永庆|1729/1/29~|:中国|准=年|君主名=黎维祊',
		'/纯宗/龙德|1732/9/19~|:中国|准=年|君主名=黎维祥',
		'/懿宗/永佑|1735/1/24~|:中国|准=年|君主名=黎维振|在位=1735年4月(1735/4/23)-1740年4月(1740/5/25)',
		'/显宗/景兴|1740/4/26~|:中国|准=年|君主名=黎维祧',
		'/愍帝/昭统|1787/2/18~1790/2/13|:中国|准=年|君主名=黎维祁;黎维谦|在位=1786年6月(1786/6/26)-1789年1月(1789/2/25)|时期=Thời kỳ độc lập',
		//
		'西山朝/阮文岳/泰德|1778/1/28~|:中国|准=年|时期=Thời kỳ độc lập|政权=归仁朝廷;归仁政府|在位=1776年(1776/2/19)-1793年(1794/1/31)',
		'/阮太祖/光中|1788/12/22~|:中国|准=年|君主名=阮惠;阮文惠;阮光平|注=十一月二十五日，阮惠在御屏山登基称帝，改年号为「光中」。',
		'/阮光缵/=|1792/9/16~|:中国|准=年|注=1792年，阮惠逝世，遗命由阮光缵继位，让陈文纪、陈光耀辅政。阮光缵登基称帝，改元景盛，当时年仅十岁。',
		'/景盛|1793/2/11~|:中国|准=年|在位-1802/7/22(1802/8/28)',

		// <a
		// href="https://vi.wikipedia.org/wiki/Ni%C3%AAn_hi%E1%BB%87u_Vi%E1%BB%87t_Nam"
		// accessdate="2014/3/13 23:29">Niên hiệu Việt Nam</a>

		'Âm lịch|1800/1/25~'
				+ CeL.era.pass_on.last_day
				+ '|1800/=3psj47e 5s5 3z4h4aw 4q3c3qh 3hw 4g5y3md 56y 55425sh 4b5 3bj63u2 3a92431 42e 4nys59e 5uq 3txf4b8 3rd348a 439 3mmt46i 59g 57d05uw 4pl55as 50q 4fc6579 47e 4pb85e9 4a0 4plv3px 323b3oq 579 3qs54gy 5e9 3sxw4aa 3b60446 42y 4o135r9 4gy 4sqt5es 4ac 3nsz506 3pt44zu 5s9 3z4l4i0 5ew 4ihg3hx 31p63me 576 55465sh 4i9 3ep13u2 3p1 380j42e 4nyv59g 5uq 40914ic 48a 3a90439 42y 4of659g 57d25uw 5as 3rdh3fu 505 3psj47e 4sh45e9 4a0 4pph3q1 3my 4mg4591 4eq 4so25e9 3t524aa 3q2 3a1x42z 3o5 3yoi4h0 4t535ew 4ac 3nt150a 4yy 54845s9 4h4 4t8i5ew 4ihi3p1 3fe 4f39576 5s9 400j4i9 3ep33u2 3p1 380m42y 591 3qro5uq 4ia 3epu48a 3mw74z9 42y 4of95d1 49w 4pkz5as 3rdk3fu 505 3psm47e 5e1 3swk4a0 5ax 324z3mz 37w73o5 4gi 4so55ea 4aa 3b5w44a 3a2042z 42t 4nyu4h0 5es 3t6s4ac 47u 3moy4z1 3po747d 4i0 4t8l5ew 52s 4g9f3fe 4g4o591 47m 40114i9 3u1 3a903p1 3mi 4mg2591 3sd349u 4ic 3rd148a 439 3mms46i 4ofd5dx 49w 4pl25aw 50s 4c78505 46i 4rky5e1 3swm4a9 3q1 32513ot 3md 4m6r58y 4sob5eq 4aa 3b5y44a 431 37x142t 59e 4soy5es 3t6v4ac 47u 3mp14z1 46h 4oer5ag 4t943u0 59w 4g9i3mi 579 3ql047m 5ap 3eoj3u2 3a933p1 3my 4mg5591 49e 4pic5as 3rd448c 43a 3mmu46i 59h 3st04a0 5as 3rlv50s 4g5j505 46i 54bp5s9 4a0 4q383qh 325k3ot 3me 4m6u58y 5sh 3t444b6 3qi 3a8y431 39hz|纪年=阴历越南|参照用',

		'西山朝/阮光缵/景盛|Âm lịch 1800~|8/=:Âm lịch|国号=大越',
		'/宝兴|Âm lịch:1801/6~1802/6/23|:Âm lịch|注=大南正编列传初集卷三十: 五月下旬至阮光垂府后连旬积雨，以为不祥，因之改元宝兴。',

		// TODO: 郑主

		// 国朝正编撮要 https://lib.nomfoundation.org/collection/1/volume/336/page/2
		'阮主/阮福暎|1780/2/5~1800/1/24|:中国|准=年|君主名=阮福映|时期=Thời kỳ độc lập|注=根据《大南实录》记载，嘉隆帝名「阮福暎」。其中「阮」是姓氏，「福」是祧字，「暎」是其名。「暎」是「映」的异体字，故而不少中文书籍将其名字写作「阮福映」。|政权=Chúa Nguyễn;广南国|注=对外仍用后黎朝的年号(景兴/昭统)，《国朝正编撮要》使用「壬戌二十三年」之类来纪年',
		// '/阮福暎/景兴|1780/2/5~|41/=:中国|准=年',
		// '/阮福暎/景兴|Âm lịch 1800~|61/=:Âm lịch|...',
		'=/阮福暎|Âm lịch 1800~|21/=:Âm lịch',

		'阮/世祖/嘉隆|Âm lịch:1802/5~|:Âm lịch|君主名=阮福暎;阮福映|国号=越南|政权=阮朝|时期=Thời kỳ độc lập|注=1802年阴历五月，阮福映改富春为顺化，定为都城，登基称帝。阮福映宣布停止使用的后黎朝的年号景兴；从「嘉定」、「升隆」（升龙）中各取一字，改用新年号「嘉隆」，象征越南的南北统一。|注=「越南」是清朝嘉庆帝所赐国号。阮福映在位期间，改国号为「越南」，但有时候仍然使用「大越」为国号。明命帝在位时期，国号改为「大南」。',
		'/圣祖/明命|Âm lịch:1820~|:Âm lịch|国号=大南|注=1820年2月3日（嘉隆己卯年腊月十九），嘉隆帝驾崩。临终前，嘉隆帝指定让黎文悦、范登兴担任辅政大臣。2月14日（正月初一），30岁的皇太子阮福胆正式举行登基大典，改年号为「明命」，并尊生母陈氏珰为皇太后。',
		'/宪祖/绍治|1841/2/11~|:Âm lịch|注=1841年1月20日，明命帝逝世。2月11日，阮福绵宗改名阮福暶，在太和殿正式登基，是为绍治帝。',
		'/翼宗/嗣德|1848/10/29~|:Âm lịch|注=1848年10月29日，嗣德帝继位。',
		'/育德帝/=|1883/7/20~|36/=:Âm lịch|君主=恭宗|注=生前长住于皇城的育德堂，后世尊称为育德皇帝。|注=Ông lên ngôi vua ngày 20 tháng 7 năm 1883, nhưng tại vị chỉ được mấy ngày. Theo Đại Nam chính biên liệt truyện (quyển 4), thì vua Dục Đức "nối ngôi mới được 5 ngày" (Nxb Văn học, 2004, bản dịch: trang 86). Việt Nam sử lược (Trần Trọng Kim soạn. Nxb Tân Việt, 1968, tr. 533) chép là “được 3 ngày”.',
		'/协和帝/=|1883/7/25~|36/=:Âm lịch',
		'/简宗/=|1883/12/2~|:Âm lịch|注=lên ngôi ngày 2 tháng 12 năm 1883',
		'/建福|Âm lịch 1884~|:Âm lịch',
		'/咸宜帝/=|1884/8/2~|:Âm lịch|注=Sáng ngày 12 tháng 6 Giáp Thân, tức ngày 2 tháng 8 năm 1884, Ưng Lịch được dìu đi giữa hai hàng thị vệ, tiến vào điện Thái Hòa để làm lễ lên ngôi hoàng đế, đặt niên hiệu là Hàm Nghi.',
		'/咸宜|Âm lịch 1885~|:Âm lịch',
		// TODO: 同庆乙酉年
		'/景宗/同庆|1885/7/4~|乙酉/=:Âm lịch|注=1885年7月4日（咸宜元年五月廿二）改元，当年称同庆乙酉年，明年始称元年，共计4年。|注=Ngày 6 tháng 8 năm Ất Dậu, tức ngày 19 tháng 9 năm 1885, Nguyễn Phúc Ưng Kỷ phải thân hành sang bên Khâm sứ Pháp làm lễ thụ phong, được tôn làm vua, lấy niên hiệu là Đồng Khánh.',
		'/=|Âm lịch 1886~|:Âm lịch',
		'/成泰帝/成泰|1889/2/2~|:Âm lịch|注=Ngày 2 tháng 2 năm 1889 Bửu Lân lên ngôi lấy hiệu là Thành Thái.',
		'/维新帝/维新|1907/9/5~|:Âm lịch|注=Ngày 5 tháng 9 năm 1907, Vĩnh San lên ngôi lấy niên hiệu là Duy Tân.',
		'/弘宗/启定|1916/5/18~|:Âm lịch|注=Ngày 18 tháng 5 năm 1916, Nguyễn Phúc Bửu Đảo lên ngôi lấy niên hiệu là Khải Định.',
		'/保大帝/=|君主名=阮福永瑞|Âm lịch 1926~|:Âm lịch|注=Vua Khải Định mất ngày 6 tháng 11 năm 1925, Vĩnh Thụy về nước thọ tang vua cha và ngày 8 tháng 1 năm 1926, Vĩnh Thụy được tôn lên kế vị làm vua lấy niên hiệu Bảo Đại.',
		'/保大|Âm lịch 1926~|:Âm lịch',
		'帝国越南/皇帝保大|1945/3/11~8/23|:CE|注=未确定是否使用公历！|时期=法越战争|注=1925/11/6~1945/8/30在位|注=1945年3月11日（保大二十年农历正月廿七日）上午，日本大使横山前往顺化，在太和殿觐见保大， 以「亚洲归亚洲人」鼓动保大，于是在当天下午，保大就召集六部尚书和王公亲贵，发布《独立宣言》，宣布废除越南与法国1884年签订的不平等条约，脱离法国保护，宣告越南成立独立自主的国家，并加入以日本为首的「大东亚共荣圈」，决定与日本政府合作。4月17日任命著名历史学家陈仲金为越南历史上首位内阁总长〈亦即首相〉。',

		'越南阴历|1945/3/11~' + CeL.era.pass_on.last_day + '|1945/=:Âm lịch',

		// Thời kỳ Chiến tranh Đông Dương 1945-1975
		'国家越南|1949/6/14~|1949/=:CE|国号=Quốc gia Việt Nam;越南国|时期=法越战争',
		'越南共和|1955/10/26~1975/4/30|1955/=:CE|国号=Việt Nam Cộng hòa;越南共和国;南越|时期=法越战争',

		'共和沔南越南|1969/6/8~1976/7/1|1969/=:CE|国号=Cộng hòa miền Nam Việt Nam;南越南共和国|时期=法越战争',

		'越南民主共和|1945/9/2~|1945/=:CE|国号=Việt Nam Dân chủ Cộng hòa;北越|时期=法越战争|注=1953年越南民主共和国所发行的纸币，上印有「越南民主共和」字样。',
		'共和社会主义越南|1976/7/2~' + CeL.era.pass_on.last_day
				+ '|1976/=:CE|国号=Cộng hòa Xã hội chủ nghĩa Việt Nam;越南社会主义共和国'

]).minute_offset = 7 * 60;

// ---------------------------------------------------------------------//
// 泰国君主列表

// gettext_config:{"id":"thailand"}
(CeL.era.pass_on.countries["ไทย"] = [
		// 泰国阴阳历: 依照这边的设定，新年（换年分）大致比公元提早一两个月。但实际应晚五个月，每年阴阳历5/5新年。
		// https://www.myhora.com/%E0%B8%9B%E0%B8%8F%E0%B8%B4%E0%B8%97%E0%B8%B4%E0%B8%99/
		// 除了拉玛九世之后，泰国佛历与公元的新年同步之外，之前的王以阴阳历为主。因为技术性原因，现在还没有办法仅仅以历数资料配合函式库，来表现出正确的年分。因此泰国佛历必须以本纪年工具的所列出的日期，才能与达到与资料来源相同的表达。
		'ปฏิทินจันทรคติไทย|1756/12/21~2042/1/21|2300/2=3oq 4ofc58q 4ofc59m 59m 4ofc58q 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 59m 4ofc58q 4ofc59m 59m 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 4ofc59m 58q 4ofc59m 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 4ofc59m 58q 4ofc59m 58q 4ofc59m 4ofc59m 59m 4ofc58q 59m 4ofc59m 59m 4ofc59m 4ofc58q 58q 4ofc59m 59m 4ofc59m 4ofc58q 59m 4ofc58q 59m 4ofc59m 59m 4ofc58q 4qo|参照用|纪年=泰国阴历;จันทรคติ;ปฏิทินจันทรคติ|闰月名=双|注=此处之年份仅为与公元年份约略参考用！仅月份与日期较可资参考。详见说明。',

		// [[en:List of monarchs of Thailand]]
		// 年份未按照实际历史编排！
		// [[th:รายพระนามพระมหากษัตริย์ไทย]]
		// gettext_config:{"id":"phra-ruang-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"sukhothai-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์พระร่วง/พ่อขุนศรีอินทราทิตย์|1238~||疑|准=年|时期=อาณาจักรสุโขทัย|君主=พ่อขุนบางกลางหาว;Pho Khun Sri Indraditya;Pho Khun Bang Klang Hao|生=1188|关系=First King of Sukhothai Ally with Pha Mueang defeating the Khmer.',
		'/พ่อขุนบานเมือง|1270~||疑|准=年|君主=Pho Khun Ban Mueang|关系=Son of Sri Indraditya',
		'/พ่อขุนรามคำแหงมหาราช|1279~||疑|准=年|君主=พ่อขุนรามราช;Pho Khun Ram Khamhaeng the Great the Great;Pho Khun Ram Racha|生=1237|关系=Younger brother of Ban Muang;Son of Sri Indraditya',
		'/พระยาเลอไทย|1298~||疑|准=年|君主=Phaya Loethai|关系=Son of Ram Khamhaeng',
		'/พระยางั่วนำถม|1323~||疑|准=年|君主=Phaya Nguanamthom|关系=Cousin of Lerthai;Son of Ban Muang',
		'/มหาธรรมราชาที่ ๑|1347~||疑|准=年|君主=พระมหาธรรมราชาที่ 1;ลิไทย;Phaya Lithai;Phra Maha Thammaracha I|关系=Cousin of Nguanamthom;Son of Lerthai',
		'/มหาธรรมราชาที่ ๒|1368~||疑|准=年|君主=พระมหาธรรมราชาที่ 2;ลือไทย;Phaya Mahathammaracha II;Phra Maha Thammaracha II|关系=Son of Lithai',
		'/มหาธรรมราชาที่ ๓|1400~||疑|准=年|君主=พระมหาธรรมราชาที่ 3;ไสลือไทย;Sai Lue Thai;Phaya Saileuthai;Phra Maha Thammaracha III|关系=Son of Leuthai',
		'/มหาธรรมราชาที่ ๔|1419~1438||疑|准=年|君主=พระมหาธรรมราชาที่ 4;บรมปาล;Boromapan;Phaya Borommapan;Phra Maha Thammaracha IV|关系=Son of Saileuthai',

		// gettext_config:{"id":"ayutthaya-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์อู่ทอง/รามาธิบดีที่ ๑|1350~||疑|准=年|时期=อาณาจักรอยุธยา|君主=สมเด็จพระรามาธิบดีที่ 1;พระเจ้าอู่ทอง;Somdet Phra Chao Uthong;Somdet Phra Ramathibodi I|生=1314|关系=First King of Ayutthaya',
		'/สมเด็จพระราเมศวร|1369~||疑|准=年|君主=Somdet Phra Ramesuan;king of Ayutthaya|生=1339|卒=1395|关系=Son of Uthong',
		'ราชวงศ์สุพรรณภูมิ/สมเด็จพระบรมราชาธิราชที่ ๑|1370~||疑|准=年|时期=อาณาจักรอยุธยา|君主=สมเด็จพระบรมราชาธิราชที่ 1;ขุนหลวงพะงั่ว;Somdet Phra Borommarachathirat I;Khun Luang Pha Ngua|关系=Husband of Uthong\'s older sister;Usurper;Former Lord of Suphanburi',
		'/สมเด็จพระเจ้าทองลัน|1388~1388||疑|准=年|君主=เจ้าทองจันทร์;Somdet Phra Chao Thong Lan;Chao Thong Chan|关系=Son of Borommarachathirat I',
		'ราชวงศ์อู่ทอง/สมเด็จพระราเมศวร|1388~||疑|准=年|时期=อาณาจักรอยุธยา|君主=Somdet Phra Ramesuan;king of Ayutthaya|生=1339|关系=Former King reclaiming the throne;Son of Uthong',
		'/สมเด็จพระรามราชาธิราช|1395~||疑|准=年|君主=Somdet Phra Rama Ratchathirat|生=1356|关系=Son of Ramesuan',
		'ราชวงศ์สุพรรณภูมิ/สมเด็จพระอินทราชา|1409~||疑|准=年|时期=อาณาจักรอยุธยา|君主=เจ้านครอินทร์;Somdet Phra Intharacha;king of Ayutthaya;Phra Chao Nakhon In|生=1359|关系=Nephew of Borommarachathirat I;Former Lord of Suphanburi, offered crown',
		'/สมเด็จพระบรมราชาธิราชที่ ๒|1424~||疑|准=年|君主=สมเด็จพระบรมราชาธิราชที่ 2;เจ้าสามพระยา;Somdet Phra Borommarachathirat II;Chao Sam Phraya|关系=Son of Intha Racha I',
		'/สมเด็จพระบรมไตรโลกนาถ|1448~||疑|准=年|君主=Somdet Phra Boromma Trailokanat|生=1431|关系=Son of Borommarachathirat II',
		'/สมเด็จพระบรมราชาธิราชที่ ๓|1488~||疑|准=年|君主=สมเด็จพระบรมราชาธิราชที่ 3;Somdet Phra Borommarachathirat III;Intha Racha II|关系=Son of Trailokanat',
		'/สมเด็จพระรามาธิบดีที่ ๒|1491~||疑|准=年|君主=สมเด็จพระรามาธิบดีที่ 2;พระเชษฐา;Somdet Phra Ramathibodi II;Phra Chetthathirat I|生=1473|关系=Younger brother of Borommarachathirat III;Son of Trailokanat',
		'/สมเด็จพระบรมราชาธิราชที่ ๔|1529~||疑|准=年|君主=สมเด็จพระบรมราชาธิราชที่ 4;หน่อพุทธางกูร;Somdet Phra Borommarachathirat IV;Somdet Phra Borommaracha Nor Buddhankoon;Phra Athitawongse|关系=Son of Ramathibodi II',
		'/พระรัษฎาธิราช|1533~1533||疑|准=年|君主=Phra Ratsadathirat|生=1529|关系=Son of Borommarachathirat IV;Child King, reign under regency',
		'/สมเด็จพระไชยราชาธิราช|1533~||疑|准=年|君主=Somdet Phra Chairacha;Somdet Phra Chairacha Thirat;Phra Chai|关系=Uncle of Ratsadathirat;Son of Ramathibodi II;Usurper',
		'/พระยอดฟ้า|1546~||疑|准=年|君主=พระแก้วฟ้า;Phra Yodfa;Phra Keowfa|生=1535|关系=Son of Chairacha',
		'/ขุนวรวงศาธิราช|1548/11/11~||疑|准=年|君主=Khun Worawongsathirat;Khun Chinnarat;Bun Si|关系=Usurper monarch, not accepted by some historians',
		'/สมเด็จพระมหาจักรพรรดิ|1548/12/22~||疑|准=年|君主=พระเจ้าช้างเผือก;Somdet Phra Maha Chakkraphat;Phra Chao Chang Pueak|生=1509|关系=Son of Ramathibodi II;Younger brother of Borommarachathirat IV and Chairacha;Seized the throne from usurper;Became a monk at Pegu (1564-1568)',
		'/สมเด็จพระมหินทราธิราช|1564~||疑|准=年|君主=Somdet Phra Mahinthrathirat|生=1539|关系=Son of Maha Chakkrapat and Queen Suriyothai',
		'ราชวงศ์สุโขทัย/สมเด็จพระมหาธรรมราชาธิราช|1569~||疑|准=年|时期=อาณาจักรอยุธยา|君主=สมเด็จพระสรรเพชญ์ที่ 1;สมเด็จพระมหาธรรมราชาธิราช;Somdet Phra Mahathammarachathirat;king of Ayutthaya;Somdet Phra Sanphet I|生=1517|关系=Former Lord of Phitsanulok;Installed as vassal of Bayinnaung of Burma, declared independence in 1584',
		'/สมเด็จพระนเรศวรมหาราช|1590/7/29~1605/4/7||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 2;สมเด็จพระนเรศวรมหาราช;Somdet Phra Naresuan the Great;Somdet Phra Sanphet II;Phra Naret|生=1555/4/25|关系=Son of Maha  Thamaracha Declaring Idependant from Burmese during the reign of Bayinnaung\'s Son',
		'/สมเด็จพระเอกาทศรถ|1605/4/25~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 3;สมเด็จพระเอกาทศรถ;Somdet Phra Ekathotsarot;Somdet Phra Sanphet III|生=1557|关系=Brother of Naresuan;Son of Maha Thammarachathirat',
		'/พระศรีเสาวภาคย์|1610~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 4;สมเด็จพระศรีเสาวภาคย์;Somdet Phra Si Saowaphak;Somdet Phra Sanphet IV|关系=Son of Ekathotsarot',
		'/สมเด็จพระเจ้าทรงธรรม|1611~||疑|准=年|君主=สมเด็จพระบรมราชาที่ 1;สมเด็จพระเจ้าทรงธรรม;Somdet Phra Songtham;Somdet Phra Borommaracha I|生=1590|关系=Son of "Ekathotsarot", invited to take the throne after leaving the Sangha',
		'/สมเด็จพระเชษฐาธิราช|1628/12/12~1629||疑|准=年|君主=สมเด็จพระบรมราชาที่ 2;สมเด็จพระเชษฐาธิราช;Somdet Phra Chettha;Somdet Phra Borommaracha II|生=1613|关系=Son of Songtham',
		'/พระอาทิตยวงศ์|1629~1629||疑|准=年|君主=สมเด็จพระอาทิตยวงศ์;Phra Athittayawong|生=1618|关系=Younger brother of Chetthathirat II;Son of Songtham',
		'ราชวงศ์ปราสาททอง/สมเด็จพระเจ้าปราสาททอง|1629~||疑|准=年|时期=อาณาจักรอยุธยา|君主=สมเด็จพระสรรเพชญ์ที่ 5;สมเด็จพระเจ้าปราสาททอง;Somdet Phra Chao Prasat Thong;Somdet Phra Sanphet V|生=1599|关系=Usurper, formerly the Kalahom;Rumored to be a son of Ekathotsarot',
		'/สมเด็จเจ้าฟ้าไชย|1656~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 6;สมเด็จเจ้าฟ้าไชย;Somdet Chao Fa Chai;Somdet Phra Sanphet VI|关系=Son of Prasat Thong',
		'/สมเด็จพระศรีสุธรรมราชา|1656/6~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 7;สมเด็จพระศรีสุธรรมราชา;Somdet Phra Si Suthammaracha;Somdet Phra Sanphet VII|关系=Usurper, Uncle of Chao Fa Chai;Younger brother of Prasat Thong',
		'/สมเด็จพระนารายณ์มหาราช|1656/10/26~1688||疑|准=年|君主=สมเด็จพระรามาธิบดีที่ 3;สมเด็จพระนารายณ์มหาราช;Somdet Phra Narai the Great;Somdet Phra Ramathibodi III|生=1633/2/16|关系=Usurper, nephew of Si Suthammaracha;Son of Prasat Thong;Half-brother of Chao Fa Chai',
		'ราชวงศ์บ้านพลูหลวง/สมเด็จพระเพทราชา|1688/7/11~||疑|准=年|时期=อาณาจักรอยุธยา|君主=Somdet Phra Phetracha|生=1632|关系=Usurper, cousin of Narai;Former commander of the Royal Elephant Corps',
		'/สมเด็จพระสรรเพชญ์ที่ ๘|1703/2~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 8;สมเด็จพระสุริเยนทราธิบดี;พระเจ้าเสือ;Somdet Phra Suriyenthrathibodi;Somdet Phra Sanphet VIII;Phra Chao Suea|关系=Rumored to be a son of Narai',
		'/สมเด็จพระสรรเพชญ์ที่ ๙|1709~||疑|准=年|君主=สมเด็จพระสรรเพชญ์ที่ 9;สมเด็จพระที่นั่งท้ายสระ;สมเด็จพระเจ้าอยู่หัวท้ายสระ;พระเจ้าท้ายสระ;พระเจ้าภูมินทราชา;Somdet Phra Chao Yu Hua Thai Sa;Somdet Phra Sanphet IX|生=1679|关系=Son of Suriyenthrathibodi',
		'/สมเด็จพระเจ้าอยู่หัวบรมโกศ|1733~||疑|准=年|君主=สมเด็จพระบรมราชาธิราชที่ 3;สมเด็จพระเจ้าอยู่หัวบรมโกศ;Somdet Phra Chao Yu Hua Boromakot|生=1680|关系=Brother of Thai Sa, Former Front Palace;Son of Suriyenthrathibodi',
		// 自此后之日期必须参照泰国佛历，而非表列日期！
		'/สมเด็จพระเจ้าอุทุมพร|1758~1758||疑|君主=สมเด็จพระบรมราชาธิราชที่ 4;สมเด็จพระเจ้าอุทุมพร / ขุนหลวงหาวัด;Somdet Phra Chao Uthumphon;Somdet Phra Ramathibodi IV;Khun Luang Hawat|卒=1796|关系=Son of Boromakot',
		'/สมเด็จพระที่นั่งสุริยาศน์อัมรินทร์|1758~1767/4/7||疑|君主=สมเด็จพระบรมราชาที่ 3;สมเด็จพระที่นั่งสุริยาศน์อัมรินทร์ / พระเจ้าเอกทัศ;Somdet Phra Chao Ekkathat;Somdet Phra Chao Yu Hua Phra Thinang Suriyat Amarin;Somdet Phra Borommaracha III|卒=1767/4/17|关系=Brother of Uthumphon;Usurper, Former Front Palace;Son of Boromakot',

		// gettext_config:{"id":"thonburi-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"taksin","mark_type":"part_of_string"}
		// gettext_config:{"id":"thonburi-kingdom","mark_type":"part_of_string"}
		// gettext_config:{"id":"coronation","mark_type":"part_of_string"}
		'ราชวงศ์ธนบุรี/สมเด็จพระเจ้ากรุงธนบุรี|1767/11/6~||疑|时期=อาณาจักรธนบุรี|君主名=郑昭;郑信|君主=สมเด็จพระบรมราชาที่ 4;สมเด็จพระเจ้าตากสินมหาราช;Somdet Phra Chao Taksin the Great;Phra Chao Krung Thonburi;Somdet Phra Borommaracha IV|生=1734/4/17|卒=1782/4/7|关系=Only King of Thonburi|加冕=1768/12/28',

		// gettext_config:{"id":"chakri-dynasty","mark_type":"part_of_string"}
		// gettext_config:{"id":"rattanakosin-kingdom","mark_type":"part_of_string"}
		'ราชวงศ์จักรี/พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช|1782/4/6~||疑|时期=อาณาจักรรัตนโกสินทร์|国名=ประเทศไทย;ราชอาณาจักรสยาม;ราชอาณาจักรไทย|君主=พระพุทธยอดฟ้าจุฬาโลก;รัชกาลที่ 1;Maha Chakri Borommanat;Phra Rama I;the Great;Rama I|生=1737/3/20|卒=1809/9/7|关系=First King of Rattanakosin|加冕=1782/6/13',
		'/พระบาทสมเด็จพระพุทธเลิศหล้านภาลัย|1809/9/7~||疑|君主=พระพุทธเลิศหล้านภาลัย;รัชกาลที่ 2;Maha Itsarasunthon;Phra Rama II of Siam;Rama II|生=1767/2/24|卒=1824/7/21|关系=Son of Rama I and Queen Amarindra',
		'/พระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว|1824/7/21~||疑|君主=นั่งเกล้า;พระมหาเจษฎาราชเจ้า;รัชกาลที่ 3;Maha Rama III;Phra Nang Klao Chao Yu Hua;Rama III;Phra Maha Chetsadarat Chao|生=1788/3/31|卒=1851/4/2|关系=Son of Rama II and Princess Consort Sri Sulalai',
		'/พระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว|1851/4/2~||疑|君主=มงกุฎ;รัชกาลที่ 4;Maha Mongkut;Phra Chom Klao Chao Yu Hua;Rama IV|生=1804/10/18|卒=1868/10/1|关系=Half-brother of Rama III;Son of Rama II and Queen Sri Suriyendra',
		'/พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว|1868/10/1~||疑|君主=จุฬาลงกรณ์;พระปิยมหาราช;รัชกาลที่ 5;Maha Chulalongkorn;Phra Chula Chom Klao Chao Yu Hua;the Great;Rama V;Phra Piya Maharat|生=1853/9/20|卒=1910/10/23|关系=Son of Rama IV and Queen Debsirindra;Under Regency of Si Suriyawongse from 1868-1873',
		'/พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว|1910/10/23~||疑|君主=วชิราวุธ;พระมหาธีรราชเจ้า;รัชกาลที่ 6;Maha Vajiravudh;Phra Mongkut Klao Chao Yu Hua;Rama VI;Phra Maha Thirarachachao|生=1881/1/1|卒=1925/11/25|关系=Son of Rama V and Queen Saovabha Phongsri',
		'/พระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว|1925/11/25~||疑|君主=ประชาธิปก;รัชกาลที่ 7;Maha Prajadhipok;Phra Pok Klao Chao Yu Hua;Rama VII|生=1893/11/8|卒=1941/5/30|关系=Younger brother of Rama VI;Son of Rama V and Queen Saovabha Phongsri',
		'/พระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล|1935/3/2~||疑|君主=อานันทมหิดล;พระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล พระอัฐมรามาธิบดินทร;พระอัฐมรามาธิบดินทร;รัชกาลที่ 8;Maha Ananda Mahidol;Phra Atthama Ramathibodin;Rama VIII|生=1925/9/20|卒=1946/6/9|关系=Nephew of Rama VII;Grandson of Rama V by Mahidol Adulyadej;Under Regency from 1935-1946',
		'/พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช|1946/6/9~|:CE|君主=ภูมิพลอดุลยเดช;สมเด็จพระภัทรมหาราช;รัชกาลที่ 9;Maha Bhumibol Adulyadej;the Great;Rama IX;Somdet Phra Phatthara Maharat|生=1927/12/5|卒=2016/10/13|关系=Younger brother of Rama VIII;Grandson of Rama V by Mahidol Adulyadej',
		'/สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรางกูร|2016/10/13~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|君主=มหาวชิราลงกรณ;รัชกาลที่ 10;Somdet Phra Chao Yu Hua;Maha Vajiralongkorn;Bodindradebayavarangkun;Rama X|生=1952/7/28|关系=Only son of Rama IX and Queen Sirikit;2nd child of Rama IX|加冕=2019/5/4'

]).minute_offset = 7 * 60;

// ---------------------------------------------------------------------//
// 缅甸, Myanmar / Burma

// gettext_config:{"id":"myanmar"}
(CeL.era.pass_on.countries['မြန်မာ'] = [

		function() {
			var start = -25 - 1, year = start, calendar = [],
			//
			end = this.last_day.to_Date().to_Myanmar()[0] + 1;

			while (year < end) {
				var month_days = CeL.Myanmar_Date.month_days(year++, {
				// start_month : 0
				});
				calendar.push(
				// 缅历每年并非从首月一日起始
				'/' + month_days.start_date[1] + '/' + month_days.start_date[2]
						+ '=' + month_days.join(';'));
			}

			return [
					'ME',
					[ CeL.Myanmar_Date.new_year_Date(start),
							CeL.Myanmar_Date.new_year_Date(end) ],
					start + calendar.join('	'), '参照用',
					// 因为无法处理 watat year 时之月名；比起将就，不如不设定；须参照相对应之缅历。
					// '月名=' +
					// CeL.Myanmar_Date.month_name.en.slice(1).join(';'),
					, '注=Myanmar calendar, Myanmar era' ];
		}.call(CeL.era.pass_on),

		// 出身和关系: 为前任者之～, Relationship with predecessor(s).

		// Upper Burma, Middle Early Pagan
		//
		// http://en.wikipedia.org/wiki/List_of_early_and_legendary_monarchs_of_Burma#Middle_Early_Pagan
		// Reign per Zatadawbon Yazawin, Maha Yazawin, Yazawin Thit, and Hmannan
		// Yazawin
		//
		// http://en.wikipedia.org/wiki/Burmese_calendar
		// 640 CE, King Popa Sawrahan (r. 613–640) recalibrated the calendar,
		// named the new era Kawza Thekkarit (ကောဇာ သက္ကရာဇ် [kɔ́zà θɛʔkəɹɪʔ])
		// with a Year Zero starting date of 22 March 638 CE. It was used as the
		// civil calendar while the Buddhist Era remained in use as the
		// religious calendar.
		'Middle Early Pagan/Popa Sawrahan|Myanmar:-25~|:ME|疑|准=年|时期=Early Pagan|关系=Usurper',
		'/Shwe Ohnthi|Myanmar:2~|:ME|疑|准=年|关系=Son-in-law',
		'/Peit Thon|Myanmar:14~|:ME|疑|准=年|关系=Brother',
		'/Peit Taung|Myanmar:22~|:ME|疑|准=年|关系=Son',
		'/Min Khwe|Myanmar:72~|:ME|疑|准=年|关系=Brother',
		'/Myingyway|Myanmar:78~|:ME|疑|准=年|关系=Usurper',
		'/Theinga|Myanmar:88~|:ME|疑|准=年|关系=Elected by court; of royal blood',
		'/Thein Khun|Myanmar:96~|:ME|疑|准=年|关系=Son',
		'/Shwe Laung|Myanmar:106~|:ME|疑|准=年|关系=Son',
		'/Htun Htwin|Myanmar:115~|:ME|疑|准=年|关系=Son',
		'/Shwe Hmauk|Myanmar:124~|:ME|疑|准=年|关系=Son',
		'/Htun Lut|Myanmar:147~|:ME|疑|准=年|关系=Brother',
		'/Saw Khin Hnit|Myanmar:164~|:ME|疑|准=年|关系=Son',
		'/Khe Lu|Myanmar:191~|:ME|疑|准=年|关系=Son',

		// http://en.wikipedia.org/wiki/Zatadawbon_Yazawin
		// In terms of regnal years, the chronicle is considered "the most
		// accurate of all Burmese chronicles, particularly with regard to the
		// best-known Pagan and Ava kings, many of whose dates have been
		// corroborated by epigraphy."
		'Late Early Pagan/Pyinbya|Myanmar:208~|:ME|准=年|时期=Early Pagan|关系=Brother',
		'/Tannet|Myanmar:238~|:ME|准=年|关系=Son',
		'/Sale Ngahkwe|Myanmar:266~|:ME|准=年|关系=Usurper',
		'/Theinhko|Myanmar:296~|:ME|准=年|关系=Son',
		'/Nyaung-u Sawrahan|Myanmar:318~|:ME|准=年|关系=Usurper',
		'/Kunhsaw Kyaunghpyu|Myanmar:363~|:ME|准=年|关系=Son of Tannet',
		'/Kyiso|Myanmar:383~|:ME|准=年|关系=Son of Nyaung-u Sawrahan',
		'/Sokkate|Myanmar:400~406|:ME|准=年|关系=Brother',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// the chronicle reported order and reign dates. G.H. Luce does not
		// recognize Naratheinkha, and proposes an interregnum of nine years
		// between 1165 and 1174. But Luce's gap has been rigorously questioned.
		// Moreover, Luce proposes that Naratheinga Uzana was king between 1231
		// and 1235 but it too is not universally accepted.
		// http://en.wikipedia.org/wiki/List_of_heirs_to_the_Burmese_thrones
		// gettext_config:{"id":"pagan","mark_type":"part_of_string"}
		'Pagan/Anawrahta|1044/8/11~|:ME|关系=Son of Kunhsaw Kyaunghpyu',
		'/Sawlu|1077/4/11~|:ME|准=年|在位=11 April 1077–c. 21 April 1084|关系=Son',
		'/Kyansittha|1084/4/21~|:ME|准=年|在位=21 April 1084–1112/13|关系=Half-brother',
		'/Sithu I|1112/13~|:ME|准=年|在位=1112/13–1167|关系=Grandson',
		'/Narathu|1167~|:ME|准=年|在位=1167–c. February 1171|关系=Son',
		'/Naratheinkha|1171/2/1~|:ME|准=年|在位=c. February 1171–May 1174|关系=Son',
		'/Sithu II|1174/5/1~|:ME|准=年|在位=May 1174–18 August 1211|关系=Brother',
		'/Htilominlo|1211/8/18~1235/7/18|:ME|关系=Son',
		'/Naratheinga Uzana|1231~|:ME|准=年|在位=c. 1231?/35–19 July 1235|关系=Son',
		'/Kyaswa|1235/7/19~|:ME|准=年|在位=19 July 1235–c. May 1251|关系=Son of Htilominlo',
		'/Uzana|1251/5/1~|:ME|准=年|在位=c. May 1251–c. 6 May 1256|关系=Son',
		'/Narathihapate|1256/5/6~1287/7/1|:ME|关系=Son',
		// Interregnum (1287–1289)
		'/Kyawswa|1289/5/30~1297/12/17|:ME|关系=Son',
		'/Sawhnit|1299/5/8~|:ME|准=年|在位=8 May 1299–1325|关系=Son',
		'/Uzana II|1325~1368|:ME|准=年|关系=Son',

		// Small kingdoms
		// All main chronicles prior to Hmannan Yazawin say that the co-regency
		// ended in 674 ME (1312/13) but Hmannan says it ended in 672 ME
		// (1310/11). Inscriptional evidence shows that the first brother died
		// on 13 April 1310 but the second brother was still alive.
		'Myinsaing/Athinkhaya|1297/12/17~1310/4/13|:ME|关系=Founders|注=Co-Regent: Yazathingyan, Thihathu',
		'/Yazathingyan|1297/12/17~1312|:ME|关系=Co-rulers|注=Co-Regent: Athinkhaya, Thihathu',
		'/Thihathu|1297/12/17~|:ME|关系=Co-rulers|注=Co-Regent: Athinkhaya, Yazathingyan',
		// Most of the dates below are by Than Tun and Gordon Luce who had
		// checked the chronicle reported dates with inscriptions. Myinsaing
		// Sithu does not appear in any of the chronicles.
		'Pinya/Thihathu|1313/2/7~|:ME|准=年|在位=7 February 1313–c. February 1325|关系=Brother of Athinkhaya and Yazathingyan',
		'/Uzana I|1325/2/1~|:ME|准=年|在位=c. February 1325–1 September 1340|关系=Adopted son of Thihathu; Son of Kyawswa of Pagan',
		'/Myinsaing Sithu|1340/9/1~|:ME|关系=Maternal uncle?',
		'/Kyawswa I|1344/3/29~|:ME|关系=Nephew and son-in-law|君主名=Ngarsishin Kyawswa;Thihathu II',
		'/Kyawswa II|1350/12/12~|:ME|关系=Son',
		'/Narathu|1359/3/19~|:ME|准=年|君主名=Thihathu III|在位=19 March 1359–June 1364|关系=Brother',
		'/Uzana II|1364/6/1~1364/9/1|:ME|准=年|在位=June 1364–September 1364|关系=Brother',

		// Most of the dates are by Than Tun and Gordon Luce who had checked the
		// dates provided in the chronicles against the inscriptions. Sawyun's
		// start of reign date and Minbyauk's end of reign date are per Hmannan.
		'Sagaing/Sawyun|1315/5/16~|:ME|关系=Son of Thihathu',
		'/Tarabya I|1327/2/5~|:ME|准=年|在位=5 February 1327–1335|关系=Maternal half-brother',
		'/Shwetaungtet|1335~|:ME|准=年|关系=Son',
		'/Kyaswa of Sagaing|1339~|:ME|准=年|关系=Uncle; Son of Sawyun',
		'/Nawrahta Minye|1348~|:ME|准=年|在位=1348–c. March 1350|关系=Brother',
		'/Tarabya II|1350/3/1~|:ME|准=年|在位=c. March 1350–23 February 1352|关系=Brother',
		'/Minbyauk Thihapate|1352/2/23~|:ME|准=年|在位=23 February 1352–April 1364|关系=Brother-in-law',
		// Different Burmese chronicles give similar but not identical dates for
		// the regnal dates of the Ava period. The following table largely
		// follows the dates given in Hmannan Yazawin and the table of regnal
		// dates given in (Maha Yazawin Vol. 2 2006: 352–355). The regnal dates
		// by G.E. Harvey (Harvey 1925: 366) for the most part are off by a year
		// (a year later) than chronicle and inscriptionally-verified dates.
		'Ava/Thadominbya|1364/4/1~|:ME|准=年|在位=April 1364–c. 5 September 1367|关系=Grandson of Sawyun',
		'/Swasawke|1367/9/5~|:ME|准=年|在位=5 September 1367–April 1400|关系=Grandson of Kyawswa of Pagan and grandnephew ofThihathu',
		'/Tarabya|1400/4/1~|:ME|准=年|在位=April 1400–25 November 1400|关系=Son',
		'/Minkhaung I|1400/11/25~|:ME|准=年|在位=25 November 1400–c. February 1422|关系=Half-brother',
		'/Thihathu|1422/2/1~|:ME|准=年|在位=c. February 1422–August 1425|关系=Son',
		'/Minhlange|1425/8/1~|:ME|准=年|在位=August 1425–November 1425|关系=Son',
		'/Kale Kyetaungnyo|1425/11/1~|:ME|准=年|在位=November 1425–20 May 1426|关系=Uncle',
		'/Mohnyin Thado|1426/5/20~|:ME|准=年|在位=20 May 1426–May 1439|关系=Descended from Kyawswa I of Pinya',
		'/Minyekyawswa|1439/5/1~1442/1/1|:ME|准=年|在位=May 1439–January 1442|关系=Son',
		'/Narapati I|1442/4/25~|:ME|关系=Brother',
		'/Thihathura I|1468/7/24~|:ME|准=年|在位=24 July 1468–c. August 1480|关系=Son',
		'/Minkhaung II|1480/8/1~1501/4/7|:ME|准=年|在位=c. August 1480–7 April 1501|关系=Son',
		'/Thihathura II|1485~1501/3/4|:ME|准=年|在位=1485–4 March 1501|关系=Son',
		'/Narapati II|1501/4/7~|:ME|关系=Son of Minkhaung II',
		'/Thohanbwa|1527/3/14~1542/5/1|:ME|准=年|在位=14 March 1527–May 1542|关系=Son of Sawlon I of Mohnyin',
		'/Hkonmaing|1542/6/1~|:ME|准=年|在位=June 1542–c. September 1545|关系=Saopha of Thibaw',
		'/Narapati III|1545/9/1~|:ME|准=年|在位=c. September 1545–c. October 1551|关系=Son',
		'/Narapati IV|1551/10/1~1555/1/22|:ME|准=年|在位=c. October 1551–22 January 1555|关系=Governor of Salin and Viceroy of Sagaing',

		// http://en.wikipedia.org/wiki/List_of_rulers_of_Prome
		// The following list is per the standard Burmese chronicles Maha
		// Yazawin and Hmannan Yazawin, unless otherwise noted. The Yazawin Thit
		// chronicle reports a slightly different list; most notably, it does
		// not accept that Crown Prince Minye Kyawswa was governor between 1415
		// and 1416.
		'Prome/Thihathu I|1275~1288|:ME|准=年|关系=Appointed|注=In revolt (1287–88)',
		'/Kyaswa|1289~|:ME|准=年|关系=Younger brother|注=Minister Pizzawta, not Kyaswa, was governor according to Yazawin Thit',
		'/Saw Yan Naung|1323~|:ME|准=年|关系=Appointed|注=Son of Thihathu of Prome and elder brother of Swasawke of Ava',
		'/Myet-Hna Shay|1377~|:ME|准=年|关系=Nephew',
		'/Htihlaing|1388~|:ME|准=年|关系=Appointed',
		'/Letya Pyanchi|1393~|:ME|准=年|关系=Appointed',
		'/Sokkate|1415~|:ME|准=年|在位=1415 (3 months)|关系=Appointed',
		'/Minye Kyawswa I|1415/4~|:ME|准=年|关系=Appointed',
		'/Thihathu II|1416~|:ME|准=年|关系=Appointed|注=Minye Kyawswa Saw Shet Khet, not the crown prince, per Yazawin Thit',
		'/Minye Kyawswa II|1419~|:ME|准=年|关系=Appointed|注=aka Saw Shwe Khet',
		'/Min Maha|1425~|:ME|准=年|关系=Appointed|注=Reappointed to be governor of Sagaing',
		'/Thihathu III|1429~|:ME|准=年|在位=1429–25 April 1442|关系=Appointed|注=Later known as King Narapati I of Ava',
		'/Minye Kyawswa III|1442/4/25~|:ME|准=年|在位=25 April 1442–January 1446|关系=Appointed|注=Brother-in-law of Narapati I; Reappointed to be governor of Tharrawaddy',
		'/Mingyi Swa|1446/1/1~|:ME|准=年|在位=January 1446–1482|关系=Appointed',
		// Independent
		'/Thado Minsaw|1482~|:ME|准=年|关系=Son of Narapati of Ava|注=Independent',
		'/Bayin Htwe|1526~|:ME|准=年|在位=1526–c. December 1532|关系=Son|注=Independent',
		'/Narapati|1532/12/1~|:ME|准=年|在位=c. December 1532–c. February 1539|关系=Son|注=Vassal of Confederation of Shan States',
		'/Minkhaung|1539/2/1~|:ME|准=年|在位=c. February 1539–19 May 1542|关系=Brother|注=Vassal of Confederation of Shan States',
		// ↑ Independent
		'/Thado Dhamma Yaza I|1542/5/19~|:ME|关系=Appointed|注=Nanny of Tabinshwehti; In revolt (1550–1551)',
		'/Thado Dhamma Yaza II|1551/8/30~1588/12|:ME|在位=30 August 1551–Nov/Dec 1588|关系=Appointed|注=Younger brother of Bayinnaung',
		'/Thado Dhamma Yaza III|1589/2/28~|:ME|关系=Appointed|注=Son of Nanda; in revolt (1595–97)',
		'/Yan Naing|1597/9/17~1608/7/13|:ME|关系=Usurper|注=Independent; Taken to Ava as POW',
		'/Thado Dhamma Yaza IV|1620/11/2~1628/7/9|:ME|关系=Appointed|注=Later known as King Thalun',
		'/Udein Kyawhtin|1630/6/1~1648|:ME|准=年|在位=June 1630–1648?|关系=Appointed',
		'/Pye Min|1650/9/13~1661/6/3|:ME|关系=Appointed',

		'Hanthawaddy/Wareru|1287/4/4~|:ME|准=年|在位=4 April 1287–January 1307|关系=Founder',
		'/Hkun Law|1307~1311/3/1|:ME|准=年|在位=January 1307–March 1311|关系=Brother',
		'/Saw O|1311/4/10~|:ME|准=年|在位=10 April 1311–September 1323|关系=Nephew',
		'/Saw Zein|1323/9/1~|:ME|准=年|在位=September 1323–April 1330|关系=Brother',
		'/Zein Pun|1330/4/1~|:ME|准=年|在位=April 1330–April 1330|关系=Usurper',
		'/Saw E|1330/4/1~|:ME|准=年|在位=April 1330–May 1330|关系=Nephew of Saw Zein',
		'/Binnya E Law|1330/5/1~|:ME|准=年|在位=May 1330–1348|关系=Uncle; Son of Hkun Law',
		'/Binnya U|1348~|:ME|准=年|在位=1348–2 January 1384|关系=Nephew; Son of Saw Zein',
		'/Razadarit|1384/1/2~|:ME|准=年|在位=2 January 1384–c. February 1421|关系=Son',
		'/Binnya Dhammaraza|1421/2/1~|:ME|准=年|在位=c. February 1421–1424|关系=Son',
		'/Binnya Ran I|1424~|:ME|准=年|关系=Brother',
		'/Binnya Waru|1446~|:ME|准=年|在位=1446–30 May 1451|关系=Nephew',
		'/Binnya Kyan|1451/5/30~|:ME|准=年|在位=30 May 1451–c. June 1453|关系=Cousin; Son of Binnya Dhamaraza',
		'/Leik Munhtaw|1453/6/1~|:ME|准=年|在位=c. June 1453–c. January 1454|关系=Cousin; Son of Binnya Ran',
		'/Shin Sawbu|1454~|:ME|准=年|在位=c. January 1454–1471|关系=Aunt; Daughter of Razadarit',
		'/Dhammazedi|1471~|:ME|准=年|关系=Son in law',
		'/Binnya Ran II|1492~|:ME|准=年|关系=Son',
		'/Takayutpi|1526~1539/1/1|:ME|准=年|在位=1526–c. January 1539|关系=Son',
		// Toungoo rule (1539–1550)
		'/Smim Sawhtut|1550/6/1~|:ME|准=年|在位=June 1550–August 1550|关系=Claimant to throne',
		'/Smim Htaw|1550/8/1~1552/3/12|:ME|准=年|在位=August 1550–12 March 1552|关系=Brother of Takayutpi',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// http://en.wikipedia.org/wiki/List_of_Arakanese_monarchs
		// The reign dates are per the Arakanese chronicle Rakhine Razawin Thit
		// (Sandamala Linkara Vol. 2 1931), converted into Western dates using
		// (Eade 1989). (Some Arakanese chronicles state the foundation of the
		// kingdom a year later, 1430. Moreover, the end of the kingdom is given
		// per Burmese records, 2 January 1785. Arakanese records give a day
		// earlier, 1 January 1785.)
		'Mrauk U/Saw Mon|1429/4/18~|:ME|关系=Founder',
		'/Khayi|1433/5/9~|:ME|准=年|在位=9 May 1433–c. January 1459|关系=Brother',
		'/Ba Saw Phyu|1459/1/1~|:ME|准=年|在位=c. January 1459–5 August 1482|关系=Son',
		'/Dawlya|1482/8/5~|:ME|准=年|在位=5 August 1482–c. February 1492|关系=Son',
		'/Ba Saw Nyo|1492/2/1~|:ME|准=年|在位=c. February 1492–c. January 1494|关系=Uncle',
		'/Ran Aung|1494/1/1~|:ME|准=年|在位=c. January 1494–c. July 1494|关系=Nephew',
		'/Salingathu|1494/7/1~|:ME|准=年|在位=c. July 1494–February 1502|关系=Maternal uncle',
		'/Raza|1502/2/1~|:ME|准=年|在位=February 1502–c. November 1513|关系=Son',
		'/Gazapati|1513/11/1~|:ME|准=年|在位=c. November 1513–January 1515|关系=Son',
		'/Saw O|1515/1/1~|:ME|准=年|在位=January 1515–July 1515|关系=Granduncle; brother of Salingathu',
		'/Thazata|1515/7/1~|:ME|准=年|在位=July 1515–c. April 1521|关系=Son of Dawlya',
		'/Minkhaung|1521/4/1~|:ME|准=年|在位=c. April 1521–27 May 1531|关系=Brother',
		'/Min Bin|1531/5/27~|:ME|关系=Son of Min Raza',
		'/Dikkha|1554/1/11~|:ME|关系=Son',
		'/Saw Hla|1556/3/6~|:ME|关系=Son',
		'/Sekkya|1564/7/24~|:ME|关系=Brother',
		'/Min Phalaung|1572/2/7~|:ME|关系=Son of Min Bin|君主名=Min Phalaung;မင်းဖလောင်း;Min Hpalaung',
		'/Razagri|1593/7/4~|:ME|关系=Son',
		'/Khamaung|1612/7/4~|:ME|关系=Son',
		'/Thiri Thudhamma|1622/5/14~|:ME|关系=Son',
		'/Sanay|1638/5/29~|:ME|关系=Son',
		'/Narapati|1638/6/17~|:ME|关系=Great grandson of Min Bin',
		'/Thado|1645/12/13~|:ME|准=年|在位=13 December 1645–c. May 1652|关系=Son',
		'/Sanda Thudhamma|1652/5/1~|:ME|准=年|在位=c. May 1652–11 June 1674|关系=Son',
		'/Thiri Thudhamma|1674/6/11~|:ME|关系=Son',
		'/Wara Dhammaraza|1685/4/16~|:ME|关系=Brother|君主名=Wara Dhamma',
		'/Muni Thudhammaraza|1692/6/20~|:ME|关系=Elder brother|君主名=Mani Dhamma',
		'/Sanda Thuriya I|1694/12/20~|:ME|关系=Brother',
		'/Nawrahta|1696/8/4~|:ME|关系=Son',
		'/Mayuppiya|1696/8/18~1697/5/13|:ME|关系=Usurper|君主名=Mayonpiya',
		'/Kalamandat|1697/5/16~|:ME|关系=Usurper|君主名=Kalagandat',
		'/Naradipati I|1698/6/5~|:ME|关系=Son of Sanda Thuriya|君主名=Naradipadi I',
		'/Sanda Wimala I|1700/6/18~1707/3/30|:ME|关系=Grandson of Thado',
		'/Sanda Thuriya II|1707/4/3~1710/9/1|:ME|准=年|在位=3 April 1707–September 1710|关系=Grandson of Sanda Thudhamma',
		// Interregnum ~2 months
		'/Sanda Wizaya I|1710/11/1~|:ME|准=年|在位=November 1710–April 1731|关系=Usurper',
		'/Sanda Thuriya III|1731/4/1~|:ME|准=年|在位=April 1731–1734|关系=Son-in-law',
		'/Naradipati II|1734~|:ME|准=年|关系=Son|君主名=Naradipadi II',
		'/Narapawara|1735~|:ME|准=年|在位=1735–September 1737|关系=Usurper',
		'/Sanda Wizaya II|1737/9/1~1738/3/25|:ME|准=年|在位=September 1737–25 March 1738|关系=Cousin',
		'/Madarit|1738/3/28~|:ME|关系=Brother',
		'/Nara Apaya|1743/2/6~|:ME|关系=Uncle',
		'/Thirithu|1761/10/28~|:ME|关系=Son',
		'/Sanda Parama|1762/2/3~|:ME|关系=Brother',
		'/Apaya|1764/5/1~|:ME|关系=Brother-in-law',
		'/Sanda Thumana|1774/1/17~|:ME|关系=Brother-in-law',
		'/Sanda Wimala II|1777/5/6~|:ME|关系=Usurper',
		'/Sanda Thaditha|1777/6/5~|:ME|关系=Usurper',
		'/Maha Thammada|1782/12/2~1785/1/2|:ME|关系=Usurper',

		// http://en.wikipedia.org/wiki/List_of_Burmese_monarchs
		// http://en.wikipedia.org/wiki/List_of_rulers_of_Toungoo
		// gettext_config:{"id":"toungoo","mark_type":"part_of_string"}
		'Toungoo/Thawun Gyi|1279/4/21~|:ME|准=年|在位=21 April 1279–1317|关系=Son of Thawun Letya|注=Vassal of Pagan (1279–1287); independent (1287–1317); assassinated',
		'/Thawun Nge|1317~|:ME|准=年|关系=Brother|注=Independent (1317–1322); Vassal of Pinya (1322–1324)',
		'/Saw Hnit|1324~|:ME|准=年|关系=Son|注=Vassal of Pinya; assassinated',
		'/Kayin Ba|1325~|:ME|准=年|关系=No relations; usurper|注=Vassal of Pinya',
		'/Letya Sekkya|1342~|:ME|准=年|关系=Son-in-law|注=Vassal of Pinya; assassinated',
		'/Htauk Hlayga|1344~|:ME|准=年|关系=Brother; usurper|注=Vassal of Pinya; assassinated',
		'/Theinkhaba|1346~|:ME|准=年|在位=1346–29 March 1367|关系=No relations; usurper|注=Independent/in rebellion (1358–1366)',
		'/Pyanchi I|1367/3/29~|:ME|准=年|在位=29 March 1367–1375|关系=Son|注=Vassal of Ava; assassinated',
		'/Ma Sein|1375~|:ME|准=年|关系=Usurper|在位=1375 (7 months)|注=In rebellion/vassal of Hanthawaddy Pegu; assassinated',
		'/Pyanchi II|1375/8~|:ME|准=年|关系=Son of Pyanchi I|注=Vassal of Ava; assassinated',
		'/Sokkate|1379~|:ME|准=年|关系=Brother-in-law|注=Vassal of Ava; assassinated',
		'/Phaungga|1383~|:ME|准=年|关系=Usurper|注=Vassal of Ava',
		'/Saw Oo I|1397~|:ME|准=年|关系=Son|注=Removed from office',
		'/Min Nemi|1399~|:ME|准=年|在位=1399–1408|关系=No relations|注= appointed',
		'/Letya Zeya Thingyan|1408~|:ME|准=年|关系=Appointed|注=Moved to become governor ofPyinsi',
		'/Thinkhaya I|1412~|:ME|准=年|关系=Appointed',
		'/Thinkhaya II|1415~1418|:ME|准=年|关系=Appointed|注=Assassinated',
		// No office holder (1418–1419)
		'/Pantaung|1419~|:ME|准=年|关系=Appointed|注=Removed from office',
		'/Thinkhaya III|1420~|:ME|准=年|关系=Appointed|注=Independent/in rebellion (1426–1435)',
		'/Uzana|1435~|:ME|准=年|关系=Son-in-law; Appointed|注=Independent/in rebellion; Vassal of Hanthawaddy; Removed from office by Binnya Ran I',
		'/Saw Oo II|1436~|:ME|准=年|关系=Son of Thinkhaya III|注=Independent/in rebellion; killed in action',
		'/Tarabya|1440~|:ME|准=年|在位=1440–2 January 1446|关系=Appointed|注=Vassal of Ava',
		'/Minkhaung I|1446/1/2~|:ME|准=年|在位=2 January 1446–1451|关系=Son|注=Vassal of Ava; assassinated',
		'/Minye Kyawhtin of Toungoo|1451~|:ME|准=年|关系=Usurper; son of Crown Prince Minyekyawswa|注=Independent/in rebellion (1451–1459); assassinated',
		'/Thiri Zeya Thura|1459~|:ME|准=年|关系=Appointed|注=Removed from office',
		'/Letya Zala Thingyan|1466~|:ME|准=年|关系=Appointed|注=Independent/in revolt (1470); deposed',
		'/Sithu Kyawhtin|1470~|:ME|准=年|关系=Appointed|注=Vassal of Ava; died in action',
		'/Min Sithu|1481~|:ME|准=年|在位=1481–c. April 1485|关系=Son|注=Vassal of Ava; assassinated',
		// Independent
		'/Mingyinyo|1485/4/1~|:ME|准=年|在位=c. April 1485–24 November 1530|关系=Nephew|注=Declared independence from Ava in 1510/10/16',
		'/Tabinshwehti|1530/11/24~|:ME|准=年|在位=24 November 1530–1540|关系=Son|注=Moved seat of government to Pegu(Bago) in 1539',
		'/Minye Thihathu I|1540~|:ME|准=年|在位=1540–March 1549|关系=Appointed; father of Bayinnaung',
		'/Minkhaung II|1549/3/1~1551/1/11|:ME|准=年|在位=March 1549–11 January 1551|关系=Appointed|注=Independent/in rebellion (1550–1551); Minkhaung resisted for four months but finally surrendered on 11 January 1551.',
		'/=|1552/6/6~|:ME|关系=Younger brother; re-appointed|注=viceroy of Toungoo',
		'/Minye Thihathu II|1584/6/1~|:ME|准=年|在位=June 1584–11 August 1609|关系=Son|注=Independent/in rebellion (1597–1609)|注=Viceroy of Toungoo: June 1584 – c. February 1597; King of Toungoo: – 11 August 1609',
		'/Natshinnaung|1609/8/11~1610/9/4|:ME|关系=Son; appointed 1610–1612|注=Independent/in rebellion (1609–1610); King of Toungoo; Coronation: 6th waning of Wagaung 971 ME, 1609/8/21',
		// King of Burma and dominions
		// On 30 April 1550, Tabinshwehti was assassinated by his own bodyguards
		// on the order of Smim Sawhtut, one of the king's close advisers.[
		'/Bayinnaung|1550/4/30~|:ME|关系=Brother-in-law',
		'/Nanda|1581/10/10~|:ME|关系=Son; nephew of Tabinshwehti',
		'/Nyaungyan Min|1599/12/19~|:ME|关系=Half-brother',
		'/Anaukpetlun|1605/11/5~|:ME|关系=Son',
		'/Minye Deibba|1628/7/9~|:ME|关系=Son',
		'/Thalun|1629/8/19~|:ME|关系=Uncle',
		'/Pindale|1648/8/27~|:ME|关系=Son',
		'/Pye|1661/6/3~|:ME|关系=Brother',
		'/Narawara|1672/4/14~|:ME|关系=Son',
		'/Minye Kyawhtin|1673/2/27~|:ME|关系=Nephew',
		'/Sanay|1698/5/4~|:ME|关系=Son',
		'/Taninganway|1714/9/12~|:ME|关系=Son',
		'/Mahadhammaraza Dipadi|1733/12/12~1752/3/23|:ME|关系=Son',

		// Restored Hanthawaddy Kingdom
		'Restored Hanthawaddy/Smim Htaw Buddhaketi|1740/11/1~|:ME|准=年|在位=November 1740–December 1747|关系=Cousin of Mahadhammaraza Dipadi',
		'/Binnya Dala|1747/12/1~1757/5/6|:ME|准=年|在位=December 1747–6 May 1757|关系=Elected',

		// gettext_config:{"id":"konbaung","mark_type":"part_of_string"}
		'ကုန်းဘောင်ခေတ်/Alaungpaya|1752/2/29~|:ME|关系=Founder',
		'/Naungdawgyi|1760/5/11~|:ME|关系=Son',
		'/Hsinbyushin|1763/11/28~|:ME|关系=Brother',
		'/Singu|1776/6/10~|:ME|关系=Son',
		'/Phaungka|1782/2/6~|:ME|关系=Cousin; Son of Naungdawgyi',
		"/Bodawpaya|1782/2/11~|:ME|关系=Uncle; Alaungpaya's fourth son",
		// 英属缅甸存在于1824年至1948年。
		'/Bagyidaw|1819/6/5~|:ME|关系=Grandson',
		'/Tharrawaddy|1837/4/15~|:ME|关系=Brother',
		'/Pagan|1846/11/17~|:ME|关系=Son',
		'/Mindon|1853/2/18~|:ME|关系=Brother',
		'/Thibaw Min|1878/10/1~|:ME|关系=Son',
		//
		'Konbaung exiled/=|1885/11/29~|:CE',
		'/Myat Paya Lat|1916/12/19~|:CE|疑|关系=Daughter',
		'/Myat Phaya|1956/4/4~|:CE|疑|关系=Younger sister',
		'/Taw Phaya|1962/7/20~' + CeL.era.pass_on.last_day
				+ '|:CE|疑|关系=Second son',

		// https://en.wikipedia.org/wiki/President_of_Myanmar
		'British Burma|1824/3/5~1948/1/3|:CE|注=First Anglo-Burmese War: 1824/3/5. From 31 January 1862 to 1 May 1897, British Burma was headed by a Chief Commissioner.',

		// https://ja.wikipedia.org/wiki/%E3%83%93%E3%83%AB%E3%83%9E%E3%81%AE%E6%88%A6%E3%81%84
		'Japanese occupation of Burma|1942/3/8~1945/5/2|:CE|注=3月8日首都ラングーンを占领した。...开戦时には日本军はビルマの全面占领までは意図しておらず、第15军は军政部を持っていなかった。那须义雄大佐を长とする军政部が设置されたのはラングーン占领后である。|注=イギリス军は5月2日にラングーンを夺回した。',

		// https://en.wikipedia.org/wiki/List_of_Presidents_of_Myanmar
		// https://zh.wikipedia.org/wiki/%E7%BC%85%E7%94%B8%E6%80%BB%E7%BB%9F
		// https://my.wikipedia.org/wiki/%E1%80%95%E1%80%BC%E1%80%8A%E1%80%BA%E1%80%91%E1%80%B1%E1%80%AC%E1%80%84%E1%80%BA%E1%80%85%E1%80%AF%E1%80%99%E1%80%BC%E1%80%94%E1%80%BA%E1%80%99%E1%80%AC%E1%80%94%E1%80%AD%E1%80%AF%E1%80%84%E1%80%BA%E1%80%84%E1%80%B6%E1%80%90%E1%80%B1%E1%80%AC%E1%80%BA%E1%81%8F_%E1%80%9E%E1%80%99%E1%80%B9%E1%80%99%E1%80%90%E1%80%99%E1%80%BB%E1%80%AC%E1%80%B8
		'Union of Burma/စဝ်ရွှေသိုက်|1948/1/4~|:CE|时期=Post-independence Burma|君主名=Sao Shwe Thaik',
		'/ဘဦး|1952/3/16~|:CE|君主名=Ba U;Ba Oo',
		'/မန်းဝင်းမောင်|1957/3/13~|:CE|君主名=Mahn Win Maung',
		'/နေဝင်း|1962/3/2~|:CE|君主名=Ne Win',
		'Socialist Republic of the Union of Burma/=|1974/3/2~|:CE|时期=Military rule',
		'/စန်းယု|1981/11/9~|:CE|君主名=San Yu',
		'/စိန်လွင်|1988/7/27~|:CE|君主名=Sein Lwin|注=1988年7月26日任缅甸社会主义纲领党主席，次日继任缅甸总统',
		'/အေးကို|1988/8/12~|:CE|君主名=Aye Ko',
		'/မောင်မောင်|1988/8/19~|:CE|君主名=Maung Maung',
		'/စောမောင်|1988/9/18~|:CE|君主名=Saw Maung',
		'Late Union of Burma/=|1988/9/23~|:CE|时期=Military rule',
		'Union of Myanmar/=|1989/6/18~|:CE|时期=Military rule|注=1989年6月18日缅甸军人政府将缅甸的英文写法「Burma」改为「Myanmar」。',
		'/သန်းရွှေ|1992/4/23~|:CE|君主名=Than Shwe|注=1997年11月15日起改任国家和平与发展委员会主席(State Law and Order Restoration Council→State Peace and Development Council)',
		// gettext_config:{"id":"republic-of-the-union-of-myanmar","mark_type":"part_of_string"}
		'မြန်မာပြည်/=|2010/10/21~|:CE|国名=Republic of the Union of Myanmar|时期=Democratic reforms',
		'/သိန်းစိန်|2011/3/30~' + CeL.era.pass_on.last_day
				+ '|:CE|君主名=Thein Sein'

]).minute_offset = 6.5 * 60;

// ---------------------------------------------------------------------//
// 印度年表, ancient India
// https://en.wikipedia.org/wiki/List_of_Indian_monarchs

// gettext_config:{"id":"india"}
(CeL.era.pass_on.countries["India"] = [

		// मगध (Magadha empire, c. 1200 BCE–322 BCE)
		// https://en.wikipedia.org/wiki/Magadha
		// 摩揭陀王国

		// Haryanka dynasty (Middle of 6th century BCE–413 BCE) 诃黎王朝
		// Bhattiya
		'Haryanka/Bimbisara|-544~||疑|准=年|生=558|卒=491|时期=मगध|君主名=频毘娑罗;बिम्बिसारः',
		'/Ajātasattu|-492~||疑|准=年|君主名=Ajātaśatru;Ajatasatru',
		'/Udayin|-460~-440||疑|准=年|君主名=Udayabhadra',
		// Anuruddha
		// Munda
		'/Nagadasaka|-437~||疑|准=年|君主名=Nāgadāsaka',

		// Shishunaga dynasty (413–345 BCE) 童龙王朝;幼龙王朝
		'Shishunaga/Shishunaga|-413~||疑|准=年|时期=मगध|君主名=Shusunaga',
		'/Kakavarna Kalashoka|-395~||疑|准=年',
		'/Mahanandin|-367~||疑|准=年',

		// Nanda Dynasty (345–321 BCE) 难陀王朝
		'Nanda/Mahapadma Nanda|-345~||疑|准=年|时期=मगध|君主名=摩诃帕德摩·难陀;大红莲·难陀',
		// Pandhuka
		// Panghupati
		// Bhutapala
		// Rashtrapala
		// Govishanaka
		// Dashasidkhaka
		// Kaivarta
		'/धनानन्द|-329~||疑|准=年|君主名=Dhana Nanda',

		// 波斯人与希腊人的入侵。摩诃帕德摩死后﹐马其顿帝国亚历山大大帝攻入印度河平原。

		// Maurya Empire, Mauryan Empire, 孔雀王朝
		// 常用语言 梵文
		// https://en.wikipedia.org/wiki/Maurya_Empire
		// https://en.wikipedia.org/wiki/List_of_Mauryan_rulers
		'Maurya/Candragupta Maurya|-324~||疑|准=年|朝代=मौर्यसाम्राज्यम्|君主名=Chandragupta Maurya;旃陀罗笈多;月护王',
		'/Bindusara|-297~-273||疑|准=年|君主名=Bindusara Maurya;宾头娑罗',
		'/Ashoka|-268~||疑|准=年|君主名=अशोक;Ashoka Maurya;Aśoka;阿育王;无忧王',
		'/Dasharatha|-232~||疑|准=年|君主名=Dasharatha Maurya',
		'/Samprati|-224~||疑|准=年|君主名=Samprati Maurya',
		'/Shalishuka|-215~||疑|准=年|君主名=Shalishuka Maurya;Śāliśuka',
		'/Devavarman|-202~||疑|准=年|君主名=Devavarman Maurya;Devadharman',
		'/Satadhanvan|-195~||疑|准=年|君主名=Satadhanvan Maurya;Shatadhanvan;Shatadhanus',
		'/Bṛhadratha Maurya|-187~-180||疑|准=年|君主名=Brihadratha Maurya',

		// https://en.wikipedia.org/wiki/Indo-Greek_Kingdom#List_of_the_Indo-Greek_kings_and_their_territories
		// The Indo-Greek Kingdom or Graeco-Indian Kingdom
		// https://en.wikipedia.org/wiki/Timeline_of_Indo-Greek_kingdoms
		'ګندارا‎/Ἀπολλόδοτος Α΄ ὁ Σωτήρ|-180~-160||疑|准=年|君主名=Apollodotus I;Apollodotus I Soter;महरजस अपलदतस त्रतरस|朝代=Gandhāra;Gandhara|时期=Indo-Greek',
		// TODO
		'Punjab/Στράτων B΄ ὁ Σωτήρ|-25~-10||疑|准=年|君主名=Strátōn B΄ ho Sotḗr;Strato II;Strato II "Soter"|时期=Indo-Greek',

		// The Śuṅga Empire (Sanskrit: शुङ्ग) 巽伽王朝
		// https://en.wikipedia.org/wiki/Shunga_Empire#List_of_Shunga_Emperors
		// https://sa.wikipedia.org/wiki/शुङ्गवंशः
		'Shunga/Puṣyamitra Śuṅga|-185~||疑|准=年|朝代=शुङ्ग;शुङ्गवंशः|君主名=Pushyamitra Shunga;पुष्यमित्रः शुङ्गः',
		'/Agnimitra|-149~||疑|准=年|君主名=अग्निमित्र;अग्निमित्रः',
		'/Vasujyeshtha|-141~||疑|准=年|君主名=वसुज्येष्ठः',
		'/Vasumitra|-131~||疑|准=年|君主名=Sumitra;वसुमित्रः',
		'/Andhraka|-124~||疑|准=年|君主名=अन्ध्रकः',
		'/Pulindaka|-122~-119||疑|准=年|君主名=पुलिन्दकः',
		// Ghosha घोषः शुङ्गः
		// Vajramitra वज्रमित्रः
		'/Bhagabhadra|-110~||疑|准=年|君主名=भागभद्रः|注=c. 110 BCE',
		'/Devabhuti|-83~-73||疑|准=年|君主名=देवभूतिः',

		// The Kanva or Kanvayana Dynasty is a Brahmin Dynasty replaced the
		// Sunga dynasty in Magadha
		// 甘婆王朝/甘华王朝
		// https://en.wikipedia.org/wiki/Kanva_dynasty#Rulers
		'Kanva/Vasudeva|-75~||疑|准=年|朝代=काण्ववंशः|君主名=Vasudeva Kanva;वसुदेवः',
		'/Bhumimitra|-66~||疑|准=年|君主名=भूमिमित्रः',
		'/Narayana|-52~||疑|准=年|君主名=नारायणः',
		'/Susharman|-40~-30||疑|准=年|君主名=सुशर्मन्',

		/**
		 * The Mahameghavahana dynasty (Oriya: ମହାମେଘବାହନ; Mahā-Mēgha-Bāhana, c.
		 * 250s BC to 400s AD) was an ancient ruling dynasty of Kalinga after
		 * the decline of the Maurya Empire.
		 * 
		 * @see https://en.wikipedia.org/wiki/Mahameghavahana_dynasty
		 */
		/**
		 * <code>Reign	c. first or second century BCE
		'ମହାମେଘବାହନ/ଖାରବେଳ|-193~-170||疑|准=年|朝代=Mahāmēghabāhana;Maha-Meghavahana;Mahameghavahana|君主名=ଖାରେବଳ;खारवेल;Khārabēḷa;Khāravēla;Kharavela|注=the third and greatest emperor of the Mahameghavahana dynasty of Kalinga (present-day Odisha).',
		</code>
		 */

		// The Gupta Empire (Sanskrit: गुप्तसाम्राज्यम्, Gupta Sāmrājya) was an
		// ancient Indian empire
		// https://en.wikipedia.org/wiki/Gupta_Empire
		// https://en.wikipedia.org/wiki/Template:Gupta_Empire_Infobox
		'Gupta/Śri Gupta|240~||疑|准=年|朝代=गुप्तसाम्राज्यम्|朝代=गुप्ता राजवंश;Gupta;笈多王朝|君主名=Sri Gupta;श्रीगुप्तः',
		'/Ghatotkacha|280~||疑|准=年|君主名=घटोत्कचः',
		// https://en.wikipedia.org/wiki/Gupta_era
		// Gupta era: begins from 318-319 CE
		'/Chandragupta I|320~||疑|准=年|君主名=旃陀罗·笈多一世;चन्द्रगुप्तःI',
		'/Samudragupta|336~||疑|准=年|君主名=Mahārājādhirāja;समुद्रगुप्तः',
		'/Ramagupta|380~380||疑|准=年|君主名=रामगुप्तः',
		'/Chandragupta II|380~||疑|准=年|君主名=Chandragupta Vikramaditya;चन्द्रगुप्तविक्रमादित्यः',
		'/Kumaragupta I|415~||疑|准=年|君主名=Shakraditya;कुमारगुप्तःI',
		'/Skandagupta|455~||疑|准=年|君主名=स्कन्दगुप्तः',
		'/Purugupta|467~||疑|准=年|君主名=पुरुगुप्त;पुरुगुप्तः',
		'/Kumaragupta II|473~||疑|准=年|君主名=कुमारगुप्त द्वितीय;कुमारगुप्तःII',
		'/Budhagupta|476~||疑|准=年|君主名=बुधगुप्त;बुधगुप्तः',
		'/Narasimhagupta|495~||疑|准=年|君主名=Narasimhagupta Baladitya;नरसिंहगुप्तः|注=495 – ? CE',
		// 505: 随便选, 495~510
		'/Vainyagupta|505~||疑|准=年|君主名=वैन्यगुप्त;वैण्यगुप्तः|注=c. ? – c. 507 CE',
		// 510: 随便选, 507~510
		'/Bhanugupta|510~||疑|准=年|君主名=नुगुप्तः|注=c. 510 – c. ? CE',
		'/Kumaragupta III|530~||疑|准=年|君主名=कुमारगुप्तःIII|注=? – 540 CE',
		'/Vishnugupta|540~550||疑|准=年|君主名=विष्णुगुप्त;विष्णुगुप्तः',

// IST (UTC+05:30)
]).minute_offset = 5.5 * 60;

// ---------------------------------------------------------------------//
// Mesopotamian
// https://en.wikipedia.org/wiki/List_of_Mesopotamian_dynasties

// gettext_config:{"id":"mesopotamian"}
(CeL.era.pass_on.countries["Mesopotamian"] = [

		// https://en.wikipedia.org/wiki/Early_Dynastic_Period_(Mesopotamia)

		// ------------------------------------------------

		// Fourth dynasty of Kish, 基什第三王朝
		// https://en.wikipedia.org/wiki/Sumerian_King_List#Fourth_dynasty_of_Kish
		// http://www.historyfiles.co.uk/KingListsMiddEast/MesopotamiaKish.htm
		/**
		 * <code>
		'Kish IV/Nanniya|-2366~|:CE|疑|精=年|准=年|注=He ruled in Kish for 7 years. Then Kish was defeated and the kingship was taken to Unug (Uruk).',
		</code>
		 */

		// ------------------------------------------------
		// 精准至百年。
		// 3rd Dynasty of Uruk, Third dynasty of Uruk, 乌鲁克第三王朝
		// https://en.wikipedia.org/wiki/Uruk#Early_dynastic,_Akkadian,_and_Neo-Sumerian_rulers
		'Uruk III/Lugalzagesi|-2359~|:CE|疑|精=年|准=年|传说|ruler=Lugal-zage-si|注=c. 2294 - 2270 BC short chronology|注=Then Unug was defeated and the kingship was taken to Agade (Akkad).',

		// ------------------------------------------------
		// http://www.aina.org/aol/kinglist
		// https://en.wikipedia.org/wiki/List_of_Assyrian_kings
		// Assyria

		// Akkadian Empire, 阿卡德帝国
		// https://en.wikipedia.org/wiki/Akkadian_Empire
		'Akkadian/Sargon I|-2334~|:CE|疑|精=年|准=年|传说|ruler=Sargon of Akkad|注=United Mesopotamia (Sumer & Akkad)',
		'/Rimush|-2278~|:CE|疑|精=年|准=年|传说|注=Conquers Elam and Marhashi (Central Iran)',
		'/Manishtushu|-2269~|:CE|疑|精=年|准=年|传说|注=Renovates Temple of Ishtar',
		'/Naram-Sin|-2254~|:CE|疑|精=年|准=年|传说|注=Arrogates god-like status to himself',
		'/Shar-Kali-Shari|-2217~|:CE|疑|精=年|准=年|传说|注=Akkadian kingship begins to weaken',
		'/Igigi|-2192~-2192|:CE|疑|精=年|准=年|传说',
		'/Nanium|-2192~|:CE|疑|精=年|准=年|传说',
		'/Imi|-2191~|:CE|疑|精=年|准=年|传说',
		'/Elul-dan|-2190~|:CE|疑|精=年|准=年|传说',
		'/Dudu|-2189~|:CE|疑|精=年|准=年|传说',
		'/Shu-Turul|-2168~-2154|:CE|疑|精=年|准=年|传说',

		// The Third Dynasty of Ur, the Neo-Sumerian Empire, 乌尔第三王朝
		'Neo-Sumerian/Ur-Nammu|-2112~|:CE|疑|精=年|准=年|传说|注=Establishes the Third Dynasty of Ur',
		"/Shulgi|-2094~|:CE|疑|精=年|准=年|传说|注=Extends father's empire to all of Assyria",
		'/Amar-Sin|-2046~|:CE|疑|精=年|准=年|传说',
		'/Shu-Sin|-2037~|:CE|疑|精=年|准=年|传说',
		'/Ibbi-Sin|-2028~-2004/12/31|:CE|疑|精=年|准=年|传说',

		// https://en.wikipedia.org/wiki/Timeline_of_the_Assyrian_Empire
		// Old Assyrian Empire, 古亚述时期
		// https://en.wikipedia.org/wiki/Old_Assyrian_Empire
		'Old Assyrian/Erishum II|-1920~-1900/12/31|:CE|疑|精=年|准=年|传说|时期=Assyrian',
		'/Shamshi-Adad I|-1813~|:CE|疑|精=年|准=年|传说|注=Unites all independent Assyrian city-states',
		'/Ishme-Dagan I|-1780~-1741|:CE|疑|精=年|准=年|传说|注=Contemporary with Hammurabi of Babylon',
		//
		'/Ashur-Bel-Nisheshu|-1417~-1409/12/31|:CE|疑|精=年|准=年|传说',

		// Middle Assyrian Empire, 中亚述帝国
		// https://en.wikipedia.org/wiki/Middle_Assyrian_Empire
		'Middle Assyrian/Ashur-Uballit I|-1363~|:CE|疑|精=年|准=年|传说|注=Gains Assyrian Independecne from Mittani|时期=Assyrian',
		'/Enlil-Nirari|-1327~|:CE|疑|精=年|准=年|传说',
		'/Arik-Den-Ili|-1317~|:CE|疑|精=年|准=年|传说',
		'/Adad-Nirari I|-1305~|:CE|疑|精=年|准=年|传说|注=Mittani falls to Assyria',
		'/Shalmaneser I|-1273~|:CE|疑|精=年|准=年|传说|注=Urarti falls to Assyria',
		'/Tukulti-Ninurta I|-1243~|:CE|疑|精=年|准=年|传说|注=Sacks Babylon, killed by his own son',
		'/Ashur-Nadin-Apli|-1206~|:CE|疑|精=年|准=年|传说|注=Assyrin power is weakened',
		'/Ashur-Nirari III|-1202~|:CE|疑|精=年|准=年|传说',
		'/Enlil-Kudurri-Usur|-1196~|:CE|疑|精=年|准=年|传说',
		'/Ninurta-Apal-Ekur|-1191~|:CE|疑|精=年|准=年|传说',
		'/Ashur-Dan I|-1178~|:CE|疑|精=年|准=年|传说|注=Elam captures Babylonia',
		'/Ashur-Resha-Ishi I|-1132~|:CE|疑|精=年|准=年|传说|注=Nebuchadnezzar I of Babylon captures Elam',
		'/Ninurta-Tukulti-Ashur|-1115~-1114|:CE|疑|精=年|准=年|传说',
		'/Mutakkil-Nusku|-1115~|:CE|疑|精=年|准=年|传说',
		'/Tiglath-Pileser I|-1114~-1076|:CE|疑|精=年|准=年|传说|注=In defending Assyria, defeats Nebuchadnezzar',
		// Asharid-Pal-Ekur II: Limited to Nineveh,Irbil, & Ashur province
		'/Ashur-Bel-Kala|-1076~-1057|:CE|疑|精=年|准=年|传说',
		//
		'/Shamshi-Adad IV|-1053~-1049|:CE|疑|精=年|准=年|传说',
		// 5 Unknown Rulers: Reigned 39 years
		'/Ashur-Rabi II|-1010~|:CE|疑|精=年|准=年|传说|注=Isreal & Judah under David & Solomon',
		'/Ashur-Resh-Ishi II|-969~|:CE|疑|精=年|准=年|传说',
		'/Tiglath-Pilasar II|-966~|:CE|疑|精=年|准=年|传说',
		'/Ashur-Dan II|-934~|:CE|疑|精=年|准=年|传说',

		// Neo-Assyrian Empire, 新亚述帝国
		// 亚述人统治巴比伦时期
		// https://en.wikipedia.org/wiki/Neo-Assyrian_Empire
		// https://en.wikipedia.org/wiki/List_of_Assyrian_kings#Neo-Assyrian_Period
		// gettext_config:{"id":"neo-assyrian","mark_type":"part_of_string"}
		'Neo-Assyrian/Adad-nirari II|-911~|:CE|精=年|准=年|时期=Assyrian',
		'/Tukulti-Ninurta II|-891~|:CE|精=年|准=年',
		'/Ashur-nasir-pal II|-883~|:CE|精=年|准=年|ruler=Ashurnasirpal II',
		'/Shalmaneser III|-859~|:CE|精=年|准=年',
		'/Shamshi-Adad V|-824~|:CE|精=年|准=年',
		'/Sammu-ramat|-811~-808|:CE|精=年|准=年|ruler=Shammuramat|君主性别=女',
		'/Adad-nirari III|-811~|:CE|精=年|准=年|ruler=Adad-narari',
		'/Shalmaneser IV|-783~|:CE|精=年|准=年',
		'/Ashur-dan III|-772~|:CE|精=年|准=年',
		'/Ashur-nirari V|-755~|:CE|精=年|准=年',
		'/Tiglath-Pileser III|-745~|:CE|精=年|准=年|ruler=Mukin-zēri',
		'/Shalmaneser V|-727~|:CE|精=年|准=年|ruler=Šulmanu-ašarid',
		'/Marduk-apla-iddina II|-722~-710|:CE|精=年|准=年|ruler=Merodach-Baladan;Marduk-Baladan',
		'/Sargon II|-722~|:CE|精=年|准=年|ruler=Šarru-ukin',
		'/Sennacherib|-705~-681|:CE|精=年|准=年|ruler=Sîn-ahhī-erība',
		'/Marduk-apla-iddina II|-703~|:CE|精=年|准=年',
		'/Bel-ibni|-702~|:CE|精=年|准=年',
		'/Ashur-nadin-shumi|-700~|:CE|精=年|准=年',
		'/Nergal-ushezib|-694~|:CE|精=年|准=年|ruler=Shuzub',
		'/Mushezib-Marduk|-693~-689|:CE|精=年|准=年',
		'/Esarhaddon|-681~|:CE|精=年|准=年|ruler=Aššur-ahu-iddin',
		'/Shamash-shum-ukin|-668~|:CE|精=年|准=年',
		'/Kandalānu|-648~-626/4/4|:CE|精=年|准=年|ruler=Kandalanu|注=Succeeded by Nabopolassar',
		'/Ashurbanipal|-668~-627|:CE|精=年|准=年|ruler=Aššur-bāni-apli',
		'/Ashur-etil-ilani|-631~|:CE|精=年|准=年',
		'/Sin-shumu-lishir|-626~|:CE|精=年|准=年|ruler=Sin-shum-lishir',

		// ------------------------------------------------

		// Urartu (Akkadian Uraštu; Hebrew Ararat; Kingdom of Van; Biainele)
		// 古代美索不达米亚 乌拉尔图
		// https://en.wikipedia.org/wiki/List_of_kings_of_Urartu
		'Urartu/Arame|-858~|:CE|精=年|准=年|ruler=Aramu;Արամե',
		'/Lutipri|-844~|:CE|精=年|准=年',
		'/Sarduri I|-834~|:CE|精=年|准=年|ruler=Սարդուրի Ա;Sarduris I',
		'/Ishpuini|-834~|:CE|精=年|准=年|ruler=Ishpuinis;Išpuine',
		'/Menua|-810~|:CE|精=年|准=年|ruler=Մենուա;Minua',
		'/Argishti I|-785~|:CE|精=年|准=年|ruler=Արգիշտի;Argište I',
		'/Sarduri II|-764~|:CE|精=年|准=年|ruler=Sardure II',
		'/Rusa I|-735~|:CE|精=年|准=年',
		'/Argishti II|-714~|:CE|精=年|准=年|ruler=Արգիշտի;Argište II',
		'/Rusa II|-680~|:CE|精=年|准=年',
		'/Sarduri III|-639~|:CE|精=年|准=年|ruler=Sardure III',
		'/Erimena|-635~|:CE|精=年|准=年',
		'/Rusa III|-629~|:CE|精=年|准=年',
		'/Sarduri IV|-615~|:CE|精=年|准=年|ruler=Sardure IV',
		'/Rusa IV|-590~-585|:CE|精=年|准=年',

		// https://en.wikipedia.org/wiki/Babylonia
		// https://en.wikipedia.org/wiki/List_of_kings_of_Babylon
		// From this point on, the Babylonian chronology is securely known via
		// Ptolemy's Canon of Kings and other sources.
		//
		// https://en.wikipedia.org/wiki/8th_century_BC
		// February 26, 747 BC: Nabonassar becomes king of Babylon.
		// gettext_config:{"id":"babylonian-dynasty-of-e","mark_type":"part_of_string"}
		// gettext_config:{"id":"babylon","mark_type":"part_of_string"}
		'Babylonian Dynasty of E/Nabonassar|-747~|:CE|精=年|准=年|时期=Babylon|ruler=Nabû-nāṣir',
		'/Nabu-nadin-zeri|-734~|:CE|精=年|准=年|ruler=Nabû-nādin-zēri',
		'/Nabu-suma-ukin II|-732~|:CE|精=年|准=年|ruler=Nabû-šuma-ukîn II|注=king of Babylon for one month and two days during 732 BC before he was swept aside by his successor, Nabû-mukin-zēri.',
		'/Nabu-mukin-zeri|-732/2~-729|:CE|精=年|准=年|ruler=Nabû-mukin-zēri',

		// ------------------------------------------------

		// Babylonian Calendar Converter (626 BCE to 75 CE)
		// http://www.staff.science.uu.nl/~gent0113/babylon/babycal_converter.htm
		// https://en.wikipedia.org/wiki/Babylonian_calendar
		'Babylonian|-626/4/5~76/3/24|-626/=3px 3o6 4m7g58r 4g9 4sba5dx 3sfg49m 431 3kk640m 4y3w5n9 4eq 4so65aq 48a 445 3mmu3pp855y 5r7 41ue4gk 5e2 	29;30;29;30;29;30;闰6=28;30;30;30;29;29;30	3mi 4lh23zp 4l0656y 54bw5sh 4a9 3b5847q 46j 3pa445x 5ca 5u1 3zxi59m 3quk4za 4uz 3kcc45x 4nz059g 5sk 4osm59w 4g9o3me 58r 3wsc4g5 5dx 4h0 5e2 4o2e37x83zq 5kb 4kvw4dm 59l 3rcc48c 3a9846t 3pss55y 5r7 3yos4gi 5e2 4h6 3qna571 4kws55j 46d 3z304gk 5aw 57u 4fd24fcs3mi 4zu 51v05u1 	30;29;29;29;30;29;30;30;30;29;29;31	4sra47p 42j 3lx23zp 4y1o5l6 5rd 4oj059m 44a 3l464vh 3m4c46d 5cy 57bg5sy 	29;30;29;29;30;30;29;31;29;29;29;30	4hqe57a 4lf05jv 55h 53sc5r9 47o 4oly3p1 3mi 4lgs579 3wvw4gi 5ea 3sx84a1 3quk4z1 45y 53lo45p 58q 4rpo5ro 50a 3mx24vq 4bjg4yy 5r9 3z304hw 5es 4okc3oq 4m9o40e 4vb 3vl85yd 59h 3quk43e 40t 374m40m 4m7058y 5si 408c5aq 489 3mng4yz 3pa455h 5qi 5d244es 59w 4g9o3ei 4z1 3pb04yy 4ofg5e1 4a0 4pm43px 3oq 4m7w423 4nng58q 5s9 3yr057e 431 3koc4t7 40d 4lek58y 4sp85ec 4a2 3nos505 4yz 3pa44dh 4r4s5ck 5sk 4o643ml 3la 4l0s563 46b 4oeu4h5 3ep8489 3p1 37x842e 58r 3yd84g9 4sh85d6 47q 3mp84v1 4t2 50fg5n9 47m 4oqu5as 4gnw3fu 4fxo577 56t 5s5 3z304h0 4rrw46l 40q 4y4c3zh 562 548c5rd 489 3a9247p 3l2k42z 42d 4nz05cy 5u9 3z8s59m 4g4s566 55n 3p3045x 590 55ek3tg 510 4cba3fa 4f3g56z 479 4sd85e1 49x 39zw431 3kd840m 5kb 3vzw4ei 59l 3qy448a 439 3knq42u 4nzg5r7 4gy 4sp85ea 596 4f58565 3vmk55m 5qt 3yr047t 3p1 380s3mj 	30;30;29;31;29;30;29;29;30;29;30;29	4f2u56y 554c5sh 4h5 3e7g47p 42j 3lx845p 4qxo58q 5sa 3z9o50q 4vu 49yk4vf 45x 4nrq59g 55qk5us 59m 4g643me 563 3pa44dh 4r6k59l 47p 3mp8419 3zq 4lf0577 47d 4pba5ap 3sx84a2 46l 3m584d2 5qr 3ygs4gi 4rpo5dg 50a 4bzw3e5 4yi 50oc5r9 49w 4osm5as 4okc3or 3m5 4noc58m 5s5 3z4s4k9 3q2443a 40r 3jjw40l 56y 55bg5si 4aa 3ns647q 3mng563 45x 4r4s5ci 5ua 4ojw59o 4fdo3li 55n 3pa446h 59l 3r8c489 3pp 31p23o6 4nsc5qj 4g5 4sdo5e1 49h 3pv04vp 3kkc4t2 5l9 3wws47m 59w 4gng50q 4vp 3mmu4yy 54z05s5 4gy 4spo47h 3oa 4lh83zh 4kws562 5rd 3z8s4a1 3q1 38h842z 40l 3yhi58y 56wc5ua 4i2 3quk47q 4yj 3p3045x 4nrw579 47m 4oss59w 50q 4bzg56z 479 4riu5dw 57do49x 3sd 39i440m 5kb 3vzw4dm 4oj059u 47u 4c6k439 40q 4z3g5nn 4gy 4so65ea 3sy459m 4z1 4eos55i 5ql 4nrw4gk 4ot83p1 3fg 4fdo3md 562 550s5s9 4i0 4t5i47p 3a0c46j 45p 4noc5qi 5zd 3z8s59m 4fgs4vu 4t7 3kkc42t 59e 55qk5us 5as 3rd257a 4lf0563 4d1 53rw5np 4gk 4om43p1 378c40q 565 3pss4eq 5e9 3sx84a1 3px 39zq42e 53l85qj 4ga 554c5re 57e 3pv04vq 4bjg4yy 5n9 3z4s4h4 5es 4iho3oq 505 4m6u58m 5bcc5z9 4km 3quk46t 419 3jks3zq 4lek576 5si 3zfw5aq 489 3mwc4yz 46d 4qxi5qq 5d984gk 59m 4g643lm 55p 3pb04ye 4ofg59l 488 4ot83px 3my 4muk58r 4g5 4sdi5s9 3z584gq 46t 3m5o4t7 3zh 4lek56y 4sp85as 48a 3mwc506 4ve 4rl85s5 5cy 4u9y5t0 4okc3ob 3la 4kx855n 45x 4o0s57t 3eb047t 3n9 37x842d 51m 56p861d 4i1 4i3q47p 3pv04yl 45q 53ks5n7 47m 4ojw59w 4g9o3fe 4vp 3pss479 5dx 3z304h0 5ec 4ok63oa 4lh83zh 55y 548c5rd 49l 3a98439 3koc417 42h 4nz04gy 5e9 3tpo4h6 47p 3peu55j 3p304d1 58y 55cs47o 50s 4c7w3ee 4f3g56z 47e 3zx84i1 49v 3a7g431 42e 4ns65qj 3yd84eq 59l 3qy444a 4t9'
				// 月名: https://en.wikipedia.org/wiki/Babylonian_calendar
				// In year 17 of 19-year cycle,
				// the intercalary month was named Araḫ Ulūlu.
				// @see https://en.wikipedia.org/wiki/Iranian_calendars
				+ "|参照用"
				// gettext_config:{"id":"babylonian-calendar","mark_type":"part_of_string"}
				+ "|历法=Babylonian calendar|据=Parker & Dubberstein (1971)|月名=Nisānu;Āru;Simanu;Dumuzu;Abu;Ulūlu;Tišritum;Samna;Kislimu;Ṭebētum;Šabaṭu;Addaru;Makaruša Addari",

		// Median dynasty, Medes, 米底王国
		// https://en.wikipedia.org/wiki/List_of_rulers_of_the_pre-Achaemenid_kingdoms_of_Iran#Median_dynasty,_726%E2%80%93521_BC
		'Median/Deioces|-727~|:CE|疑|精=年|准=年|ruler=Dia—oku;Dēiokēs Δηιόκης|注=可疑',
		'/Xšaθrita I|-675~|:CE|疑|精=年|准=年|ruler=Phraortes;𐎳𐎼𐎺𐎼𐎫𐎡𐏁;Φραόρτης|注=君主姓名可疑',
		'/Madius|-628~|:CE|疑|精=年|准=年|ruler=Madyes;Madya|注=斯基泰人统治时期 Scythian rule',
		'/Cyaxares|-625~|:CE|疑|精=年|准=年|ruler=𐎢𐎺𐎧𐏁𐎫𐎼',
		'/Astyages|-585~-550|:CE|疑|精=年|准=年|ruler=Ἀστυάγης|注=把女儿下嫁给当时隶属于米底的波斯部落的阿契美尼德家族的冈比西斯一世，后来生下王子 Cyrus II；前553年—前550年，Cyrus II 起兵反叛米底，在帕萨尔加德战役打败自己的外公 Astyages，建立阿契美尼德王朝，米底王国结束。',
		'/Cyaxares II|-549~-521/5|:CE|疑|精=年|准=年|注=希腊历史学家色诺芬描述的米底王国君主。没在希罗多德和凯蒂西亚的历史中提到，许多学者怀疑他存在。',

		'Neo-Assyrian/Sin-shar-ishkun|Babylonian-626~|:Babylonian|疑|准=年|ruler=Sinsharishkun',
		'/Ashur-uballit II|Babylonian-612~Babylonian-608|:Babylonian|疑|准=年',

		// Dynasty XI of Babylon (Neo-Babylonian or Chaldean Dynasty)
		// gettext_config:{"id":"neo-babylonian","mark_type":"part_of_string"}
		'Neo-Babylonian/Nabopolassar|Babylonian-626~|:Babylonian|疑|准=年|时期=Babylon|ruler=Nabû-apla-uṣur',
		'/Nebuchadnezzar II|Babylonian-605~|:Babylonian|疑|准=年|ruler=Nabû-kudurri-usur',
		'/Amel-Marduk|Babylonian-562~|:Babylonian|疑|准=年|ruler=Amēl-Marduk',
		'/Neriglissar|Babylonian-560~|:Babylonian|疑|准=年|ruler=Nergal-šar-uṣur',
		'/Labashi-Marduk|Babylonian-556~|:Babylonian|疑|准=年',
		'/Nabonidus|Babylonian-556/4~-539|:Babylonian|疑|准=年|ruler=Nabû-naʾid',
		'/Belshazzar|Babylonian-553~-539|:Babylonian|疑|准=年|ruler=Bēl-šarra-uṣur',

		// Cyrus II: founder of the Achaemenid Empire (𐎱𐎠𐎼𐎿, 阿契美尼德王朝),
		// King of Kings of Persia, Kings of Anshan
		// should use Zoroastrian calendar?
		// @see https://en.wikipedia.org/wiki/Iranian_calendars
		// gettext_config:{"id":"persia","mark_type":"part_of_string"}
		'Persia/Cyrus II|Babylonian-559~|:Babylonian|疑|准=年|ruler=𐎤𐎢𐎽𐎢𐏁;کوروش بزرگ;Kūruš;Cyrus the Great',
		'/Cambyses II|Babylonian-530~|:Babylonian|疑|准=年|ruler=کمبوجيه دوم',
		'/Bardiya|Babylonian-522~|:Babylonian|疑|准=年|ruler=𐎲𐎼𐎮𐎡𐎹;Bardia;Σμέρδις;Smerdis',
		'/Darius I|Babylonian-522/7~|:Babylonian|疑|准=年|ruler=𐎭𐎠𐎼𐎹𐎺𐎢𐏁;𐎭𐎠𐎼𐎹𐎢𐏁;Darius the Great',
		'/Xerxes I|Babylonian-486/8~|:Babylonian|疑|准=年|ruler=Xšaya-ṛšā;𐎧𐏁𐎹𐎠𐎼𐏁𐎠',
		'/Artaxerxes I|Babylonian-465/6~|:Babylonian|疑|准=年|ruler=اردشیر یکم|注=The last inscription mentioning Artaxerxes I being alive can be dated to December 24, 424 BC.',
		'/Xerxes II|-423~-423/2|:Babylonian|疑|准=年|ruler=خشايارشا دوم|注=wiki:阿契美尼德王朝: 在位45天被妃嫔之子暗杀',
		'/Sogdianus|-423~-423/6|:Babylonian|疑|准=年|ruler=سغدیانوس|注=He reigned for six months and fifteen days before being captured by his half-brother, Ochus, who rebelled against him.',
		'/Darius II|-423~|:Babylonian|疑|准=年|ruler=داريوش دوم‎|注=The first inscription of Ochus as Darius II can be dated to January 10, 423 BC.',
		'/Artaxerxes II|Babylonian-404~|:Babylonian|疑|准=年|ruler=𐎠𐎼𐎫𐎧𐏁𐏂𐎠;Artaxerxes II Memnon',
		'/Artaxerxes III|Babylonian-359/12~|:Babylonian|疑|准=年|ruler=اردشير سوم;𐎠𐎼𐎫𐎧𐏁𐏂𐎠;Artaxerxes III Ochus',
		'/Artaxerxes IV|Babylonian-338/8~|:Babylonian|疑|准=年|ruler=اردشيرچهارم‎;Artaxerxes (Artaxšacā) IV Arses;Artaxerxes IV Arses',
		// Babylonian “Astronomical Diary” mentioning a lunar eclipse on 13
		// Ulūlu in the 5th year of Darius III [20 September 331 BCE], ten days
		// before the battle of Gaugamela (British Museum)
		'/Darius III|Babylonian-335~|:Babylonian|疑|准=年|ruler=Artashata;Codomannus',
		'/Bessus|Babylonian:-330~-329/7|:Babylonian|疑|准=年|ruler=Artaxerxes V',

		// https://en.wikipedia.org/wiki/List_of_people_known_as_The_Great
		// Ἀργεάδαι, Argead dynasty
		// gettext_config:{"id":"macedon","mark_type":"part_of_string"}
		'Μακεδονία/Alexander III|Babylonian-336/4~-323/6/10|:Babylonian|疑|准=年|ruler=Ἀλέξανδρος ὁ Μέγας;Alexander the Great|生=-356/7/20 or 21|卒=-323/6/10 or 11',
		'/Philip III|-323/6/11~-317/12/25|:Babylonian|疑|准=年|ruler=Philip III Arrhidaeus;Φίλιππος Γ΄ ὁ Ἀρριδαῖος|卒=-317/12/25|注=reigned as king of Macedonia from after June 11, 323 BC until his death, December 25, 317 BC.',
		'/Alexander IV|Babylonian-323/5~-309|:Babylonian|疑|准=年|ruler=Ἀλέξανδρος Δ΄;Alexander IV Aegus|生=-323/8',

		/**
		 * 塞琉古纪元，是一套塞琉古帝国以及之后受希腊化文明影响的古代国家所采用的纪年方式。
		 * 
		 * The Seleucid era or Anno Graecorum (literally "year of the Greeks" or
		 * "Greek year"), sometimes denoted "AG", was a system of numbering
		 * years in use by the Seleucid Empire and other countries among the
		 * ancient Hellenistic civilizations.
		 * 
		 * The natives of the empire used the Babylonian calendar, in which the
		 * new year falls on 1 Nisanu (3 April in 311 BC)
		 * 
		 * The Macedonian court adopted the Babylonian calendar (substituting
		 * the Macedonian month names ) but reckoned the new year to be in the
		 * autumn (the exact date is unknown).
		 * 
		 * @see https://en.wikipedia.org/wiki/Seleucid_era
		 */
		/**
		 * 古代马其顿历 The Macedonian calendar was in essence the Babylonian calendar
		 * with the substitution of Macedonian names for the Babylonian ones.
		 * 
		 * Under the Seleucid Empire, the Macedonians adopted the Seleucid era.
		 * The year beginning on the 1st of Dios during what we call October 312
		 * BCE was declared to be the year one of the Seleucid era.
		 * 
		 * @see https://en.wikipedia.org/wiki/Ancient_Macedonian_calendar
		 */
		/**
		 * His return to Babylon was afterwards officially regarded as the
		 * beginning of the Seleucid Empire and that year as the first of the
		 * Seleucid era.
		 * 
		 * @see https://en.wikipedia.org/wiki/Seleucus_I_Nicator
		 */
		/**
		 * Hallock (1969, p. 74) maintains that the Old Persian calendar
		 * followed the same system of intercalation as the Babylonian calendar.
		 * Hartner’s interpretation differs: “The Old Persian and the Babylonian
		 * calendars will then have had different systems of intercalation. The
		 * latter we have seen operated with irregular, empirical Ulūlu and
		 * Addāru intercalations down to 527, then passed over to the octaëteris
		 * and finally, when in the 19th year of Darius the beginning of the
		 * year coincided with spring equinox, to the 19-year cycle” (1985, p.
		 * 747).
		 * 
		 * Alex­ander probably used the Macedonian calendar, but the Achaemenid
		 * system seems not to have been abolished. In the time of Seleucus I
		 * (321-281 B.C.) the Babylonian calendar was adopted, but the original
		 * names of the months were replaced by the Macedonian names, in which
		 * Nīsannu corresponded to Artemisios and so on (cf. Bickerman, 1980, p.
		 * 20). The Arsacid kings fol­lowed the same practice, but it appears
		 * from material discovered at Nisa (2nd-1st century B.C.) and Avroman
		 * (1st cent. a.d.) that the Zoroastrian solar calendar (see below) was
		 * also used.
		 * 
		 * @see http://www.iranicaonline.org/articles/calendars
		 */
		'Seleucid era|Babylonian-311~76/3/24|:Babylonian|疑|准=年',
		// Seleucid Empire
		// gettext_config:{"id":"seleucid","mark_type":"part_of_string"}
		'Σελευκιδών/Seleucus I|Babylonian-306~|:Babylonian|疑|准=年|ruler=Seleucus I Nicator;Σέλευκος Α΄ Νικάτωρ',
		// he was assassinated by Ptolemy Keraunos near Lysimachia September
		// (281 BC).
		'/Antiochus I|Babylonian-281/7~|:Babylonian|疑|准=年|ruler=Antiochus I Soter;Ἀντίοχος Α΄ ὁ Σωτήρ',
		// He succeeded his father Antiochus I Soter in the winter of 262–61 BC.
		'/Antiochus II|Babylonian-262/10~|:Babylonian|疑|准=年|ruler=Antiochus II Theos;Ἀντίοχος Β΄ ὁ Θεός',
		'/Seleucus II|Babylonian-246~|:Babylonian|疑|准=年|ruler=Seleucus II Callinicus Pogon;Σέλευκος Β΄ ὁ Καλλίνικος ὁ Πώγων',
		'/Seleucus III|Babylonian-225~|:Babylonian|疑|准=年|ruler=Seleucus III Soter;Seleucus Ceraunus;Σέλευκος Γ΄ ὁ Σωτήρ, ὁ Κεραυνός',
		'/Antiochus III|Babylonian-222~|:Babylonian|疑|准=年|ruler=Ἀντίoχoς Μέγας',
		'/Seleucus IV|Babylonian-187~|:Babylonian|疑|准=年|ruler=Seleucus IV Philopator;Σέλευκος Δ΄ Φιλοπάτωρ',
		'/Antiochus IV|Babylonian-175~|:Babylonian|疑|准=年|ruler=Antiochus IV Epiphanes;Ἀντίοχος Δ΄ ὁ Ἐπιφανής',
		"/Antiochus V|Babylonian-164~|:Babylonian|疑|准=年|ruler=Antiochus V Eupator;Αντίοχος Ε' Ευπάτωρ",
		'/Demetrius I|Babylonian-161~|:Babylonian|疑|准=年|ruler=Demetrius I Soter;Δημήτριος Α`',
		'/Alexander Balas|Babylonian-150~|:Babylonian|疑|准=年|ruler=Ἀλέξανδρoς Bάλας',
		'/Demetrius II|Babylonian-146~-137|:Babylonian|疑|准=年|ruler=Demetrius II Nicator;Δημήτριος Β`',
		'/Antiochus VI|Babylonian-145~|:Babylonian|疑|准=年|ruler=Antiochus VI Dionysus|卒=-142 or -141',
		'/Diodotus Tryphon|Babylonian-142~|:Babylonian|疑|准=年|ruler=Διόδοτος Τρύφων',
		'/Antiochus VII|Babylonian-138~|:Babylonian|疑|准=年|ruler=Antiochus VII Euergetes;Antiochus VII Sidetes',
		'/Demetrius II|Babylonian-129~-126|:Babylonian|疑|准=年',
		'/Alexander II|Babylonian-128~-123|:Babylonian|疑|准=年|ruler=Alexander II Zabinas;Ἀλέξανδρoς Zαβίνας',
		'/Cleopatra Thea|-125~-121|:Babylonian|疑|准=年|ruler=Κλεοπάτρα Θεά',
		'/Antiochus IX|Babylonian-114~|:Babylonian|疑|准=年|ruler=Antiochus IX Cyzicenus;Antiochus IX Eusebes',
		'/Antiochus X|-95~-83|:Babylonian|疑|准=年|ruler=Antiochus X Eusebes Philopator',
		'/Antiochus VIII|-125~|:Babylonian|疑|准=年|ruler=Antiochus VIII Grypus;Antiochus VIII Epiphanes/Callinicus/Philometor',
		'/Seleucus VI|Babylonian-96~|:Babylonian|疑|准=年|ruler=Seleucus VI Epiphanes Nikator;Σέλευκος ΣΤ΄',
		'/Demetrius III|Babylonian-95~-95|:Babylonian|疑|准=年|ruler=Demetrius III Eucaerus',
		'/Philip I|Babylonian-95~-83|:Babylonian|疑|准=年|ruler=Philip I Philadelphus',
		'/Antiochus XI|Babylonian-95~-92|:Babylonian|疑|准=年|ruler=Antiochus XI Epiphanes',
		'/Antiochus XII|-87~|:Babylonian|疑|准=年|ruler=Antiochus XII Dionysus (Epiphanes/Philopator/Callinicus)',
		'/Seleucus VII|Babylonian-83~|:Babylonian|疑|准=年|ruler=Seleucus VII Philometor;Σέλευκος Ζ΄;Tigranes the Great;Tigranes II of Armenia',
		'/Antiochus XIII|Babylonian-69~|:Babylonian|疑|准=年|ruler=Antiochus XIII Philadelphus;Asiaticus',
		'/Philip II|Babylonian-65~-63|:Babylonian|疑|准=年|ruler=Philip II Philorhomaeus;Φίλιππος Β΄ ὁ Φιλορωμαῖος;Barypous',

		// ------------------------------------------------

		// https://en.wikipedia.org/wiki/List_of_rulers_of_Elam
		// Neo-Elamite Period, 新埃兰时期
		// Humban-Tahrid (Neo-Elamite) dynasty
		'Elam/Humban-Tahrah I|-821~|:CE|疑|精=年|准=年|title=king of Elam',
		'/Humban-Nikash I|-743~|:CE|疑|精=年|准=年|title=king of Elam|关系=son of Humban-Tahrah I',
		'/Shutur-Nahhunte II|-717~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son (Ruhushak) of Humban-Nikash I',
		'/Hallushu-Inshushinak|-699~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=brother of Shutur-Nahhunte II',
		'/Kutir-Nahhunte III|-693/10~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Hallushu-Inshushinak',
		'/Humban-Numena III|-692/7~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Hallushu-Inshushinak',
		'/Humban-Haltash I|-688/2~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Humban-Numena III (?)',
		'/Humban-Haltash II|-681/10~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Humban-Haltash I',
		'/Urtak|-675/9~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=brother of Humban-Haltash II',
		'/Teumman|-663~|:CE|疑|精=年|准=年|title=king of Anshan & Susa',
		'/Humban-Nikash II|-653/9~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Urtak',
		'/Tammaritu II|-652~|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Humban-Hapua son of Urtak',
		'/Indabibi|-649~|:CE|疑|精=年|准=年|title=king of Anshan & Susa',
		'/Humban-Haltash III|-648/7~-644|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Atta-hamiti-Inshushinak',
		'/Tammaritu II|-647~-647|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Humban-Hapua son of Urtak',
		'/Humban-Nikash III|-647~-647|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Atta-Merra-Halki',
		'/Umhuluma|-647~-647|:CE|疑|精=年|准=年|title=king of Anshan & Susa',
		'/Indattu-Inshushinak IV|-647~-646/10|:CE|疑|精=年|准=年|title=king of Anshan & Susa',
		'/Humban-Hapua|-647~-647|:CE|疑|精=年|准=年|title=king of Anshan & Susa',
		"/Pa'e|-646/8~-644|:CE|疑|精=年|准=年|title=king of Anshan & Susa",
		'/Shutur-Nahhunte III|-646/8~-600/12|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Indattu-Inshushinak IV',
		'/Açina|-522/10~|:CE|疑|精=年|准=年|title=king of Elam|关系=son of Upadrama',
		'/Ummanunu II|-522/12/10~|:CE|疑|精=年|准=年|title=king of Elam|注=Ummanunu II or Humban-Nikash IV (Ummaniš)',
		'/Atta-hamiti-Inshushinak|-521/2~-519|:CE|疑|精=年|准=年|title=king of Anshan & Susa|关系=son of Hutran-Temti',

]).minute_offset = 3 * 60;

// ---------------------------------------------------------------------//
// Ancient Greece 古希腊
// https://en.wikipedia.org/wiki/Lists_of_rulers_of_Greece

// gettext_config:{"id":"greece"}
(CeL.era.pass_on.countries["Greece"] = [

		// Ancient Greek: Athens
		// https://en.wikipedia.org/wiki/List_of_kings_of_Athens

		// Erechtheid dynasty
		// gettext_config:{"id":"classical-athens","mark_type":"part_of_string"}
		'Erechtheid/Cecrops I|-1556~|:CE|传说|精=年|准=年|时期=Ἀθῆναι',
		'/Cranaus|-1506~|:CE|传说|精=年|准=年',
		'/Amphictyon|-1497~|:CE|传说|精=年|准=年',
		'/Erichthonius|-1487~|:CE|传说|精=年|准=年',
		'/Pandion I|-1437~|:CE|传说|精=年|准=年',
		'/Erechtheus|-1397~|:CE|传说|精=年|准=年',
		"/Cecrops II|-1347~|:CE|传说|精=年|准=年|注=Omitted in Heraclides' epitome of Aristotle's Constitution of the Athenians",
		'/Pandion II|-1307~|:CE|传说|精=年|准=年',
		'/Aegeus|-1282~|:CE|传说|精=年|准=年|注=Construction of Trojan Walls by Poseidon, Apollo and the mortal Aeacus (c. 1282 BC)',
		'/Theseus|-1234~|:CE|传说|精=年|准=年',
		'/Menestheus|-1205~|:CE|传说|精=年|准=年|注=Trojan War and the Sack of Troy (c. 1183 BC)',
		'/Demophon|-1183~|:CE|传说|精=年|准=年',
		'/Oxyntes|-1150~|:CE|传说|精=年|准=年',
		'/Apheidas|-1136~|:CE|传说|精=年|准=年',
		'/Thymoetes|-1135~-1127|:CE|传说|精=年|准=年',

		// Melanthid dynasty
		'Melanthid/Melanthus|-1126~|:CE|传说|精=年|准=年|时期=Ἀθῆναι',
		'/Codrus|-1089~-1068|:CE|传说|精=年|准=年',

		// ------------------------------------------------

		// Ancient Greek: Sparta
		// https://en.wikipedia.org/wiki/List_of_kings_of_Sparta
		// Agiad dynasty
		// gettext_config:{"id":"sparta","mark_type":"part_of_string"}
		'Agiad/Eurysthenes|-930~|:CE|传说|精=年|准=年|时期=Σπάρτη|注=Return of the Heracleidae',
		'/Agis I|-930~|:CE|传说|精=年|准=年|注=Subjugated the Helots',
		'/Echestratus|-900~|:CE|传说|精=年|准=年|注=Expelled the Cynurensians[n 4] that were in power.',
		'/Labotas[n 5]|-870~|:CE|传说|精=年|准=年',
		'/Doryssus|-840~|:CE|传说|精=年|准=年',
		'/Agesilaus I|-820~|:CE|传说|精=年|准=年',
		'/Archelaus|-790~|:CE|传说|精=年|准=年',
		'/Teleclus|-760~|:CE|传说|精=年|准=年|注=Killed by the Messenians',
		'/Alcamenes|-758~|:CE|传说|精=年|准=年|注=First Messenian War begins',
		'/Polydorus|-741~|:CE|传说|精=年|准=年|注=Second Messenian War begins; Killed by Athenian Archon Polemarchus[5]',
		'/Eurycrates|-665~|:CE|传说|精=年|准=年',
		'/Anaxander|-640~|:CE|传说|精=年|准=年',
		'/Eurycratides|-615~|:CE|传说|精=年|准=年',
		'/Leon|-590~|:CE|传说|精=年|准=年',
		'/Anaxandridas II|-560~|:CE|传说|精=年|准=年|注=Battle of the Fetters',
		'/Cleomenes I|-520~|:CE|传说|精=年|准=年|注=Greco-Persian Wars begins',
		'/Leonidas I|-490~|:CE|传说|精=年|准=年|注=Battle of Thermopylae',
		'/Pleistarchus|-480~|:CE|传说|精=年|准=年|注=First Peloponnesian War begins',
		'/Pleistoanax|-459~|:CE|传说|精=年|准=年|注=Second Peloponnesian War begins',
		'/Pausanias|-409~|:CE|传说|精=年|准=年|注=Helped restore democracy in Athens; Spartan hegemony',
		'/Agesipolis I|-395~|:CE|传说|精=年|准=年|注=Corinthian War begins',
		'/Cleombrotus I|-380~|:CE|传说|精=年|准=年',
		'/Agesipolis II[n 6]|-371~|:CE|传说|精=年|准=年',
		'/Cleomenes II|-369~|:CE|传说|精=年|准=年|注=Third Sacred War begins',
		'/Areus I|-309~|:CE|传说|精=年|准=年|注=Killed in battle against Aristodemus, the tyrant of Megalopolis',
		'/Acrotatus II|-265~|:CE|传说|精=年|准=年',
		'/Areus II[6]|-262~|:CE|传说|精=年|准=年',
		'/Leonidas II|-254~|:CE|传说|精=年|准=年|注=Briefly deposed while in exile avoiding trial',
		'/Cleombrotus II|-242~|:CE|传说|精=年|准=年',
		'/Leonidas II|-241~|:CE|传说|精=年|准=年',
		'/Cleomenes III|-235~-222|:CE|传说|精=年|准=年',

		// Eurypontid dynasty
		'Eurypontid/Procles|-930~|:CE|传说|精=年|准=年|时期=Σπάρτη|注=Return of the Heracleidae',
		'/Soos[n 7][7]|-890~|:CE|传说|精=年|准=年|注=Son of Procles and father of Eurypon.',
		'/Eurypon|-890~|:CE|传说|精=年|准=年',
		'/Prytanis|-860~|:CE|传说|精=年|准=年',
		'/Polydectes|-830~|:CE|传说|精=年|准=年',
		'/Eunomus|-800~|:CE|传说|精=年|准=年',
		'/Charilaus|-780~|:CE|传说|精=年|准=年|注=Ward, pupil, and nephew of the Spartan reformer Lycurgus; War with the Argives and destroyed the border-town of Aegys; Battle of Tegea.',
		'/Nicander|-750~|:CE|传说|精=年|准=年|注=First Messenian War begins.',
		'/Theopompus|-725~|:CE|传说|精=年|准=年|注=Second Messenian War begins.',
		// Currently known two lists of kings
		'/Anaxandridas I|-675~|:CE|传说|精=年|准=年',
		'/Zeuxidamus|-645~|:CE|传说|精=年|准=年',
		'/Anaxidamus|-625~|:CE|传说|精=年|准=年',
		'/Archidamus I|-600~|:CE|传说|精=年|准=年',
		'/Agasicles|-575~|:CE|传说|精=年|准=年|注=Contemporary with Leonidas I; End of the Messenian Wars.',
		// ↑ Currently known two lists of kings
		'/Ariston|-550~|:CE|传说|精=年|准=年|注=Battle of the Fetters.',
		'/Demaratus|-515~|:CE|传说|精=年|准=年|注=Greco-Persian Wars begins.',
		'/Leotychidas|-491~|:CE|传说|精=年|准=年',
		'/Archidamus II|-469~|:CE|传说|精=年|准=年|注=First Peloponnesian War; Second Peloponnesian War begins',
		'/Agis II|-427~|:CE|传说|精=年|准=年|注=Spartan hegemony; Attacked Epidaurus, Leuctra,[n 9] Caryao, Orchomenos, and Mantinela; Invaded the Argolis; Council of war[n 10] formed to check his powers.',
		'/Agesilaus II|-401~|:CE|传说|精=年|准=年|注=Corinthian War begins',
		'/Archidamus III|-360~|:CE|传说|精=年|准=年|注=Third Sacred War begins',
		'/Agis III|-338~|:CE|传说|精=年|准=年',
		'/Eudamidas I|-331~|:CE|传说|精=年|准=年',
		'/Archidamus IV|-305~|:CE|传说|精=年|准=年',
		'/Eudamidas II|-275~|:CE|传说|精=年|准=年',
		'/Agis IV|-245~|:CE|传说|精=年|准=年',
		'/Eudamidas III|-241~|:CE|传说|精=年|准=年',
		'/Archidamus V|-228~|:CE|传说|精=年|准=年',
		'/Eucleidas|-227~-221|:CE|传说|精=年|准=年|注=Actually an Agiad; installed by Cleomenes III[n 11] in place of Archidamus V.',

		// Republic monarchy
		// Sparta was a republic from 221 to 219 BC.
		// The dual monarchy was restored in 219 BC.
		'Republic Sparta/Agesipolis III|-219~-215|:CE|传说|精=年|准=年|时期=Σπάρτη|注=last Agiad, deposed by Lycurgus',
		'/Lycurgus|-219~|:CE|传说|精=年|准=年',
		'/Pelops|-210~-206|:CE|传说|精=年|准=年|注=son of Lycurgus and last king from either of the old dynasties',

		// Tyrants
		'Tyrants Sparta/Machanidas|-210~-207|:CE|传说|精=年|准=年|时期=Σπάρτη|注=regent for Pelops',
		'/Nabis|-206~|:CE|传说|精=年|准=年|注=first regent for Pelops, then usurper, claiming descent from the Eurypontid king Demaratus',
		'/Laconicus|-192~-192|:CE|传说|精=年|准=年|注=last known king of Sparta from Heraclid dynasty',
// The Achaean League annexed Sparta in 192 BC.

// ------------------------------------------------

]).minute_offset = 3 * 60;

// ---------------------------------------------------------------------//
// Egypt 古埃及
// https://en.wikipedia.org/wiki/Ancient_Egypt
// https://en.wikipedia.org/wiki/List_of_ancient_Egyptian_dynasties
// https://en.wikipedia.org/wiki/Egyptian_chronology
// https://en.wikipedia.org/wiki/List_of_pharaohs

/**
 * A Chronological Survey of Precisely Dated Demotic and Abnormal Hieratic
 * Sources, Version 1.0 (February 2007)
 * 
 * @see http://www.trismegistos.org/top.php
 */

// gettext_config:{"id":"egypt"}
(CeL.era.pass_on.countries["Egypt"] = [

		// Joann Fletcher. (2016).
		// The Story of Egypt: The Civilization that Shaped the World
		// (Pegasus Books)

		// 1st Dynasty
		'Dynasty I/Narmer|-3100~|:CE|疑|精=年|准=年|时期=Early Dynastic',
		'/Aha|-3085~|:CE|疑|精=年|准=年',
		'/Djer|-3040~|:CE|疑|精=年|准=年',
		'/Djet|-2990~|:CE|疑|精=年|准=年',
		'/Merneith|-2965~|:CE|疑|精=年|准=年',
		'/Den|-2960~|:CE|疑|精=年|准=年',
		'/Anedjib|-2925~|:CE|疑|精=年|准=年',
		'/Semerkhet|-2900~|:CE|疑|精=年|准=年',
		'/Qaa|-2890~|:CE|疑|精=年|准=年',

		// 2nd Dynasty
		'Dynasty II/Hetepsekhemwy|-2890~|:CE|疑|精=年|准=年|时期=Early Dynastic',
		'/Nebra|-2865~|:CE|疑|精=年|准=年',
		'/Peribsen|-2700~|:CE|疑|精=年|准=年',
		'/Khasekhemwy|-2686~|:CE|疑|精=年|准=年',

		// 3rd Dynasty
		'Dynasty III/Nebka|-2686~|:CE|疑|精=年|准=年|时期=Old Kingdom',
		'/Djoser|-2667~|:CE|疑|精=年|准=年',
		'/Sekhemkhet|-2648~|:CE|疑|精=年|准=年',
		'/Khaba|-2640~|:CE|疑|精=年|准=年',
		'/Huni|-2637~|:CE|疑|精=年|准=年',

		// 4th Dynasty
		'Dynasty IV/Snefru|-2613~|:CE|疑|精=年|准=年|时期=Old Kingdom',
		'/Khufu|-2589~|:CE|疑|精=年|准=年',
		'/Djedefra|-2566~|:CE|疑|精=年|准=年',
		'/Khafra|-2558~|:CE|疑|精=年|准=年',
		'/Menkaura|-2532~|:CE|疑|精=年|准=年',
		'/Khentkawes I|-2503~|:CE|疑|精=年|准=年',
		'/Shepseskaf|-2503~-2498|:CE|疑|精=年|准=年',

		// 5th Dynasty
		'Dynasty V/Userkaf|-2494~|:CE|疑|精=年|准=年|时期=Old Kingdom',
		'/Sahura|-2487~|:CE|疑|精=年|准=年',
		'/Neferirkara|-2475~|:CE|疑|精=年|准=年',
		'/Khentkawes II|-2455~|:CE|疑|精=年|准=年',
		'/Shepseskara|-2455~|:CE|疑|精=年|准=年',
		'/Raneferef|-2448~|:CE|疑|精=年|准=年',
		'/Niuserra|-2445~|:CE|疑|精=年|准=年',
		'/Menkauhor|-2421~|:CE|疑|精=年|准=年',
		'/Djedkara|-2414~|:CE|疑|精=年|准=年',
		'/Unas|-2375~|:CE|疑|精=年|准=年',

		// 6th Dynasty
		'Dynasty VI/Teti|-2345~|:CE|疑|精=年|准=年|时期=Old Kingdom',
		'/Userkara|-2323~|:CE|疑|精=年|准=年',
		'/Pepi I|-2321~|:CE|疑|精=年|准=年',
		'/Merenra|-2287~|:CE|疑|精=年|准=年',
		'/Pepy II|-2278~|:CE|疑|精=年|准=年',
		'/Nerntyemsaf|-2184~|:CE|疑|精=年|准=年',
		'/Neitikrety|-2184~-2181|:CE|疑|精=年|准=年|君主性别=女',

		// 11th Dynasty (Thebes)
		'Dynasty XI/Intef I|-2125~|:CE|疑|精=年|准=年|时期=First Intermediate',
		'/Intef II|-2112~|:CE|疑|精=年|准=年',
		'/Intef III|-2063~|:CE|疑|精=年|准=年',
		// 11th Dynasty (all Egypt)
		'/Montuhotep II|-2055~|:CE|疑|精=年|准=年',
		'/Sankhkara|-2004~|:CE|疑|精=年|准=年|ruler=Montuhotep III',
		'/Montuhotep IV|-1992~|:CE|疑|精=年|准=年',

		// 12th Dynasty
		'Dynasty XII/Amenemhat I|-1985~-1955|:CE|疑|精=年|准=年|时期=Middle Kingdom',
		'/Sesostris I|-1965~-1921|:CE|疑|精=年|准=年',
		'/Amenemhat II|-1922~-1878|:CE|疑|精=年|准=年',
		'/Sesostris II|-1880~|:CE|疑|精=年|准=年',
		'/Sesostris III|-1874~|:CE|疑|精=年|准=年',
		'/Amenemhat III|-1855~|:CE|疑|精=年|准=年',
		'/Amenemhat IV|-1808~|:CE|疑|精=年|准=年',
		'/Sobeknefru|-1799~-1795|:CE|疑|精=年|准=年|君主性别=女',

		// 17th Dynasty
		'Dynasty XVII/Sobekemsaf|-1570~|:CE|疑|精=年|准=年|时期=Second Intermediate',
		// Intef VI
		// Tao I
		'/Seqenra|-1560~|:CE|疑|精=年|准=年|ruler=Tao II',
		'/Kamose|-1555~|:CE|疑|精=年|准=年',

		// 18th Dynasty
		'Dynasty XVIII/Ahmose I|-1550~|:CE|疑|精=年|准=年|时期=New Kingdom',
		'/Amenhotep I|-1525~|:CE|疑|精=年|准=年',
		'/Tuthmosis I|-1504~|:CE|疑|精=年|准=年',
		'/Tuthmosis II|-1492~|:CE|疑|精=年|准=年',
		'/Tuthmosis III|-1479~-1425|:CE|疑|精=年|准=年',
		'/Hatshepsut|-1473~-1458|:CE|疑|精=年|准=年|君主性别=女',
		'/Amenhotep II|-1427~|:CE|疑|精=年|准=年',
		'/Tuthmosis IV|-1400~|:CE|疑|精=年|准=年',
		'/Amenhotep III|-1390~|:CE|疑|精=年|准=年',
		'/Amenhotep IV|-1352~-1336|:CE|疑|精=年|准=年|君主=Akhenaten',
		'/Smenkhkara|-1338~|:CE|疑|精=年|准=年|君主=Nefernefruaten;Neferneferuaten;Nefertiti|君主性别=女|注=由于斯门卡瑞在位时候短，又正好接续在阿肯那顿之后，因此有些考古学家认为斯门卡瑞就是阿肯那顿的皇后娜芙蒂蒂，因为娜芙蒂蒂的名字几乎是在同一时期在埃及史上消失，考古学家认为可能是她改了名字当上法老。',
		'/Tutankhamen|-1336~|:CE|疑|精=年|准=年',
		'/Ay|-1327~|:CE|疑|精=年|准=年',
		'/Horemheb|-1323~|:CE|疑|精=年|准=年',

		// 19th Dynasty
		'Dynasty XIX/Ramses I|-1295~|:CE|疑|精=年|准=年|时期=New Kingdom',
		'/Seti I|-1294~|:CE|疑|精=年|准=年',
		'/Ramses II|-1279~|:CE|疑|精=年|准=年',
		'/Merenptah|-1213~|:CE|疑|精=年|准=年',
		'/Amenmesse|-1203~|:CE|疑|精=年|准=年',
		'/Seti II|-1200~|:CE|疑|精=年|准=年',
		'/Siptah|-1194~|:CE|疑|精=年|准=年',
		'/Tawosret|-1188~|:CE|疑|精=年|准=年|君主性别=女',

		// 20th Dynasty
		'Dynasty XX/Sethnakht|-1186~|:CE|疑|精=年|准=年|时期=New Kingdom',
		'/Ramses III|-1184~|:CE|疑|精=年|准=年',
		'/Ramses IV|-1153~|:CE|疑|精=年|准=年',
		'/Ramses V|-1147~|:CE|疑|精=年|准=年',
		'/Ramses VI|-1143~|:CE|疑|精=年|准=年',
		'/Ramses VII|-1136~|:CE|疑|精=年|准=年',
		'/Ramses VIII|-1129~|:CE|疑|精=年|准=年',
		'/Ramses IX|-1126~|:CE|疑|精=年|准=年',
		'/Ramses X|-1108~|:CE|疑|精=年|准=年',
		'/Ramses XI|-1099~|:CE|疑|精=年|准=年',

		// 21st Dynasty (Tanis)
		'Dynasty XXI/Smendes|-1069~|:CE|疑|精=年|准=年|时期=Third Intermediate',
		'/Amenemnisu|-1043~|:CE|疑|精=年|准=年',
		'/Psusennes I|-1039~-991|:CE|疑|精=年|准=年',
		'/Amenemope|-993~|:CE|疑|精=年|准=年',
		'/Osorkon the Elder|-984~|:CE|疑|精=年|准=年',
		'/Siamen|-978~|:CE|疑|精=年|准=年',
		'/Psusennes II|-959~|:CE|疑|精=年|准=年',

		// 22nd Dynasty (Bubastite/Libyan)
		'Dynasty XXII/Sheshonq I|-945~|:CE|疑|精=年|准=年|时期=Third Intermediate',
		'/Osorkon I|-924~-889|:CE|疑|精=年|准=年',
		'/Sheshonq II|-890~|:CE|疑|精=年|准=年',
		'/Takeloth I|-889~|:CE|疑|精=年|准=年',
		'/Osorkon II|-874~|:CE|疑|精=年|准=年',
		'/Takelot III|-850~|:CE|疑|精=年|准=年',
		'/Sheshonq III|-825~|:CE|疑|精=年|准=年',
		'/Pimay|-773~|:CE|疑|精=年|准=年',
		'/Sheshonq V|-767~|:CE|疑|精=年|准=年',
		'/Osorkon IV|-730~-715|:CE|疑|精=年|准=年',

		// 23rd Dynasty (Tanite/Libyan)
		'Dynasty XXIII/Pedubastis I|-818~-793|:CE|疑|精=年|准=年|时期=Third Intermediate',
		'/Sheshonq IV|-780~|:CE|疑|精=年|准=年',
		'/Osorkon III|-777~-749|:CE|疑|精=年|准=年',

		// 24th Dynasty
		'Dynasty XXIV/Bakenrenef|-727~-715|:CE|疑|精=年|准=年|时期=Third Intermediate',

		/**
		 * <code>

		'25th Dynasty (Kushite)/Piye|-747~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Shabaqa|-716~|:CE|疑|精=年|准=年',
		'/Shabitqa|-702~|:CE|疑|精=年|准=年',
		'/Taharqa|-690~|:CE|疑|精=年|准=年',
		'/Tantamen|-664~-656|:CE|疑|精=年|准=年',

		'26th Dynasty (Saite)/Necho I|-672~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Psammetichus I|-664~|:CE|疑|精=年|准=年',
		'/Necho II|-610~|:CE|疑|精=年|准=年',
		'/Psammetichus II|-595~|:CE|疑|精=年|准=年',
		'/Apries|-589~|:CE|疑|精=年|准=年',
		'/Ahmose II|-570~|:CE|疑|精=年|准=年',
		'/Psammetichus III|-526~|:CE|疑|精=年|准=年',

		'27th Dynasty (First Persian Period)/Cambyses|-525~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Darius I|-522~|:CE|疑|精=年|准=年',
		'/Xerxes I|-486~|:CE|疑|精=年|准=年',
		'/Artaxerxes I|-465~|:CE|疑|精=年|准=年',
		'/Darius II|-424~|:CE|疑|精=年|准=年',
		'/Artaxerxes II|-405~-359|:CE|疑|精=年|准=年',

		'28th Dynasty/Amyrtaios|-404~|:CE|疑|精=年|准=年|时期=Late Period',

		'29th Dynasty/Nepherites I|-399~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Hakor|-393~|:CE|疑|精=年|准=年',
		'/Nepherites II|-380~|:CE|疑|精=年|准=年',

		'30th Dynasty/Nectanebo I|-380~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Teos|-362~|:CE|疑|精=年|准=年',
		'/Nectanebo II|-360~|:CE|疑|精=年|准=年',

		'Second Persian Period/Artaxerxes III|-343~|:CE|疑|精=年|准=年|时期=Late Period',
		'/Arses|-338~|:CE|疑|精=年|准=年',
		'/Darius III|-336~|:CE|疑|精=年|准=年',

		'Macedonian Dynasty/Alexander the Great|-332~|:CE|疑|精=年|准=年|时期=Ptolemaic Period',
		'/Philip Arrhidaios|-323~-317|:CE|疑|精=年|准=年',
		'/Alexander IV|-323~-310|:CE|疑|精=年|准=年',

		'Ptolemaic Dynasty/Ptolemy I|-305~-282|:CE|疑|精=年|准=年|时期=Ptolemaic Period|注=共治者:王后 Berenike I;Berenice I of Egypt',
		'/Ptolemy II|-285~-246|:CE|疑|精=年|准=年|注=共治者:王后 Arsinoe I',
		'/Arsinoe II|-275~-268|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy III|-246~-222|:CE|疑|精=年|准=年',
		'/Berenike II|-246~|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy IV|-221~|:CE|疑|精=年|准=年|注=共治者:王后 Arsinoe III',
		'/Ptolemy V|-205~-180|:CE|疑|精=年|准=年',
		'/Kleopatra I|-194~-176|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy VI|-180~-145|:CE|疑|精=年|准=年',
		'/Kleopatra II|-176~-116|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy VII|-145~|:CE|疑|精=年|准=年',
		'/Ptolemy VIII|-145~-116|:CE|疑|精=年|准=年',
		'/Kleopatra III|-142~-101|:CE|疑|精=年|准=年|君主性别=女|注=共治者: Kleopatra IV (-116 to -115: Kleopatra III に追放され)',
		'/Ptolemy IX|-116~|:CE|疑|精=年|准=年',
		'/Ptolemy X|-107~-88|:CE|疑|精=年|准=年',
		'/Berenike III|-101~-80|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy IX|-88~|:CE|疑|精=年|准=年',
		'/Ptolemy XI|-80~|:CE|疑|精=年|准=年',
		'/Ptolemy XII (Auletes)|-80~|:CE|疑|精=年|准=年',
		'/Kleopatra V|-58~-57|:CE|疑|精=年|准=年|君主性别=女|注=可能和 Kleopatra VI 是同一人。',
		'/Berenike IV|-58~|:CE|疑|精=年|准=年|君主性别=女|注=共治者: Kleopatra VI',
		'/Ptolemy XII (Auletes)|-55~|:CE|疑|精=年|准=年',
		'/Kleopatra VII|-51~-30|:CE|疑|精=年|准=年|君主性别=女',
		'/Ptolemy XIII|-51~|:CE|疑|精=年|准=年|注=共治者: 王后 Kleopatra VII|注=与 Arsinoe IV 相争',
		'/Ptolemy XIV|-47~|:CE|疑|精=年|准=年',
		'/Ptolemy XV (Caesarion)|-44~-30|:CE|疑|精=年|准=年',

		 */

		// ----------------------------------//
		(function() {
			// Egyptian year (has year 0) = -26
			var epochal_year = CeL.Egyptian_Date.reform_epochal_year - 1,
			// assert: start_year < epochal_year < 0
			// -746/2/26
			start_year = -747,
			// assert: end_year > epochal_year
			end_year = 306,
			//
			month_days = CeL.Egyptian_Date.month_days.join(';'),
			//
			circle_month_days = new Array(3).fill(month_days);
			circle_month_days.push(CeL.Egyptian_Date.leap_month_days.join(';'));
			month_days = new Array(epochal_year - start_year + 1)
					.fill(month_days);
			Array.prototype.push.apply(month_days, new Array(Math
					.ceil((end_year - epochal_year) / 4))
					.fill(circle_month_days.join('	')));

			return [ 'Egyptian', [ String(start_year).to_Date('Egyptian'),
			// +1: period_end
			String(end_year + 1).to_Date('Egyptian') ],
			//
			start_year + '/=' + month_days.join('	'), '参照用',
			// Egyptian calendar
			'历法=Egyptian',
			//
			'月名=' + CeL.Egyptian_Date.month_name.Greek.slice(1).join(';') ];
		})(),

		// https://en.wikipedia.org/wiki/Twenty-fifth_Dynasty_of_Egypt
		// Year 21 of Piye (Piankhi)
		// BC 726 Feb 21 – 725 Feb 20
		//
		// http://www.trismegistos.org/daht/detail.php?tm=46106
		// BC 726 Mar 30 (Piye (Pianchi), year 21, Phaophi 08)
		'Egypt Dynasty XXV/Piye|Egyptian-747~|:Egyptian|疑|准=年|时期=Third Intermediate|ruler=Pianchi',
		// http://www.trismegistos.org/text/46121
		// BC 703 May 10 ((Shabaka), year 13, Hathyr 25)
		'/Shabaka|Egyptian-716~|:Egyptian|疑|准=年',
		'/Shebitku|Egyptian-702~|:Egyptian|疑|准=年',
		// BC 665 Sep 16 ((Taharqa), year 26, Pharmouthi 14)
		'/Taharqa|Egyptian-691~|:Egyptian|疑|准=年',
		'/Tantamani|Egyptian:-665~-656|:Egyptian|疑|准=年',

		// BC 660 Jan 12 ([Psammetichus 1], year 04, Mesore 13)
		'Egypt Dynasty XXVI/Psammetichus I|Egyptian-665~|:Egyptian|疑|准=年|时期=Late Period|ruler=Psamtik I',
		'/Necho II|Egyptian-611~|:Egyptian|疑|准=年',
		'/Psammetichus II|Egyptian-596~|:Egyptian|疑|准=年',
		'/Apries|Egyptian:-590~|:Egyptian|疑|准=年',
		// 若以下两笔纪录皆为真，可推测 Apries 死于 20年中，或许是 Payni 10 之后。
		// 而 Amasis II 于年中登基，并称元年。
		// BC 570 Oct 19 (Apries, year 20, Pauni 10) Type: contract loan (money)
		// BC 569 Feb 12 - Mar 12 (Amasis, year 02, Phaophi)
		'/Amasis II|Egyptian-571/11~|:Egyptian|疑|准=年',
		'/Psamtik III|Egyptian:-527~-526/5|:Egyptian|疑|准=年|注=Psamtik III was defeated by Cambyses II of Persia in the battle of Pelusium in the eastern Nile delta in May 525 BCE.',

		// modified form Achaemenid Empire listed above.
		'First Achaemenid Period/Cambyses II|Egyptian:-530~-523/9|:Egyptian|疑|准=年|朝代=Egypt Dynasty XXVII;First Egyptian Satrapy|时期=Late Period',
		'/Seheruibre Padibastet|Egyptian:-523~-520|:Egyptian|疑|准=年|ruler=Petubastis III|注=There also exists a document that has been dated to 522 BCE, which was the first year of his reign.|注=Certainly Egypt was pacified by 518 BCE when Darius arrived and authorised the codification of local Egyptian laws.',
		// TM 48872: BC 519 Jan 30 - Feb 28? (Darius 1, year 03, Phaophi?)
		'/Darius I|Egyptian-522~|:Egyptian|疑|准=年',
		// TM 46738: BC 486 Jun 7 ((Darius 1), year 36, Mecheir 17)
		// TM 46432: BC 485 Feb 21 - Mar 21 (Psammetichus 4, year 02, Hathyr)
		// TM 46431: BC 485 Mar 22 - Apr 20 (Psammetichus 4, year 02, Choiak)
		// TM 46428: BC 485 Apr 21 - May 20 (Psammetichus 4, year 02, Tybi)
		'/Psammetichus IV|Egyptian-487/7~|:Egyptian|疑|准=年|注=proposed ancient Egyptian ruler',
		'/Xerxes I|Egyptian-486/6~|:Egyptian|疑|准=年',
		// TM 81436: BC 443 Nov 7 - Dec 6 (Artaxerxes 1, year 22, Mesore)
		'/Artaxerxes I|Egyptian-465~|:Egyptian|疑|准=年',
		// TM 81485: BC 422 Jun 5 - Jul 4 (Darius 2, year 02, Phamenoth)
		'/Darius II|Egyptian-424/2~|:Egyptian|疑|准=年',
		'/Artaxerxes II|Egyptian:-405/6~-402|:Egyptian|疑|准=年',

		'Egypt Dynasty XXVIII/Amyrtaeus|Egyptian-405/2~|:Egyptian|疑|准=年|时期=Late Period|ruler=Amenirdisu',

		'Egypt Dynasty XXIV/Nepherites I|Egyptian-400/12~|:Egyptian|疑|准=年|时期=Late Period',
		// TM 81525: BC 393 Mar 29 - Apr 27? (Nepherites 1, year 07, Tybi?)
		// TM 54648: BC 394 Nov 30 - 393 Nov 28 (Hakoris, year 01)
		'/Hakor/first reign|Egyptian-394/6~|:Egyptian|疑|准=年|ruler=Hagar;Achoris;Hakoris;Akoris',
		// TM 51551: BC 388 Jun 26 - Jul 25 (Psammuthis, year 01, Pharmouthi)
		'/Psammuthes/|Egyptian-389~|:Egyptian|疑|准=年|ruler=Psammuthis',
		'/Hakor/second reign|Egyptian-388~|:Egyptian|疑|准=年',
		'/Nepherities II/|Egyptian-382/9~|:Egyptian|疑|准=年|ruler=Nefaarud II|注=He was deposed and likely killed by Nectanebo I after ruling Egypt for only 4 months.',

		// TM 46406: BC 380 Jun 23? (Nectanebo 1, year 01, Phamenoth 30)
		'Egypt Dynasty XXX/Nectanebo I|Egyptian-381~|:Egyptian|疑|准=年|ruler=Kheperkare Nakhtnebef|时期=Late Period',
		'/Teos|Egyptian-365~|:Egyptian|疑|准=年|ruler=Τέως;Tachos;Τάχως;Djedhor;Irmaatenre',
		'/Nectanebo II|Egyptian-361~-344|:Egyptian|疑|准=年|ruler=Senedjemibra Setepeninhur;Nakhthorheb;Nektanebo II',

		'Second Achaemenid Period/Artaxerxes III|Egyptian-359/12~|:Egyptian|疑|准=年|朝代=Egypt Dynasty XXXI|时期=Late Period',
		'/Khabash|Egyptian-338~-335|:Egyptian|疑|准=年|ruler=Khababash;Khabbash;Chababash',
		'/Darius III|Egyptian-337~|:Egyptian|疑|准=年',

		// 时期=Ptolemaic (Hellenistic)
		'Argead Dynasty/Alexander III|Egyptian-332~|:Egyptian|疑|准=年|时期=Ptolemaic|朝代=Egypt Dynasty XXXII',
		'/Philip III|-323/6/11~|:Egyptian|疑|准=年|ruler=Philippus Arrhidaeus',
		'/Alexander IV|-317/12/25~|:Egyptian|疑|准=年',

		'Ptolemaic Dynasty/Ptolemy I|Egyptian-305~|:Egyptian|疑|准=年|ruler=Ptolemy I Soter|时期=Ptolemaic|注=共治者:王后 Berenike I;Berenice I of Egypt',
		/**
		 * Ever since Pestman, Chronologie, p. 18, it has been assumed that
		 * originally Ptolemy II Philadelphos counted his Egyptian regnal years
		 * from the death of his father (283 / 282 BC), but switched to another
		 * system, taking into account his coregency (starting in 285 / 284 BC),
		 * in the middle of his reign. Supposedly he skipped years 17 and 18,
		 * which were at that time unattested in Demotic or Greek sources.
		 * Recently Muhs has argued that this change of counting basis is in
		 * fact imaginary and that the two regnal years are indeed attested.
		 * Although the last word has not yet been said about this chronological
		 * problem, I have followed Muhs's reconstruction.
		 */
		// TM 43764: BC 284 Aug 29 - Sep 27 (P01, year 21, Epeiph)
		'/Ptolemy II|Egyptian-285/12~|:Egyptian|疑|准=年|ruler=Ptolemy II Philadelphos|注=共治者:王后 Arsinoe I',
		// TM 49771: BC 247 Dec 28 ((P02), year 39, Hathyr 06 ; cf. DBL)
		// TM 53665: BC 246 Feb 21? ((P02?), year 39, Tybi 01)
		// TM 8527: BC 246 Mar 14 (P03, year 01, Tybi 22)
		'/Ptolemy III|Egyptian-247/5/15~|:Egyptian|疑|准=年|ruler=Ptolemy III Euergetes I',
		'/Ptolemy IV|Egyptian-222/5~|:Egyptian|疑|准=年|ruler=Ptolemy IV Philopator|注=共治者:王后 Arsinoe III',
		'/Hugronaphor|Egyptian:-205/1/15~-192|:Egyptian|疑|准=年|ruler=Haronnophris;Chaonnophris',
		'/Ptolemy V|Egyptian-205/1/15~|:Egyptian|疑|准=年|ruler=Ptolemy V Epiphanes',
		'/Ptolemy VI|Egyptian:-181~-146/11/14|:Egyptian|疑|准=年|ruler=Ptolemy VI Philometor',
		'/Ptolemy VIII|Egyptian:-170~-164|:Egyptian|疑|准=年|ruler=Ptolemy VIII Euergetes II',
		'/Ptolemy VIII|Egyptian:-146/11/15~-117/11|25/=:Egyptian|疑|准=年',
		'/Kleopatra II|Egyptian:-132/12~-131|:Egyptian|疑|准=年|注=or Harsiesis?|君主性别=女',
		'/Kleopatra III|Egyptian:-117/12~-101|:Egyptian|疑|准=年|君主性别=女|注=共治者: Kleopatra IV (-116 to -115: Kleopatra III に追放され)',
		'/Ptolemy IX|Egyptian:-117/12~-107|:Egyptian|疑|准=年|ruler=Ptolemy IX Soter II',
		'/Ptolemy IX|Egyptian:-89~-82|29/=:Egyptian|疑|准=年|ruler=Ptolemy IX Soter II',
		'/Ptolemy X|Egyptian:-114~-88|:Egyptian|疑|准=年|ruler=Ptolemy X Alexander I',
		'/Kleopatra Berenike III|Egyptian:-82~-81|:Egyptian|疑|准=年|君主性别=女',
		'/Ptolemy XII|Egyptian:-81~-52|:Egyptian|疑|准=年|ruler=Ptolemy XII Neos Dionysos',
		'/Berenike IV|Egyptian:-59~-56|:Egyptian|疑|准=年|君主性别=女|注=共治者: Kleopatra VI',
		'/Kleopatra VII|Egyptian-52~|:Egyptian|疑|准=年|ruler=Kleopatra VII Philopator|君主性别=女',

		// https://en.wikipedia.org/wiki/List_of_Roman_emperors
		'Roman Empire/Augustus|Egyptian-30~|:Egyptian|疑|准=年',
		'/Tiberius|Egyptian:14~37|:Egyptian|疑|准=年',
		'/Caligula|Egyptian36/8~|:Egyptian|疑|准=年',
		'/Claudius|Egyptian40/6~|:Egyptian|疑|准=年',
		'/Nero|Egyptian54/3~|:Egyptian|疑|准=年',
		'/Galba|Egyptian67/11~|:Egyptian|疑|准=年',
		'/Vespasianus|Egyptian68/6~|:Egyptian|疑|准=年',
		'/Titus|Egyptian79/11~|:Egyptian|疑|准=年',
		'/Domitian|Egyptian81/11~|:Egyptian|疑|准=年',
		'/Traianus|Egyptian97~|:Egyptian|疑|准=年',
		'/Hadrianus|Egyptian116/12~|:Egyptian|疑|准=年',
		'/Antoninus Pius|Egyptian137/11~|:Egyptian|疑|准=年',
		// Year 21 of Marcus Aurelius (= Commodus) AD 180 Aug 29 – 181 Aug 28
		'/Marcus Aurelius|Egyptian160~|:Egyptian|疑|准=年',
		// Year 19 of Septimius Severus (= Caracalla) AD 210 Aug 29 – 211 Aug 28
		'/Septimius Severus|Egyptian192/9~|:Egyptian|疑|准=年',
		'/Macrinus|Egyptian216/9~|:Egyptian|疑|准=年',
		'/Elegabalus|Egyptian217/11~|:Egyptian|疑|准=年',
		'/Severus Alexander|Egyptian221/8~|:Egyptian|疑|准=年',
		'/Gordianus|Egyptian:237~240|:Egyptian|疑|准=年',
		'/Maximinus Thrax|Egyptian240~|:Egyptian|疑|准=年',
		'/Philippus Arabs|Egyptian243~|:Egyptian|疑|准=年',
		'/Gallus|Egyptian250~|:Egyptian|疑|准=年',
		'/Valerianus|Egyptian:253~259|:Egyptian|疑|准=年',
		'/Gallienus|Egyptian:253~268|:Egyptian|疑|准=年',
		// Macrinus and Quietus, as emperors
		'/Macrianus Minor|Egyptian:260~261|:Egyptian|疑|准=年',
		'/Quietus|Egyptian:260~261|:Egyptian|疑|准=年',
		'/Aurelianus|Egyptian269~|:Egyptian|疑|准=年',

		/**
		 * The Era of the Martyrs (Latin: anno martyrum or AM), also known as
		 * the Diocletian era (Latin: anno Diocletiani)
		 * 
		 * @see https://en.wikipedia.org/wiki/Era_of_Martyrs
		 */

		'/Diocletianus|Egyptian:284~|:Egyptian|疑|准=年',

		// 305~452 ディオクレティアヌス纪元または殉教纪元（じゅんきょうきげん）
		'Diocletian era|Egyptian:305~306|23/=:Egyptian|疑|准=年|注=殉道时期 (The Era of the Martyrs, 殉教纪元) 沿用古埃及历，并于亚历山大科普特正教会行用至今；请参照之。'

]).minute_offset = 2 * 60;

// ---------------------------------------------------------------------//

// gettext_config:{"id":"hittite"}
(CeL.era.pass_on.countries["Hittite"] = [

		// Trevor Bryce. (2002).
		// Life and society in the Hittite world. OUP Oxford.
		// page. xi : List of Hittite Kings

		// 西台君主列表 https://en.wikipedia.org/wiki/List_of_Hittite_kings
		// https://web.archive.org/web/20130729215948/http://www.hittites.info/history.aspx?text=history%2FMiddle+Empire.htm

		// 旧王国 (西台)（Old Hittite Kingdom）哈图沙成为首都。
		'Old Kingdom/Hattusili I|-1650~|:CE|疑|精=年|准=年',
		'/Mursili I|-1620~|:CE|疑|精=年|准=年|关系=grandson, adopted son',
		'/Hantili I|-1590~|:CE|疑|精=年|准=年|关系=brother-in-law|ruler=Ḫattušili I',
		'/Zidanta I|-1560~|:CE|疑|精=年|准=年|关系=son-in-law',
		'/Ammuna|-1550~|:CE|疑|精=年|准=年|关系=son',
		'/Huzziya I|-1530~|:CE|疑|精=年|准=年|关系=brother of Ammuna’s daughter in-law',
		'/Telipinu|-1525~-1500/1/1|:CE|疑|精=年|准=年|关系=brother-in-law',

		// 中王国 (西台)（Middle Hittite Kingdom）
		// 关于中王国，没有任何资料保存下来。但有的研究者将古王国的最后6位君主列为中王国时期的统治者。
		// 有些研究者认为并无以下6人。
		// 'Middle Kingdom/Alluwamna|-1500~|:CE|疑|精=年|准=年|关系=son-in-law',
		// '/Tahurwaili|-~|:CE|疑|精=年|准=年|关系=interloper',
		// '/Hantili II|-~|:CE|疑|精=年|准=年|关系=son of Alluwamna?',
		// '/Zidanta II|-1480~|:CE|疑|精=年|准=年|关系=son?',
		// '/Huzziya II|-~-1450|:CE|疑|精=年|准=年|关系=son?',
		// '/Muwatalli I|-~|:CE|疑|精=年|准=年|关系=interloper',

		// 新王国 (西台)（New Hittite Kingdom）
		// 苏皮卢利乌玛斯一世征服叙利亚、穆瓦塔利（Muwatalli）进攻埃及卡叠石（Kadesh）。
		// https://en.wikipedia.org/wiki/Short_chronology
		'New Kingdom/Tudḫaliya II|-1400~|:CE|疑|精=年|准=年|关系=grandson of Huzziya II?|注=Includes period of coregency',
		'/Arnuwanda I|-1380~|:CE|疑|精=年|准=年|关系=son-in-law, adopted son',
		'/Hattusili II|-1370~|:CE|疑|精=年|准=年|关系=son?|注=Hattusili II?',
		'/Tudhaliya III|-1360~|:CE|疑|精=年|准=年|关系=son?',
		'/Suppiluliuma I|-1344~|:CE|疑|精=年|准=年|关系=son',
		'/Arnuwanda II|-1322~|:CE|疑|精=年|准=年|关系=son',
		'/Mursili II|-1321~|:CE|疑|精=年|准=年|关系=brother',
		'/Muwatalli II|-1295~|:CE|疑|精=年|准=年|关系=son',
		'/Urhi-Tesub|-1272~|:CE|疑|精=年|准=年|关系=son|ruler=Mursili III',
		'/Hattusili III|-1267~|:CE|疑|精=年|准=年|关系=uncle',
		'/Tudhaliya IV|-1237~|:CE|疑|精=年|准=年|关系=son',
		'/Kurunta|-1228~|:CE|疑|精=年|准=年|关系=cousin',
		'/Tudhaliya IV|-1227~|:CE|疑|精=年|准=年|关系=cousin|注=2nd period as king 复位',
		'/Arnuwanda III|-1209~|:CE|疑|精=年|准=年|关系=son',
		'/Suppiluliuma II|-1207~-1178|:CE|疑|精=年|准=年|关系=brother',

]).minute_offset = 2 * 60;

// ---------------------------------------------------------------------//

// 法国皇室 法国君主列表
// https://fr.wikipedia.org/wiki/Liste_des_monarques_de_France
// https://www.timetoast.com/timelines/les-monarques-de-france
// https://fr.wikipedia.org/wiki/Liste_des_reines_et_imp%C3%A9ratrices_de_France

// https://en.wikipedia.org/wiki/Unicode_subscripts_and_superscripts
// https://github.com/gtoubiana/acte
// gettext_config:{"id":"france"}
(CeL.era.pass_on.countries["France"] = [

		// Clovis Iᵉʳ ˢᵗ
		'Mérovingiens/Clovis Ier|481~|:CE|ruler=Clovis Iᵉʳ|朝代=Dynastie Mérovingienne;Merovingian dynasty|历法=France',
		// TODO: 资料还存有错误
		'/Clodomir|511/11/27~524/6/25|:CE',
		'/Thierry Ier|511/11/27~|:CE|准=年|ruler=Theuderic I',
		'/Thibert Ier|534~|:CE|准=年',
		'/Thibaut|548~555|:CE|准=年',
		'/Childebert Ier|511~558/12/12|:CE|准=年',
		'/Clotaire Ier|511~|:CE|准=年',
		'/Caribert Ier|561/11/29~567/3/5|:CE',
		'/Sigebert Ier|561~575/12|:CE',
		'/Chilpéric Ier|561~584/9|:CE|准=年',
		'/Gontran|561~592/3/28|:CE|准=年',
		'/Childebert II|575~596/3|:CE|准=年',
		'/Thibert II|595~612|:CE|准=年',
		'/Thierry II|595~|:CE|准=年',
		'/Sigebert II|613~613/10/10|:CE|准=年',
		'/Clotaire II|584~629/10/18|:CE|准=年',
		'/Dagobert Ier|623~639/1/19|:CE|准=年',
		'/Caribert II|629~632/4/8|:CE|准=年',
		'/Sigebert III|639~656/2/1|:CE|准=年',
		'/Clovis II|639~657/10/31|:CE|准=年|ruler=Clovis II « le Fainéant »',
		'/Childebert|656~662/10/18|:CE|准=年|ruler=Childebert « l\'Adopté »',
		'/Clotaire III|657~673|:CE|准=年',
		'/Childéric II|662~|:CE|准=年',
		'/Thierry III|675~691|:CE|准=年',
		'/Clovis III|675~|:CE|准=年',
		'/Dagobert II|676~679/12/23|:CE|准=年',
		'/Clovis IV|691~|:CE|准=年',
		'/Childebert IV|695~|:CE|准=年|ruler=Childebert III',
		'/Dagobert III|711~|:CE|准=年',
		'/Chilpéric II|715~721|:CE|准=年',
		'/Clotaire IV|717~719|:CE|准=年',
		'/Thierry IV|721~737|:CE|准=年',

		'/Interrègne de Childéric III|743~|:CE|准=年',

		'Carolingiens/Pépin le Bref|751/11~|:CE|朝代=Dynastie Carolingienne|ruler=Pépin « le Bref »;Pépin III, dit le Bref',
		'/Carloman Ier|768/9/24~771/12/4|:CE',
		'/Charlemagne|768/9/24~|:CE|ruler=Charles Ier;Charles Ier « le Grand »',
		'/Louis Ier|814/1/28~|:CE|ruler=Louis Ier « le Pieux »;Louis Ier « le Débonnaire »',
		'/Charles II|840/6/20~|:CE|ruler=Charles II « le Chauve »',
		'/Louis II|877/10/6~|:CE|ruler=Louis II « le Bègue »',
		'/Louis III|879/4/11~882/8/5|:CE',
		'/Carloman II|879/4/11~884/12/6|:CE',
		'/Charles|885/6~887/11|:CE|ruler=Charles « le Gros »',
		'/Eudes|888/2/29~|:CE',
		'/Charles III|898/1/1~|:CE|ruler=Charles III « le Simple »',
		'/Robert Ier|922/6/29~|:CE',
		'/Raoul|923/6/15~936/1/15|:CE|ruler=Raoul de Bourgogne',
		'/Louis IV|936/9/19~|:CE',
		'/Lothaire|954/9/10~|:CE|ruler=Lothaire (roi des Francs)',
		'/Louis V|986/3/2~987/5/21|:CE|ruler=Louis V « le Fainéant »',

		'Capétiens directs/Hugues Capet|987/6/3~|:CE',
		'/Robert II|996/10/24~|:CE|ruler=Robert II « le Pieux »',
		'/Henri Ier|1031/7/10~|:CE',
		'/Philippe Ier|1060/8/4~|:CE',
		'/Louis VI|1108/7/29~|:CE|ruler=Louis VI « le Gros »',
		'/Louis VII|1137/8/1~|:CE|ruler=Louis VII « le Jeune »',
		'/Philippe II|1180/9/18~|:CE|ruler=Philippe II « Auguste »',
		'/Louis VIII|1223/7/14~|:CE|ruler=Louis VIII « le Lion »',
		'/Louis IX|1226/11/8~|:CE|ruler=Louis IX « Saint Louis »',
		'/Philippe III|1270/8/25~|:CE|ruler=Philippe III « le Hardi »',
		'/Philippe IV|1285/10/5~|:CE|ruler=Philippe IV « le Bel »',
		'/Louis X|1314/11/29~|:CE|ruler=Louis X « le Hutin »',
		'/Jean Ier|1316/11/15~|:CE|ruler=Jean Ier « le Posthume »',
		'/Philippe V|1316/11/19~|:CE|ruler=Philippe V « le Long »',
		'/Charles IV|1322/1/3~1328/2/1|:CE|ruler=Charles IV « le Bel »',

		'Valois/Philippe VI|1328/4/1~|:CE|朝代=Maison capétienne de Valois',
		'/Jean II|1350/8/22~|:CE|ruler=Jean II « le Bon »',
		'/Charles V|1364/4/8~|:CE|ruler=Charles V « le Sage »',
		'/Charles VI|1380/9/16~|:CE|ruler=Charles VI « le Bien-Aimé »;Charles VI « le Fol »',
		'/Charles VII|1422/10/22~|:CE|ruler=Charles VII « le Victorieux »;Charles VII « le Bien Servi »',
		'/Louis XI|1461/7/22~|:CE|ruler=Louis XI « le Prudent »',
		'/Charles VIII|1483/8/30~|:CE|ruler=Charles VIII « l\'Affable »',
		'/Louis XII|1498/4/7~|:CE|ruler=Louis XII « le Père du Peuple »',
		'/François Ier|1515/1/1~|:CE|ruler=François d\'Orléans;François Ier « le Père et Restaurateur des Lettres »',
		'/Henri II|1547/3/31~|:CE',
		'/François II|1559/7/10~|:CE',
		'/Charles IX|1560/12/5~|:CE',
		'/Henri III|1574/3/30~|:CE',

		'Bourbon/Henri IV|1589/8/2~|:CE|ruler=Henri IV « le Grand »;Henri IV « le Vert-Galant »|朝代=Maison capétienne de Bourbon;Dynastie des Bourbons',
		'/Louis XIII|1610/5/14~|:CE|ruler=Louis XIII « le Juste »',
		'/Louis XIV|1643/5/14~|:CE|ruler=Louis XIV « le Grand »;Louis XIV « le Roi-Soleil »',
		'/Louis XV|1715/9/1~|:CE|ruler=Louis XV « le Bien-Aimé »',
		'/Louis XVI|1774/5/10~1792/8/10|:CE',

		// Ere Bonaparte
		'Bonaparte/Napoléon Ier|1804/5/18~|:CE',
		// Ere des Bourbons
		'Bourbons/Louis XVIII|1814/4/6~|:CE|ruler=Louis XVIII « le Désiré »',
		'Bonaparte/Napoléon Ier|1815/3/20~1815/6/22|12/=:CE',
		'Bourbons/Louis XVIII|1815/7/8~|:CE|ruler=Louis XVIII « le Désiré »',
		'/Charles X|1824/9/16~1830/8/2|:CE',
		// Ere Orléans
		'Orléans/Louis-Philippe Ier|1830/8/9~1848/2/24|:CE|朝代=Quatrième maison d\'Orléans|ruler=Louis-Philippe Ier « le Roi-Citoyen »',
		'Bonaparte/Napoléon III|1852/12/2~1870/9/4/|:CE'

]).minute_offset = 1 * 60;

// ---------------------------------------------------------------------//
// 英国君主列表

// gettext_config:{"id":"british"}
(CeL.era.pass_on.countries["British"] = [
		// https://en.wikipedia.org/wiki/List_of_monarchs_of_Wessex
		// The Kingdom of the Gewissae
		'Cerdicing dynasty/Cerdic|519~|:CE|时期=Wessex|精=年|准=年|注=Possibly Celtic, Brythonic, name.|历法=Great Britain',
		'/Cynric|534~|:CE|精=年|准=年|注=Son, or according to some sources grandson, of Cerdic.',
		'/Ceawlin|560~|:CE|精=年|准=年|注=Son of Cynric. Possibly Celtic, Brythonic, name.',
		'/Ceol|591~|:CE|精=年|准=年|注=Nephew of Ceawlin, grandson of Cynric.',
		'/Ceolwulf|597~|:CE|精=年|准=年|注=Brother of Ceol, grandson of Cynric.',
		'/Cynegils|611~|:CE|精=年|准=年|注=Sources derive him from Cynric, but name different dynasty members as his father. Possibly Celtic, Brythonic, name',
		'/Cenwalh|642~|:CE|精=年|准=年|注=Son of Cynegils. Possibly Celtic, Brythonic, name; Deposed',
		'Mercian dynasty/Penda|645~|:CE|时期=Wessex|精=年|准=年|注=King of Mercia, expelled Cenwalh.',
		'Cerdicing dynasty/Cenwalh|648~674|:CE|时期=Wessex|精=年|准=年|注=Restored; reigned jointly with his wife Queen Seaxburh 672 to 674.',
		'/Seaxburh|672~|:CE|精=年|准=年|注=Reigned jointly with her husband Cenwalh until his death 674',
		'/Æscwine|674~|:CE|精=年|准=年|注=Son of Cenfus.',
		'/Centwine|676~|:CE|精=年|准=年|注=Traditionally son of Cynegils, but this is disputed. Deposed by Cædwalla',
		'/Cædwalla|685~|:CE|精=年|准=年|注=Perhaps descendant of Ceawlin. Usurper; abdicated, possibly of British origin.',
		'/Ine|688~|:CE|精=年|准=年|注=Descendant of Ceawlin. Abdicated',
		'/Æthelheard|726~|:CE|精=年|准=年|注=Perhaps brother-in-law of Ine.',
		'/Cuthred|740~|:CE|精=年|准=年|注=Relative, possibly brother, of Æthelheard.',
		'/Sigeberht|756~|:CE|精=年|准=年|注=Distant relative of Cuthred. Deposed (and killed?) by Cynewulf',
		'/Cynewulf|757~|:CE|精=年|准=年|注=Assassinated by Cyneheard, brother of Sigeberht',
		'/Beorhtric|786~|:CE|精=年|准=年',
		"/Ecgberht|802~|:CE|精=年|准=年|注=Descendant of Ine's brother.",
		'/Æthelwulf|839~|:CE|精=年|准=年|注=Son of Ecgberht.',
		'/Æthelbald|858~|:CE|精=年|准=年|注=Son of Æthelwulf.',
		'/Æthelberht|860~|:CE|精=年|准=年|注=Son of Æthelwulf.',
		'/Æthelred|865~|:CE|精=年|准=年|注=Son of Æthelwulf.',
		'/Alfred the Great|871/4/23~|:CE|注=Son of Æthelwulf. The only Anglo-Saxon monarch to be given the epithet "the Great".',
		'/Edward the Elder|899/10/26~|:CE|注=Son of Alfred. Died 17 July 924',
		'/Ælfweard|924/7/17~924/8/2|:CE|疑|精=年|准=年|注=Second son of Edward the Elder. Died 2 August 924, only 16 days after his father. Only referred to as king in late sources.',
		'/Æthelstan|925~927|:CE|精=年|准=年|注=First son of Edward the Elder. Became King of the English in 927 when the Northumbrians accepted his lordship.',
		//
		'/Cwichelm|626~636|:CE|疑|精=年|准=年|注=Co-ruler with Cynegils, perhaps his son of this name.',
		'/Cenfus|674~674|:CE|疑|精=年|准=年|注=(Disputed) Perhaps reigned between Seaxburh and his son Æscwine. Given a remote descent from Cynric.',

		// TODO
		// https://en.wikipedia.org/wiki/List_of_English_monarchs
		// https://en.wikipedia.org/wiki/List_of_Scottish_monarchs
		// https://en.wikipedia.org/wiki/Monarchy_of_Ireland
		// https://zh.wikipedia.org/wiki/%E5%A5%B3%E6%80%A7%E5%90%9B%E4%B8%BB%E5%88%97%E8%A1%A8

		// https://en.wikipedia.org/wiki/List_of_British_monarchs
		'House of Stuart/Anne|1707/5/1~|:CE|君主性别=女|配偶=1683/7/28 George of Denmark|时期=British',
		'House of Hanover/George I|1714/8/1~|:CE|配偶=1682/11/21 Sophia Dorothea of Celle|时期=British',
		'/George II|1727/6/11~|:CE|配偶=1705/8/22 Caroline of Ansbach',
		'/George III|1760/10/25~|:CE|配偶=1761/9/8 Charlotte of Mecklenburg-Strelitz',
		'/George IV|1820/1/29~|:CE|配偶=1785/9/15 Maria Fitzherbert;1795/4/8 Caroline of Brunswick',
		'/William IV|1830/6/26~|:CE|配偶=1818/7/13 Adelaide of Saxe-Meiningen',
		'/Victoria|1837/6/20~|:CE|配偶=1840/2/10 Albert, Prince Consort|君主性别=女',
		'Houses of Saxe-Coburg and Gotha/Edward VII|1901/1/22~|:CE|配偶=1863/3/10 Alexandra of Denmark|时期=British',
		'House of Windsor/George V|1910/5/6~|:CE|配偶=1893/7/6 Mary of Teck|注=House of Windsor since 1917|时期=British',
		'/Edward VIII|1936/1/20~|:CE|配偶=1937/6/3 Wallis Simpson',
		'/George VI|1936/12/11~|:CE|配偶=1923/4/26 Queen Elizabeth The Queen Mother',
		'/Elizabeth II|1952/2/6~|:CE|生=1926/4/21|卒=2022/9/8 15:10 UTC+1|君主性别=女|配偶=1947/11/20 Prince Philip, Duke of Edinburgh',
		'/Charles III|2022/9/8~'
				+ CeL.era.pass_on.last_day
				+ '|:CE|生=1948/11/14|配偶=1981/7/29–1996 Diana Spencer; 2005/4/9 Camilla Parker Bowles'

]).minute_offset = 0 * 60;

// ---------------------------------------------------------------------//
// 西班牙君主列表

// gettext_config:{"id":"españa"}
(CeL.era.pass_on.countries["España"] = [
		// TODO:
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Arag%C3%B3n
		// https://en.wikipedia.org/wiki/List_of_Aragonese_monarchs
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Castilla
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Le%C3%B3n
		// https://es.wikipedia.org/wiki/Anexo:Monarcas_de_Asturias

		// https://es.wikipedia.org/wiki/Anexo:Reyes_de_Espa%C3%B1a
		// Sobrenombre 绰号
		'Casa de Trastámara/Isabel I de Castilla|1474/12/13~1504/11/25|:CE|Sobrenombre=la Católica|时期=España|君主性别=女',
		'/Fernando II de Aragón|1475/1/15~|:CE|Sobrenombre=el Católico|配偶=Isabel I de Castilla',
		'/Juana I de Castilla|1504/11/26~1555/4/12|:CE|Sobrenombre=la Loca|配偶=Felipe I de Castilla|君主性别=女',
		'/Felipe I de Castilla|1506/7/12~1506/9/25|:CE|Sobrenombre=el Hermoso',
		'Casa de Austria/Carlos I|1516/3/14~|:CE|Sobrenombre=el César|配偶=Isabel de Portugal|时期=España',
		'/Felipe II|1556/1/16~|:CE|Sobrenombre=el Prudente|配偶=María I de Inglaterra;Isabel de Valois (1546-1568);Ana de Austria (1549-1580)',
		'/Felipe III|1598/9/13~|:CE|Sobrenombre=el Piadoso|配偶=Margarita de Austria-Estiria;Margarita de Austria',
		'/Felipe IV|1621/3/31~|:CE|Sobrenombre=el Grande;el Rey Planeta|配偶=Isabel de Borbón (reina de España);Isabel de Borbón;Mariana de Austria',
		'/Carlos II|1665/9/17~1700/11/1|:CE|Sobrenombre=el Hechizado|配偶=María Luisa de Orleans;Mariana de Neoburgo',
		'/Archiduque Carlos|1703/9/12~1715/7/2|:CE|配偶=Isabel Cristina de Brunswick-Wolfenbüttel',
		// 卡佩王朝波旁分支
		'Casa de Borbón/Felipe V|1700/11/16~|:CE|Sobrenombre=el Animoso|配偶=María Luisa Gabriela de Saboya;Isabel de Farnesio|时期=España',
		'/Luis I|1724/1/15~1724/8/31|:CE|Sobrenombre=el Bien Amado;el Liberal|配偶=Luisa Isabel de Orleans',
		'/Felipe V|1724/9/6~|:CE|Sobrenombre=el Animoso|配偶=Isabel de Farnesio',
		'/Fernando VI|1746/7/9~|:CE|Sobrenombre=el Prudente;el Justo|配偶=Bárbara de Braganza',
		'/Carlos III|1759/8/10~|:CE|Sobrenombre=el Político;el Mejor Alcalde de Madrid|配偶=María Amalia de Sajonia',
		'/Carlos IV|1788/12/14~|:CE|Sobrenombre=el Cazador|配偶=María Luisa de Parma',
		'/Fernando VII|1808/3/19~1808/5/6|:CE|Sobrenombre=el Deseado;el Rey Felón',
		'Casa de Bonaparte/José I|1808/6/6~1813/12/11|:CE|Sobrenombre=Pepe Botella;Pepe Plazuelas|配偶=Julia Clary|时期=España',
		// primera restauración
		'Casa de Borbón/Fernando VII|1808/3/19~1808/5/6|:CE|Sobrenombre=el Deseado;el Rey Felón|配偶=María Isabel de Braganza;María Josefa de Sajonia;María Cristina de Borbón|时期=España',
		'/Fernando VII|1814/5/4~|:CE|Sobrenombre=el Deseado;el Rey Felón|配偶=María Isabel de Braganza;María Josefa de Sajonia;María Cristina de Borbón',
		'/Isabel II|1833/9/29~1868/9/30|:CE|Sobrenombre=la de los Tristes Destinos;la Reina Castiza|配偶=Francisco de Asís de Borbón|君主性别=女',
		'Casa de Saboya/Amadeo I|1870/11/16~1873/2/11|:CE|Sobrenombre=el Rey Caballero;el Electo|配偶=María Victoria dal Pozzo|时期=España',
		// segunda restauración
		'Casa de Borbón/Alfonso XII|1874/12/29~1885/11/25|:CE|Sobrenombre=el Pacificador|配偶=María de las Mercedes de Orleans;María Cristina de Habsburgo-Lorena|时期=España',
		'/Alfonso XIII|1886/5/17~1931/4/13|:CE|Sobrenombre=el Africano|配偶=Victoria Eugenia de Battenberg',
		// tercera restauración
		'Casa de Borbón/Juan Carlos I|1975/11/22~|:CE|配偶=Sofía de Grecia|时期=España',
		'/Felipe VI|2014/6/19~' + CeL.era.pass_on.last_day
				+ '|:CE|配偶=Letizia Ortiz'

// 西班牙横跨UTC-1和UTC两个时区，但是使用UTC+1为标准时间。
]).minute_offset = 1 * 60;

// ---------------------------------------------------------------------//
// 玛雅文明, pre-Columbian Maya civilization
// https://en.wikipedia.org/wiki/Category:Maya_rulers

// gettext_config:{"id":"maya"}
(CeL.era.pass_on.countries["Maya"] = [
		// http://www.mesoweb.com/palenque/resources/rulers/rulers_table.html
		// http://research.famsi.org/whos_who/pm_index.php
		// http://www.criscenzo.com/jaguarsun/dynasty.html
		// https://en.wikipedia.org/wiki/Palenque

		// Birth - Accession - Period-ending - Death
		// gettext_config:{"id":"palenque","mark_type":"part_of_string"}
		"Palenque/K'uk' B'ahlam I|Maya:8.19.15.3.4 1 K'an 2 K'ayab'~|:CE|君主名=Bahlum-K'uk';Quetzal;Kuk|生=Maya:8.18.0.13.6 5 Kimi 14 K'ayab'",
		'/"Casper"|Maya:8.19.19.11.17 2 Kab\'an 10 Xul~|:CE|君主名=11 Rabbit;Manatee|生=Maya:8.19.6.8.8 11 Lamat 6 Xul',
		"/B'utz'aj Sak Chiik|Maya:9.2.12.6.18 3 Etz'nab' 11 Xul~|:CE|君主名=Butz'ah Sak Chik;Manik;Sak-Chik|生=Maya:9.1.4.5.0 12 Ahaw 13 Sak",
		"/Ahkal Mo' Nahb' I|Maya:9.3.6.7.17 5 Kab'an 0 Sotz'~|:CE|君主名=Akul Anab;Chaacal;Cauac-Uinal;Chaac|生=Maya:9.1.10.0.0 5 Ahaw 3 Sek|卒=Maya:9.4.10.4.17 5 Kab'an 5 Mak",
		"/K'an Joy Chitam I|Maya:9.4.14.10.4 5 K'an 12 K'ayab'~|:CE|君主名=K'an Hoy Chitam;K'an Hok' Chitam;Kan-Xul;Hok|生=Maya:9.2.15.3.8 12 Lamat 6 Wo|卒=Maya:9.6.11.0.16 7 Kib' 4 K'ayab'",
		"/Ahkal Mo' Nahb' II|Maya:9.6.11.5.1 1 Imix 4 Sip~|:CE|君主名=Akul Anab;Chaacal;Chaac;Cauac-Uinal|生=Maya:9.4.9.0.4 7 K'an 17 Mol|卒=Maya:9.6.16.10.7 9 Manik' 5 Yaxk'in",
		"/Kan B'ahlam I|Maya:9.6.18.5.12 10 Eb' 0 Wo~|:CE|君主名=Chan-Bahlum;Bahlum|生=Maya:9.4.10.1.5 11 Chikchan 13 Ch'en|卒=Maya:9.7.9.5.5 11 Chikchan 3 K'ayab'",
		"/Lady Yohl Ik'nal|Maya:9.7.10.3.8 9 Lamat 1 Muwan~|:CE|君主名=Ix Yohl Ik'nal;Lady Olnal;Lady Kan-Ik;Lady Ik;Lady K'anal-Ik'al|卒=Maya:9.8.11.6.12 2 Eb' 0 Mak",
		"/Aj Ne' Yohl Mat|Maya:9.8.11.9.10 8 Ok 18 Muwan~|:CE|君主名=Ajen Yohl Mat;Ah Neh Yohl Mat;Ah Ne Ohl Mat;Ah Lawal Mat;Aahc-Kan;Ah K'an;Ac-Kan|卒=Maya:9.8.19.4.6 2 Kimi 14 Mol",
		"/Muwaan Mat|Maya:9.8.19.7.18 9 Etz'nab' 6 Keh~|:CE",
		"/K'inich Janahb' Pakal|Maya:9.9.2.4.8 5 Lamat 1 Mol~|:CE|君主名=Pacal;Hanab Pakal;Pacal II;Pacal the Great;Lord Shield Pacal;Subject A;Sunshield;Sun-Shield;Lady 8 Flower|生=Maya:9.8.9.13.0 8 Ahaw 13 Pop|卒=Maya:9.12.11.5.18 6 Etz'nab' 11 Yax",
		// heir designation 9.10.8.9.3 9 Ak'b'al 6 Xul
		"/K'inich Kan B'ahlam II|Maya:9.12.11.12.10 8 Ok 3 K'ayab'~|:CE|君主名=Chan Bahlum|生=Maya:9.10.2.6.6 2 Kimi 19 Sotz'|卒=Maya:9.13.10.1.5 6 Chikchan 3 Pop",
		// captured 9.13.19.13.3 13 Ak'b'al 16 Yax
		// dedicates Palace House A-D 9.14.8.14.15 9 Men 3 Yax
		"/K'inich K'an Joy Chitam II|Maya:9.13.10.6.8 5 Lamat 6 Xul~|:CE|君主名=K'an Hoy Chitam;K'an Hok' Chitam;Kan-Xul;Subject B;Hok';Xul;K'an-Hok-Xul|生=Maya:9.10.11.17.0 11 Ahaw 8 Mac",
		"/K'inich Ahkal Mo' Nahb' III|Maya:9.14.10.4.2 9 Ik' 5 K'ayab'~|:CE|君主名=Akul Anab;Chaacal;Lord Chaac;Subject C|生=Maya:9.12.6.5.8 3 Lamat 6 Sak|卒=Post 9.15.5.0.0 10 Ahaw 8 Ch'en",
		// invests K'an Tok official 9.15.10.10.13 8 B'en 16 Kumk'u
		"/K'inich Janahb' Pakal II|742/1/23~|:CE|疑|君主名=U Pakal K'inich Janahb' Pakal",
		// first katun anniversary 9.17.13.0.7 7 Manik' 0 Pax
		"/K'inich K'uk' B'ahlam II|Maya:9.16.13.0.7 9 Manik' 15 Wo~|:CE|君主名=Kuk",
		"/Wak Kimi Janahb' Pakal|Maya:9.18.9.4.4 7 K'an 17 Muwan~9.18.10.4.4|疑|:CE|君主名=Wak Kimi Hanab Pakal;6 Kimi Pakal;Cimi-Pacal"

]).minute_offset = -6 * 60;

// ---------------------------------------------------------------------//

// TODO: 阿拉伯

// ---------------------------------------------------------------------//
// example.

if (false) {
	parse_era([
	// ------------------------
	// 准确指定。
	'朝代/君主(帝王)/纪年名称|[parser:]标准时间(如UTC+8) 起讫时间' + '|历数(月分资料)[|其他附加属性名称=值|..]',
	// e.g.,
	'西汉/平帝/元始|1/2/11~6/2/16',

	// inherited 继承
	'/君主(帝王)/纪年|起讫时间',
	// e.g.,
	'/孺子婴/居摄|~8/12/16',

	// inherited 继承
	'/纪年|起讫时间',
	// e.g.,
	'/初始|9/1/6~',

	// ------------------------
	// 准确指定。
	'朝代/君主(帝王)|起讫时间',
	// inherited 继承
	'/君主(帝王)|起讫时间',

	// ------------------------
	// 准确指定。
	'朝代兼纪年|起讫时间' ]);

	// ------------------------

	// parser:
	// (省略) : 预设为 CE。

	// ------------------------

	// 起讫时间: [起时间][讫时间]

	// 起时间:
	// "y/m/d" : start date
	// "y/m/干支" : start date
	// (省略) : 接续上一笔纪年，从上一笔纪年的下一日/下一秒起

	// 讫时间:
	// "~y/m/d" : 指定 end date
	// "~m/d" : 指定 end date
	// "~" : 省略后续 end date，持续至下一笔纪年或持续至今
	// "+d" : 持续日数

	// ------------------------

	// 历数(月分资料):
	// 日期次/年月日次: 除非设置(岁首)，否则一般等于日期名。

	// type 1:
	// [日期次=]:parser or reference (参照历数之国家或纪元来源)

	// type 2:
	// 借此可农历 → 公元纪年。
	// 年与年以 pack_era.year_separator 分隔。
	// 月与月以 pack_era.month_separator 分隔。
	// 当历法接著将起始的年次/月次/起始日码=当月之日数 data;
	'2/1/2=29;30;29';
	// 可使用之指定法: 月,年/,/日,/月/日,年/月/,年/月/日. e.g.,
	// =日数 data; : 1年/1月/1日起始
	'=29;30;29';
	// 月次=日数 data; : 1年/月次/1日起始
	'2=29;30;29;30';
	// 年次/=日数 data; : 年次/1月/1日起始
	'2/=30;2=29;闰2=30;3=29;';
	// /日次=日数 data; : 1年/1月/日次起始
	'/2=30;';
	// 年次/月次/=日数 data; : 年次/月次/1日起始
	'2/1/=30;2=29;闰2=30;3=29;' + ';11=30;12=29;11=30;12=29;后12=29	1=29;';
	// /月名/起始日码=日数 data; : 接续年次/月次/起始日码次
	'/1/2=28;30;29';
	// 日数 data; : 省略起始的年月日次，当作接续上一个纪年的月分日期。若没有可接续者，则预设为当历法之
	// 1/1。
	'29;30;29';

	// 编码压缩法:(这边为简化版。实际上会 padding 到 12个月。)
	'1=30;2=29;闰2=30;3=29'
	//
	== '30;29;闰2=30;29'
	// 按月排，最前面加上 1 以避免 0 起头、得处理长度不足问题。
	// 最后添上 4 闰月 index（并非月号！），1011 → [11] 为闰月。
	// 因此，长度为 13 或 14 + 4*闰月数。

	// 1 个闰月。0/1 定义见 MONTH_DAYS。
	// 30 29 30 29 → 0101
	// 闰2 @ index [2] → 0010(base 2)
	== '1 0101 0010'
	// parseInt('101010010', 2).toString(PACK_RADIX);
	== '9e';

	// 无闰月之12个月。0/1 定义见 MONTH_DAYS。
	'1101100101010'
	// parseInt('1101100101010',
	// 2).toString(PACK_RADIX);
	// 填满至长度 4。见 YEAR_CHUNK_SIZE。
	== '5d6 ';

	// TODO: 由于农历通常是大小月相间，应该以此压缩。

	// ------------------------

	// 其他附加属性名称=值|attribute name=value
	// 注=.+ : 注解/note。
	// 参照用
	// 岁首=\d+
	// 闰月名=.+
	// 月名=第n(次数n=1~12)个月:第几个月月名;第几个月:第几个月月名
	// 准=年|月|日|疑|传说: 准确度
	// 精=年: 精密度
	//
	// 其他具特殊功能之附加属性，请参照上述范例。
	//
	// TODO:
	// id=
	// 据=_URL_ : source/依据/凭据/根据/参考文献来源/出典考据。
	// URL=_URL_ : 当纪年之资料。

}

// ---------------------------------------------------------------------//

CeL.era.pass_on.step = function() {
	// 还需要等待载入的国家。
	var queue = CeL.era.load_queue,
	// 因为载入时间较长，使用此功能可降低反应倦怠感，改善体验。
	loaded = typeof CeL.env.era_data_load === 'function'
			&& CeL.env.era_data_load;

	if (Array.isArray(queue) && queue.length > 0) {
		var country = queue.shift();
		// console.info(country);

		CeL.era.set(this.countries[country], {
			国家 : country
		});
	}

	if (queue.length > 0) {
		if (loaded) {
			// CeL.log('Era data of country [' + country + '] loaded.');
			loaded(country, queue);
		}

		setTimeout(this.step, 0);
		return;
	}

	// done. 已载入历数资料。
	CeL.era.loaded = true;

	if (loaded)
		loaded(country);

	// Release memory. 释放被占用的记忆体.
	// this.CeL_era_data = this.step = this.queue = null;

	try {
		// delete this.CeL_era_data;
		// delete this.step;
		// delete this.queue;
		delete CeL.era.pass_on;
		delete CeL.era.load_queue;
	} catch (e) {
		// IE10 不允许 <code>delete this.*;</code>。
		// Error 445 [TypeError] (facility code 10): 物件不支援此动作
	}

}.bind(CeL.era.pass_on);

if (typeof CeL === 'function') {
	CeL.run('data.date.era', function() {
		// delete this.CeL_era_data.data;

		// 准备开始载入历数资料。
		CeL.era.loaded = false;

		var queue = CeL.era.load_queue = [];
		// 国家
		for ( var country in this.countries)
			queue.push(country);

		if (typeof CeL.env.era_data_load === 'function') {
			// 第一次呼叫 callback。
			// 在载入era模组之前设定好，可以用来筛选需要载入的国家。
			CeL.env.era_data_load(this.countries, queue);
		}
		// console.log('Load ' + queue.join(', '));

		setTimeout(this.step, 0);

	}.bind(CeL.era.pass_on));

} else {
	CeL.era.pass_on.step();
}
